[
  {
    "title": "Giới thiệu / Mở đầu",
    "level": 0,
    "body": "Chương 1\nKHÁI LUẬN VỀ TRIẾT HỌC VÀ TRIẾT HỌC MÁC - LÊNIN"
  },
  {
    "title": "A. MỤC TIÊU",
    "level": 1,
    "body": ""
  },
  {
    "title": "1. Về kiến thức: Trang bị cho sinh viên những tri thức cơ bản về triết học nói chung, những điều kiện ra đời của triết học Mác - Lênin. Đồng thời, giúp sinh viên nhận thức được thực chất cuộc cách mạng trong triết học do C. Mác và Ph. Ăngghen thực hiện và các giai đoạn hình thành, phát triển triết học Mác - Lênin; vai trò của triết học Mác - Lênin trong đời sống xã hội và trong thời đại ngày nay.",
    "level": 2,
    "body": ""
  },
  {
    "title": "2. Về kỹ năng: Giúp sinh viên biết vận dụng tri thức đã học làm cơ sở cho việc nhận thức những nguyên lý cơ bản của triết học Mác - Lênin; biết đấu tranh chống lại những luận điểm sai trái phủ nhận sự hình thành, phát triển triết học Mác - Lênin.",
    "level": 2,
    "body": ""
  },
  {
    "title": "3. Về tư tưởng: Giúp sinh viên củng cố niềm tin vào bản chất khoa học và cách mạng của chủ nghĩa Mác - Lênin nói chung và triết học Mác - Lênin nói riêng.",
    "level": 2,
    "body": ""
  },
  {
    "title": "B. NỘI DUNG",
    "level": 1,
    "body": ""
  },
  {
    "title": "I- TRIẾT HỌC VÀ VẤN ĐỀ CƠ BẢN CỦA TRIẾT HỌC",
    "level": 1,
    "body": ""
  },
  {
    "title": "1. Khái lược về triết học",
    "level": 2,
    "body": ""
  },
  {
    "title": "a) Nguồn gốc của triết học",
    "level": 3,
    "body": "Là một loại hình nhận thức đặc thù của con người, triết học ra đời ở cả phương Đông và phương Tây gần như cùng một thời gian (khoảng từ thế kỷ VIII đến thế kỷ VI trước Công nguyên) tại các trung tâm văn minh lớn của nhân loại thời cổ đại. Ý thức triết học xuất hiện không ngẫu nhiên, mà có nguồn gốc thực tế từ tồn tại xã hội với một trình độ nhất định của sự phát triển văn minh, văn hóa và khoa học. Con người, với kỳ vọng được đáp ứng nhu cầu về nhận thức và hoạt động thực tiễn của mình đã sáng tạo ra những luận thuyết chung nhất, có tính hệ thống, phản ánh thế giới xung quanh và thế giới của chính con người. Triết học là dạng tri thức lý luận xuất hiện sớm nhất trong lịch sử các loại hình lý luận của nhân loại.\nVới tư cách là một hình thái ý thức xã hội, triết học có nguồn gốc nhận thức và nguồn gốc xã hội.\n* Nguồn gốc nhận thức\nNhận thức thế giới là một nhu cầu tự nhiên, khách quan của con người. Về mặt lịch sử, tư duy huyền thoại và tín ngưỡng nguyên thủy là loại hình triết lý đầu tiên mà con người dùng để giải thích thế giới bí ẩn xung quanh. Người nguyên thủy kết nối những hiểu biết rời rạc, mơ hồ, phi lôgích... của mình trong các quan niệm đầy xúc cảm và hoang tưởng thành những huyền thoại để giải thích mọi hiện tượng. Đỉnh cao của tư duy huyền thoại và tín ngưỡng nguyên thủy là kho tàng những câu chuyện thần thoại và những tôn giáo sơ khai như Tô tem giáo, Bái vật giáo, Saman giáo. Thời kỳ triết học ra đời cũng là thời kỳ suy giảm và thu hẹp phạm vi của các loại hình tư duy huyền thoại và tôn giáo nguyên thủy. Triết học chính là hình thức tư duy lý luận đầu tiên trong lịch sử tư tưởng nhân loại thay thế được cho tư duy huyền thoại và tôn giáo.\nTrong quá trình sống và cải biến thế giới, từng bước con người có kinh nghiệm và có tri thức về thế giới. Ban đầu là những tri thức cụ thể, riêng lẻ, cảm tính. Cùng với sự tiến bộ của sản xuất và đời sống, nhận thức của con người dần dần đạt đến trình độ cao hơn trong việc giải thích thế giới một cách hệ thống, lôgích và nhân quả... Mối quan hệ giữa cái đã biết và cái chưa biết là đối tượng, đồng thời là động lực đòi hỏi nhận thức ngày càng quan tâm sâu sắc hơn đến cái chung, những quy luật chung. Sự phát triển của tư duy trừu tượng và năng lực khái quát trong quá trình nhận thức sẽ đến lúc làm cho các quan điểm, quan niệm chung nhất về thế giới và về vai trò của con người trong thế giới đó hình thành - đó là lúc triết học xuất hiện với tư cách là một loại hình tư duy lý luận đối lập với các giáo lý tôn giáo và triết lý huyền thoại.\nVào thời cổ đại, khi các loại hình tri thức còn ở trong tình trạng tản mạn, dung hợp và sơ khai, các khoa học độc lập chưa hình thành, thì triết học đóng vai trò là dạng nhận thức lý luận tổng hợp, giải quyết tất cả các vấn đề lý luận chung về tự nhiên, xã hội và tư duy. Từ buổi đầu lịch sử triết học và tới tận thời kỳ trung cổ, triết học vẫn là tri thức bao trùm, là “khoa học của các khoa học”. Trong hàng nghìn năm đó, triết học được coi là có sứ mệnh mang trong mình mọi trí tuệ của nhân loại. Sự dung hợp đó của triết học, một mặt phản ánh tình trạng chưa chín muồi của các khoa học chuyên ngành; mặt khác nói lên nguồn gốc nhận thức của chính triết học. Triết học không thể hình thành từ mảnh đất trống, mà phải dựa vào các tri thức khác để khái quát và định hướng ứng dụng. Các loại hình tri thức cụ thể ở thế kỷ VII trước Công nguyên thực tế đã khá phong phú, đa dạng. Nhiều thành tựu mà về sau người ta xếp vào tri thức cơ học, toán học, y học, nghệ thuật, kiến trúc, quân sự và cả chính trị... ở châu Âu thời bấy giờ đã đạt tới mức mà đến nay vẫn còn khiến con người ngạc nhiên. Giải phẫu học cổ đại đã phát hiện ra những tỷ lệ đặc biệt cân đối của cơ thể người và những tỷ lệ này đã trở thành những “chuẩn mực vàng” trong hội họa và kiến trúc cổ đại, góp phần tạo nên một số kỳ quan của thế giới. Dựa trên những tri thức như vậy, triết học ra đời và khái quát các tri thức riêng lẻ thành luận thuyết, trong đó có những khái niệm, phạm trù và quy luật... của mình.\nNhư vậy, nói đến nguồn gốc nhận thức của triết học là nói đến sự hình thành, phát triển của tư duy trừu tượng, của năng lực khái quát trong nhận thức của con người. Đến một giai đoạn nhất định tri thức cụ thể, riêng lẻ về thế giới phải được tổng hợp, trừu tượng hóa, khái quát hóa thành những khái niệm, phạm trù, quan điểm, quy luật, luận thuyết... đủ sức phổ quát để giải thích thế giới. Triết học ra đời đáp ứng nhu cầu đó của nhận thức. Do nhu cầu của sự tồn tại, con người không thỏa mãn với các tri thức riêng lẻ, cục bộ về thế giới, càng không thỏa mãn với cách giải thích của các tín điều và giáo lý tôn giáo. Tư duy triết học bắt đầu từ các triết lý, từ sự khôn ngoan, từ tình yêu sự thông thái dần hình thành các hệ thống những tri thức chung nhất về thế giới.\nTriết học chỉ xuất hiện khi kho tàng tri thức của loài người đã hình thành được một vốn hiểu biết nhất định và trên cơ sở đó, tư duy con người cũng đã đạt đến trình độ có khả năng rút ra được cái chung trong muôn vàn những sự kiện, hiện tượng riêng lẻ.\n* Nguồn gốc xã hội\nTriết học không ra đời trong xã hội mông muội dã man, như C. Mác nói: “Triết học không treo lơ lửng ở ngoài thế giới, cũng như bộ óc không tồn tại bên ngoài con người”. Triết học ra đời khi nền sản xuất xã hội đã có sự phân công lao động và loài người đã xuất hiện giai cấp, tức là khi chế độ cộng sản nguyên thủy tan rã, chế độ chiếm hữu nô lệ đã hình thành, phương thức sản xuất dựa trên sở hữu tư nhân về tư liệu sản xuất đã xác định và ở trình độ khá phát triển. Xã hội có giai cấp và nạn áp bức giai cấp hà khắc đã được luật hóa. Nhà nước, công cụ trấn áp và điều hòa lợi ích giai cấp đủ trưởng thành, “từ chỗ là tôi tớ của xã hội biến thành chủ nhân của xã hội”.\nGắn liền với các hiện tượng xã hội trên là lao động trí óc đã tách khỏi lao động chân tay. Trí thức xuất hiện với tư cách là một tầng lớp xã hội, có vị thế xã hội xác định. Vào khoảng thế kỷ VII - V trước Công nguyên, tầng lớp quý tộc, tăng lữ, điền chủ, nhà buôn, binh lính... đã chú ý đến việc học hành. Hoạt động giáo dục đã trở thành một nghề trong xã hội. Tri thức toán học, địa lý, thiên văn, cơ học, pháp luật, y học... đã được giảng dạy. Nghĩa là tầng lớp trí thức đã được xã hội ít nhiều trọng vọng. Tầng lớp này có điều kiện và nhu cầu nghiên cứu, có năng lực hệ thống hóa các quan niệm, quan điểm thành học thuyết, lý luận. Những người xuất sắc trong tầng lớp này đã hệ thống hóa thành công tri thức thời đại dưới dạng các quan điểm, các học thuyết lý luận... có tính hệ thống, giải thích được sự vận động, quy luật hay các quan hệ nhân quả của một đối tượng nhất định, được xã hội công nhận là các nhà thông thái, các triết gia (Wise man, Sage, Scholars, Philosopher), tức là các nhà tư tưởng. Về mối quan hệ giữa các triết gia với cội nguồn của mình, C. Mác nhận xét: “Nhưng các triết gia không mọc lên như nấm từ trái đất, họ là sản phẩm của thời đại của mình, của dân tộc mình, mà dòng sữa tinh tế nhất, quý giá và vô hình được tập trung lại trong những tư tưởng triết học”.\nTriết học xuất hiện trong lịch sử loài người với những điều kiện như vậy và chỉ trong những điều kiện như vậy - là nội dung của vấn đề nguồn gốc xã hội của triết học. “Triết học” là thuật ngữ được sử dụng lần đầu tiên trong trường phái Socrates (Xôcrát). Còn thuật ngữ “Triết gia” (philosophos) đầu tiên xuất hiện ở Heraclitus (Hêraclit), dùng để chỉ người nghiên cứu về bản chất của sự vật.\nNhư vậy, triết học chỉ ra đời khi xã hội loài người đã đạt đến một trình độ tương đối cao của sản xuất xã hội, phân công lao động xã hội hình thành, của cải tương đối dư thừa, tư hữu hóa tư liệu sản xuất được luật định, giai cấp phân hóa rõ và mạnh, nhà nước ra đời. Trong một xã hội như vậy, tầng lớp trí thức xuất hiện, giáo dục và nhà trường hình thành và phát triển, các nhà thông thái đã đủ năng lực tư duy để trừu tượng hóa, khái quát hóa, hệ thống hóa toàn bộ tri thức thời đại và các hiện tượng của tồn tại xã hội để xây dựng nên các học thuyết, các lý luận, các triết thuyết. Với sự tồn tại mang tính pháp lý của chế độ sở hữu tư nhân về tư liệu sản xuất, của trật tự giai cấp và của bộ máy nhà nước, triết học đã mang trong mình tính giai cấp sâu sắc, nó công khai tính đảng là phục vụ cho lợi ích của những giai cấp, những lực lượng xã hội nhất định.\nNguồn gốc nhận thức và nguồn gốc xã hội của sự ra đời của triết học chỉ là sự phân chia có tính chất tương đối để hiểu triết học đã ra đời trong điều kiện nào và với những tiền đề như thế nào. Trong thực tế của xã hội loài người khoảng hơn 2.500 năm trước, triết học ở Athens hay Trung Hoa và Ấn Độ cổ đại đều bắt đầu từ sự rao giảng của các triết gia, không nhiều người trong số họ được xã hội thừa nhận ngay. Sự tranh cãi và phê phán thường khá quyết liệt ở cả phương Đông và phương Tây, không ít quan điểm, học thuyết phải mãi đến nhiều thế hệ sau mới được khẳng định, cũng có những nhà triết học phải hy sinh mạng sống của mình để bảo vệ học thuyết, quan điểm mà họ cho là chân lý.\nThực ra những bằng chứng thể hiện sự hình thành triết học hiện không còn nhiều, đa số tài liệu triết học thành văn thời cổ đại Hy Lạp đã mất, hoặc không còn nguyên vẹn. Thời tiền cổ đại (Pre - Classical period) chỉ còn lại một ít các câu trích, chú giải và bản ghi tóm lược do các tác giả đời sau viết lại. Tất cả tác phẩm của Plato (Platôn), khoảng một phần ba tác phẩm của Aristotle (Arixtốt) và một số ít tác phẩm của Theophrastus, người kế thừa Aristotle, đã bị thất lạc. Một số tác phẩm chữ Latinh và Hy Lạp của trường phái Epicurus (Êpiquya) (341 - 270 trước Công nguyên), chủ nghĩa Khắc kỷ (Stoicism) và Hoài nghi luận của thời hậu văn hóa Hy Lạp cũng vậy."
  },
  {
    "title": "b) Khái niệm triết học",
    "level": 3,
    "body": "Ở Trung Quốc, chữ triết (哲) đã có từ rất sớm, và ngày nay, chữ triết học (哲學) được coi là tương đương với thuật ngữ philosophia của Hy Lạp, với ý nghĩa là sự truy tìm bản chất của đối tượng nhận thức, thường là con người, xã hội, vũ trụ và tư tưởng. Triết học là biểu hiện cao của trí tuệ, là sự hiểu biết sâu sắc của con người về toàn bộ thế giới thiên - địa - nhân và định hướng nhân sinh quan cho con người.\nỞ Ấn Độ, thuật ngữ Dar’sana (triết học) nghĩa gốc là chiêm ngưỡng, hàm ý là tri thức dựa trên lý trí, là con đường suy ngẫm để dẫn dắt con người đến với lẽ phải.\nỞ phương Tây, thuật ngữ “triết học” như đang được sử dụng phổ biến hiện nay, cũng như trong tất cả các hệ thống nhà trường, chính là φιλοσοφία (tiếng Hy Lạp; được sử dụng nghĩa gốc sang các ngôn ngữ khác: philosophy, philosophie, философия). Triết học, philosophia, xuất hiện ở Hy Lạp cổ đại, với nghĩa là yêu mến sự thông thái. Người Hy Lạp cổ đại quan niệm, philosophia vừa mang nghĩa là giải thích vũ trụ, định hướng nhận thức và hành vi, vừa nhấn mạnh đến khát vọng tìm kiếm chân lý của con người.\nNhư vậy, cả ở phương Đông và phương Tây, ngay từ đầu, triết học đã là hoạt động tinh thần bậc cao, là loại hình nhận thức có trình độ trừu tượng hóa và khái quát hóa rất cao. Triết học nhìn nhận và đánh giá đối tượng thông qua thực tế và thông qua hiện tượng quan sát được về con người và vũ trụ. Ngay cả khi triết học còn bao gồm mọi thành tựu của nhận thức, loại hình tri thức đặc biệt này đã tồn tại với tư cách là một hình thái ý thức xã hội.\nLà loại hình tri thức đặc biệt của con người, triết học nào cũng có tham vọng xây dựng nên bức tranh tổng quát nhất về thế giới và về con người. Nhưng khác với các loại hình tri thức xây dựng thế giới quan dựa trên niềm tin và quan niệm tưởng tượng về thế giới, triết học sử dụng các công cụ lý tính, các tiêu chuẩn lôgích và những kinh nghiệm mà con người đã khám phá thực tại để diễn tả thế giới và khái quát thế giới quan bằng lý luận. Tính đặc thù của nhận thức triết học thể hiện ở đó.\nBách khoa thư Britannica định nghĩa: “Triết học là sự xem xét lý tính, trừu tượng và có phương pháp về thực tại với tính cách là một chỉnh thể hoặc những khía cạnh nền tảng của kinh nghiệm và sự tồn tại người. Sự truy vấn triết học (Philosophical Inquiry) là thành phần trung tâm của lịch sử trí tuệ của nhiều nền văn minh”.\nBách khoa thư triết học mới của Viện Triết học Nga xuất bản năm 2001 đưa ra định nghĩa: Triết học là hình thức đặc biệt của nhận thức và ý thức xã hội về thế giới, được thể hiện thành hệ thống tri thức về những nguyên tắc cơ bản và nền tảng của tồn tại người, về những đặc trưng bản chất nhất của mối quan hệ giữa con người với tự nhiên, với xã hội và với đời sống tinh thần.\nCó nhiều định nghĩa về triết học, nhưng các định nghĩa thường bao hàm những nội dung chủ yếu sau:\n- Triết học là một hình thái ý thức xã hội.\n- Khách thể khám phá của triết học là thế giới (gồm cả thế giới bên trong và bên ngoài con người) trong hệ thống chỉnh thể toàn vẹn vốn có của nó.\n- Triết học giải thích tất cả mọi sự vật, hiện tượng, quá trình và quan hệ của thế giới, với mục đích tìm ra những quy luật phổ biến nhất chi phối, quy định và quyết định sự vận động của thế giới, của con người và của tư duy.\n- Với tư cách là loại hình nhận thức đặc thù, độc lập với khoa học và khác biệt với tôn giáo, tri thức triết học mang tính hệ thống, lôgích và trừu tượng về thế giới, bao gồm những nguyên tắc cơ bản, những đặc trưng bản chất và những quan điểm nền tảng về mọi tồn tại.\n- Triết học là hạt nhân của thế giới quan.\nTriết học là hình thái đặc biệt của ý thức xã hội, được thể hiện thành hệ thống các quan điểm lý luận chung nhất về thế giới, về con người và về tư duy của con người trong thế giới ấy.\nVới sự ra đời của triết học Mác - Lênin, triết học là hệ thống quan điểm lý luận chung nhất về thế giới và vị trí con người trong thế giới đó, là khoa học về những quy luật vận động, phát triển chung nhất của tự nhiên, xã hội và tư duy.\nTriết học khác với các khoa học khác ở tính đặc thù của hệ thống tri thức khoa học và phương pháp nghiên cứu. Tri thức khoa học triết học mang tính khái quát cao dựa trên sự trừu tượng hóa sâu sắc về thế giới, về bản chất cuộc sống con người. Phương pháp nghiên cứu của triết học là xem xét thế giới như một chỉnh thể trong mối quan hệ giữa các yếu tố và tìm cách đưa ra một hệ thống các quan niệm về chỉnh thể đó. Triết học là sự diễn tả thế giới quan bằng lý luận. Điều đó chỉ có thể thực hiện được khi triết học dựa trên cơ sở tổng kết toàn bộ lịch sử của khoa học và lịch sử của bản thân tư tưởng triết học.\nKhông phải mọi triết học đều là khoa học. Song, các học thuyết triết học đều có đóng góp ít nhiều, nhất định cho sự hình thành tri thức khoa học triết học trong lịch sử; là những “vòng khâu”, những “mắt khâu” trên “đường xoáy ốc” vô tận của lịch sử tư tưởng triết học nhân loại. Trình độ khoa học của một học thuyết triết học phụ thuộc vào sự phát triển của đối tượng nghiên cứu, hệ thống tri thức và hệ thống phương pháp nghiên cứu."
  },
  {
    "title": "c) Đối tượng của triết học trong lịch sử",
    "level": 3,
    "body": "Cùng với quá trình phát triển của xã hội, nhận thức và bản thân triết học, trên thực tế, nội dung đối tượng của triết học cũng thay đổi trong các trường phái triết học khác nhau.\nĐối tượng của triết học là các quan hệ phổ biến và các quy luật chung nhất của toàn bộ tự nhiên, xã hội và tư duy.\nNgay từ khi ra đời, triết học được xem là hình thái cao nhất của tri thức, bao hàm trong nó tri thức của tất cả các lĩnh vực mà mãi về sau, từ thế kỷ XV đến thế kỷ XVII, mới dần thuộc về các ngành khoa học riêng. “Nền triết học tự nhiên” là khái niệm chỉ triết học ở phương Tây thời kỳ bao gồm tất cả những tri thức mà con người có được, trước hết là các tri thức thuộc khoa học tự nhiên sau này như toán học, vật lý học, thiên văn học... Theo S. Hawking, I. Kant (Cantơ) là người đứng ở đỉnh cao nhất trong số các nhà triết học vĩ đại của nhân loại - những người coi “toàn bộ kiến thức của loài người trong đó có khoa học tự nhiên là thuộc lĩnh vực của họ”. Đây là nguyên nhân làm nảy sinh quan niệm vừa tích cực vừa tiêu cực rằng, triết học là khoa học của mọi khoa học.\nỞ thời kỳ Hy Lạp cổ đại, nền triết học tự nhiên đã đạt được những thành tựu vô cùng rực rỡ, mà “các hình thức muôn hình muôn vẻ của triết học Hy Lạp, đã có mầm mống và đang nảy nở hầu hết tất cả các loại thế giới quan sau này” - như đánh giá của Ph. Ăngghen. Ảnh hưởng của triết học Hy Lạp cổ đại còn in đậm dấu ấn đến sự phát triển của tư tưởng triết học ở Tây Âu mãi về sau.\nỞ Tây Âu thời trung cổ, khi quyền lực của Giáo hội bao trùm mọi lĩnh vực đời sống xã hội thì triết học trở thành nữ tì của thần học. Nền triết học tự nhiên bị thay bằng nền triết học kinh viện. Triết học trong đêm trường trung cổ chịu sự quy định và chi phối của hệ tư tưởng Kitô giáo. Đối tượng của triết học Kinh viện chỉ tập trung vào các chủ đề như niềm tin tôn giáo, thiên đường, địa ngục, mặc khải hoặc chú giải các tín điều phi thế tục... - những nội dung nặng về tư biện. Phải đến sau “cuộc cách mạng” Copernicus (Côpécních), các khoa học Tây Âu thế kỷ XV, XVI mới dần phục hưng, tạo cơ sở tri thức cho sự phát triển mới của triết học.\nCùng với sự hình thành và củng cố quan hệ sản xuất tư bản chủ nghĩa, để đáp ứng các yêu cầu của thực tiễn, đặc biệt yêu cầu của sản xuất công nghiệp, các bộ môn khoa học chuyên ngành, trước hết là các khoa học thực nghiệm đã ra đời. Những phát hiện lớn về địa lý và thiên văn cùng những thành tựu khác của khoa học thực nghiệm thế kỷ XV - XVI đã thúc đẩy cuộc đấu tranh giữa khoa học, triết học duy vật với chủ nghĩa duy tâm và tôn giáo. Vấn đề đối tượng của triết học bắt đầu được đặt ra. Những đỉnh cao mới trong chủ nghĩa duy vật thế kỷ XVII - XVIII đã xuất hiện ở Anh, Pháp, Hà Lan với những đại biểu tiêu biểu như F. Bacon (Bâycơn), T. Hobbes (Hốpxơ) (Anh), D. Diderot (Điđơrô), C. Helvetius (Henvêtiút) (Pháp), B. Spinoza (Xpinôda) (Hà Lan)... V.I. Lênin đặc biệt đánh giá cao công lao của các nhà duy vật Pháp thời kỳ này đối với sự phát triển chủ nghĩa duy vật trong lịch sử triết học trước C. Mác. V.I. Lênin viết: “Trong suốt cả lịch sử hiện đại của châu Âu và nhất là vào cuối thế kỷ XVIII, ở nước Pháp, nơi đã diễn ra một cuộc quyết chiến chống tất cả những rác rưởi của thời trung cổ, chống chế độ phong kiến trong các thiết chế và tư tưởng, chỉ có chủ nghĩa duy vật là triết học duy nhất triệt để, trung thành với tất cả mọi học thuyết của khoa học tự nhiên, thù địch với mê tín, với thói đạo đức giả, v.v.”. Bên cạnh chủ nghĩa duy vật Anh và Pháp thế kỷ XVII - XVIII, tư duy triết học cũng phát triển mạnh trong các học thuyết triết học duy tâm, đỉnh cao là Kant và G.W.F. Hegel (Hêghen), đại biểu xuất sắc của triết học cổ điển Đức.\nTriết học tạo điều kiện cho sự ra đời của các khoa học, nhưng sự phát triển của các khoa học chuyên ngành cũng từng bước xóa bỏ vai trò của triết học tự nhiên cũ, làm phá sản tham vọng của triết học muốn đóng vai trò là “khoa học của các khoa học”. Triết học Hegel là học thuyết triết học cuối cùng thể hiện tham vọng đó. Hêghen tự coi triết học của mình là một hệ thống nhận thức phổ biến, trong đó những ngành khoa học riêng biệt chỉ là những mắt khâu phụ thuộc vào triết học, là lôgích học ứng dụng.\nHoàn cảnh kinh tế - xã hội và sự phát triển mạnh mẽ của khoa học vào đầu thế kỷ XIX đã dẫn đến sự ra đời của triết học Mác. Đoạn tuyệt triệt để với quan niệm triết học là “khoa học của các khoa học”, triết học Mác xác định đối tượng nghiên cứu của mình là tiếp tục giải quyết mối quan hệ giữa tồn tại và tư duy, giữa vật chất và ý thức trên lập trường duy vật triệt để và nghiên cứu những quy luật chung nhất của tự nhiên, xã hội và tư duy. Các nhà triết học mácxít về sau đã đánh giá, với C. Mác, lần đầu tiên trong lịch sử, đối tượng của triết học được xác lập một cách hợp lý.\nVấn đề tư cách khoa học của triết học và đối tượng của triết học đã gây ra những cuộc tranh luận kéo dài cho đến hiện nay. Nhiều học thuyết triết học hiện đại ở phương Tây muốn từ bỏ quan niệm truyền thống về triết học, xác định đối tượng nghiên cứu riêng cho mình như mô tả những hiện tượng tinh thần, phân tích ngữ nghĩa, chú giải văn bản...\nMặc dù vậy, cái chung trong các học thuyết triết học là nghiên cứu những vấn đề chung nhất của giới tự nhiên, của xã hội và con người, mối quan hệ của con người, của tư duy con người nói riêng với thế giới."
  },
  {
    "title": "d) Triết học - hạt nhân lý luận của thế giới quan",
    "level": 3,
    "body": "* Thế giới quan\nNhu cầu tự nhiên của con người về mặt nhận thức là muốn hiểu biết đến tận cùng, sâu sắc và toàn diện về mọi hiện tượng, sự vật, quá trình. Nhưng tri thức mà con người và cả loài người ở thời nào cũng có hạn, là phần quá nhỏ bé so với thế giới cần nhận thức. Đó là tình huống có vấn đề của mọi tranh luận triết học và tôn giáo. Bằng trí tuệ duy lý, kinh nghiệm và sự mẫn cảm của mình, con người buộc phải xác định những quan điểm về toàn bộ thế giới làm cơ sở để định hướng cho nhận thức và hành động của mình. Đó chính là thế giới quan. Tương tự như các tiên đề, với thế giới quan, sự chứng minh nào cũng không đủ căn cứ, trong khi niềm tin lại mách bảo độ tin cậy.\n“Thế giới quan” là khái niệm có gốc từ tiếng Đức “Weltanschauung”, lần đầu tiên được Kant sử dụng trong tác phẩm Phê phán năng lực phán đoán (Kritik der Urteilskraft, 1790), dùng để chỉ thế giới quan sát được với nghĩa là thế giới trong sự cảm nhận của con người. Sau đó, F. Schelling (Sêlinh) đã bổ sung thêm cho khái niệm này một nội dung quan trọng là khái niệm thế giới quan luôn có sẵn trong mình một sơ đồ xác định về thế giới, một sơ đồ mà không cần tới một sự giải thích lý thuyết nào cả. Chính theo nghĩa này mà Hêghen đã nói đến “thế giới quan đạo đức”, J. Goethe (Gớt) nói đến “thế giới quan thơ ca”, còn L. Ranke (Ranhcơ)  nói đến “thế giới quan tôn giáo”. Kể từ đó, khái niệm thế giới quan như cách hiểu ngày nay đã phổ biến trong tất cả các trường phái triết học.\nKhái niệm thế giới quan, hiểu một cách ngắn gọn, là hệ thống quan điểm của con người về thế giới. Có thể định nghĩa: Thế giới quan là khái niệm triết học chỉ hệ thống các tri thức, quan điểm, tình cảm, niềm tin, lý tưởng xác định về thế giới và về vị trí của con người (bao hàm cả cá nhân, xã hội và nhân loại) trong thế giới đó. Thế giới quan quy định các nguyên tắc, thái độ, giá trị trong định hướng nhận thức và hoạt động thực tiễn của con người.\nCác khái niệm “Bức tranh chung về thế giới”, “Cảm nhận về thế giới”, “Nhận thức chung về cuộc đời”... khá gần gũi với khái niệm thế giới quan. Thế giới quan thường được coi là bao hàm trong nó nhân sinh quan - vì nhân sinh quan là quan niệm của con người về đời sống với các nguyên tắc, thái độ và định hướng giá trị của hoạt động con người.\nNhững thành phần chủ yếu của thế giới quan là tri thức, niềm tin và lý tưởng; trong đó tri thức là cơ sở trực tiếp hình thành thế giới quan, nhưng tri thức chỉ gia nhập thế giới quan khi đã được kiểm nghiệm ít nhiều trong thực tiễn và trở thành niềm tin. Lý tưởng là trình độ phát triển cao nhất của thế giới quan. Với tính cách là hệ quan điểm chỉ dẫn tư duy và hành động, thế giới quan là phương thức để con người chiếm lĩnh hiện thực, thiếu thế giới quan, con người không có phương hướng hành động.\nTrong lịch sử phát triển của tư duy, thế giới quan thể hiện dưới nhiều hình thức đa dạng khác nhau, nên cũng được phân loại theo nhiều cách khác nhau. Chẳng hạn, thế giới quan tôn giáo, thế giới quan khoa học và thế giới quan triết học. Ngoài ba hình thức chủ yếu này, còn có thể có thế giới quan huyền thoại (một trong những hình thức thể hiện tiêu biểu là Thần thoại Hy Lạp); theo những căn cứ phân chia khác, thế giới quan còn được phân loại theo các thời đại, các dân tộc, các tộc người, hoặc thế giới quan kinh nghiệm, thế giới quan thông thường....\nThế giới quan chung nhất, phổ biến nhất, được sử dụng (một cách ý thức hoặc không ý thức) trong mọi ngành khoa học và trong toàn bộ đời sống xã hội là thế giới quan triết học.\n* Hạt nhân lý luận của thế giới quan\nNói triết học là hạt nhân của thế giới quan, bởi: Thứ nhất, bản thân triết học chính là thế giới quan. Thứ hai, trong các thế giới quan khác như thế giới quan của các khoa học cụ thể, thế giới quan của các dân tộc, hay các thời đại... triết học bao giờ cũng là thành phần quan trọng, đóng vai trò là nhân tố cốt lõi. Thứ ba, với các loại thế giới quan tôn giáo, thế giới quan kinh nghiệm hay thế giới quan thông thường..., triết học bao giờ cũng có ảnh hưởng và chi phối, dù có thể không tự giác. Thứ tư, thế giới quan triết học như thế nào sẽ quy định các thế giới quan và các quan niệm khác như thế.\nThế giới quan duy vật biện chứng được coi là đỉnh cao của các loại thế giới quan đã từng có trong lịch sử vì thế giới quan này đòi hỏi thế giới phải được xem xét dựa trên những nguyên lý về mối liên hệ phổ biến và nguyên lý về sự phát triển. Từ đây, thế giới và con người được nhận thức theo quan điểm toàn diện, lịch sử, cụ thể và phát triển. Thế giới quan duy vật biện chứng bao gồm tri thức khoa học, niềm tin khoa học và lý tưởng cách mạng.\nKhi thực hiện chức năng của mình, những quan điểm thế giới quan luôn có xu hướng được lý tưởng hóa thành những khuôn mẫu văn hóa điều chỉnh hành vi. Ý nghĩa to lớn của thế giới quan thể hiện trước hết là ở điểm này.\nThế giới quan đóng vai trò đặc biệt quan trọng trong cuộc sống của con người và xã hội loài người, bởi lẽ: Thứ nhất, những vấn đề được triết học đặt ra và tìm lời giải đáp trước hết là những vấn đề thuộc thế giới quan. Thứ hai, thế giới quan đúng đắn là tiền đề quan trọng để xác lập phương thức tư duy hợp lý và nhân sinh quan tích cực trong khám phá và chinh phục thế giới. Trình độ phát triển của thế giới quan là tiêu chí quan trọng đánh giá sự trưởng thành của mỗi cá nhân cũng như của mỗi cộng đồng xã hội nhất định.\nThế giới quan tôn giáo cũng là thế giới quan chung nhất, có ý nghĩa phổ biến đối với nhận thức và hoạt động thực tiễn của con người. Nhưng do bản chất là đặt niềm tin vào các tín điều, coi tín ngưỡng cao hơn lý trí, phủ nhận tính khách quan của tri thức khoa học nên không được ứng dụng trong khoa học và thường dẫn đến sai lầm, tiêu cực trong hoạt động thực tiễn. Thế giới quan tôn giáo phù hợp hơn với những trường hợp con người không thể giải thích. Trên thực tế, có không ít nhà khoa học sùng đạo mà vẫn có phát minh, nhưng với những trường hợp này, mọi giải thích bằng nguyên nhân tôn giáo đều không thuyết phục; cần phải lý giải kỹ lưỡng hơn và sâu sắc hơn bằng những nguyên nhân vượt ra ngoài giới hạn của những tín điều.\nKhông ít người, trong đó có các nhà khoa học chuyên ngành, thường định kiến với triết học, không thừa nhận triết học có ảnh hưởng hay chi phối thế giới quan của mình. Tuy nhiên, với tư cách là một loại tri thức vĩ mô, giải quyết các vấn đề chung nhất của đời sống, ẩn giấu sâu trong mỗi suy nghĩ và hành vi của con người, tư duy triết học là một thành tố hữu cơ trong tri thức khoa học cũng như trong tri thức thông thường, là chỗ dựa tiềm thức của kinh nghiệm cá nhân, dù các cá nhân cụ thể có hiểu biết ở trình độ nào và thừa nhận đến đâu vai trò của triết học. Con người không có cách nào tránh được việc phải giải quyết các quan hệ ngẫu nhiên - tất yếu hay nhân quả trong hoạt động của họ, cả trong hoạt động khoa học chuyên sâu cũng như trong đời sống thường ngày. Nghĩa là, dù hiểu biết sâu hay nông cạn về triết học, dù yêu thích hay ghét bỏ triết học, con người vẫn bị chi phối bởi triết học, triết học vẫn có mặt trong thế giới quan của mỗi người. Vấn đề chỉ là thứ triết học nào sẽ chi phối con người trong hoạt động của họ, đặc biệt trong những phát minh, sáng tạo hay trong xử lý những tình huống gay cấn của đời sống.\nTrong tác phẩm Biện chứng của tự nhiên Ph. Ăngghen đã viết: “Những ai phỉ báng triết học nhiều nhất lại chính là những kẻ nô lệ của những tàn tích thông tục hóa, tồi tệ nhất của những học thuyết triết học tồi tệ nhất... Dù những nhà khoa học tự nhiên có làm gì đi nữa thì họ cũng vẫn bị triết học chi phối. Vấn đề chỉ ở chỗ họ muốn bị chi phối bởi một thứ triết học tồi tệ hợp mốt, hay họ muốn được hướng dẫn bởi một hình thức tư duy lý luận dựa trên sự hiểu biết về lịch sử tư tưởng và những thành tựu của nó”.\nNhư vậy, trên thực tế với tư cách là hạt nhân lý luận, triết học chi phối mọi thế giới quan, dù người ta có chú ý và thừa nhận điều đó hay không."
  },
  {
    "title": "2. Vấn đề cơ bản của triết học",
    "level": 2,
    "body": ""
  },
  {
    "title": "a) Nội dung vấn đề cơ bản của triết học",
    "level": 3,
    "body": "Triết học, khác với một số loại hình nhận thức khác, trước khi giải quyết các vấn đề cụ thể của mình, nó buộc phải giải quyết một vấn đề có ý nghĩa nền tảng và là điểm xuất phát để giải quyết tất cả những vấn đề còn lại - vấn đề về mối quan hệ giữa vật chất với ý thức. Đây chính là vấn đề cơ bản của triết học. Ph. Ăngghen viết: “Vấn đề cơ bản lớn của mọi triết học, đặc biệt là của triết học hiện đại, là vấn đề quan hệ giữa tư duy với tồn tại”.\nBằng kinh nghiệm hay lý trí, con người đều phải thừa nhận rằng, tất cả các hiện tượng trong thế giới này chỉ có thể, hoặc là hiện tượng vật chất, tồn tại bên ngoài và độc lập với ý thức con người, hoặc là hiện tượng thuộc tinh thần, ý thức của chính con người. Những đối tượng nhận thức lạ lùng, huyền bí, hay phức tạp như linh hồn, đấng siêu nhiên, linh cảm, vô thức, vật thể, tia vũ trụ, ánh sáng, hạt Quark, hạt Strangelet, hay trường (Sphere)..., tất cả cho đến nay vẫn không phải là hiện tượng gì khác nằm ngoài vật chất và ý thức. Để giải quyết được các vấn đề chuyên sâu của từng học thuyết về thế giới, câu hỏi đặt ra đối với triết học trước hết vẫn là: Thế giới tồn tại bên ngoài tư duy con người có quan hệ như thế nào với thế giới tinh thần tồn tại trong ý thức con người? Con người có khả năng hiểu biết đến đâu về sự tồn tại thực của thế giới? Bất kỳ trường phái triết học nào cũng không thể lảng tránh giải quyết vấn đề này - Mối quan hệ giữa vật chất và ý thức, giữa tồn tại và tư duy.\nKhi giải quyết vấn đề cơ bản, mỗi triết học không chỉ xác định nền tảng và điểm xuất phát của mình để giải quyết các vấn đề khác mà thông qua đó, lập trường, thế giới quan của các học thuyết và của các triết gia cũng được xác định.\nVấn đề cơ bản của triết học có hai mặt, trả lời hai câu hỏi lớn.\nMặt thứ nhất: Giữa ý thức và vật chất thì cái nào có trước, cái nào có sau, cái nào quyết định cái nào? Nói cách khác, khi tìm ra nguyên nhân cuối cùng của hiện tượng, sự vật, hay sự vận động đang cần phải giải thích, thì nguyên nhân vật chất hay nguyên nhân tinh thần đóng vai trò là cái quyết định.\nMặt thứ hai: Con người có khả năng nhận thức được thế giới hay không? Nói cách khác, khi khám phá sự vật và hiện tượng, con người có dám tin rằng mình sẽ nhận thức được sự vật và hiện tượng hay không.\nCách trả lời hai câu hỏi trên quy định lập trường của nhà triết học và của trường phái triết học, xác định việc hình thành các trường phái lớn của triết học."
  },
  {
    "title": "b) Chủ nghĩa duy vật và chủ nghĩa duy tâm",
    "level": 3,
    "body": "Việc giải quyết mặt thứ nhất của vấn đề cơ bản của triết học đã chia các nhà triết học thành hai trường phái lớn. Những người cho rằng vật chất, giới tự nhiên là cái có trước và quyết định ý thức của con người được gọi là các nhà duy vật. Học thuyết của họ hợp thành các môn phái khác nhau của chủ nghĩa duy vật, giải thích mọi hiện tượng của thế giới này bằng các nguyên nhân vật chất - nguyên nhân tận cùng của mọi vận động của thế giới này là nguyên nhân vật chất. Ngược lại, những người cho rằng ý thức, tinh thần, ý niệm, cảm giác là cái có trước giới tự nhiên, được gọi là các nhà duy tâm. Các học thuyết của họ hợp thành các phái khác nhau của chủ nghĩa duy tâm, chủ trương giải thích toàn bộ thế giới này bằng các nguyên nhân tư tưởng, tinh thần - nguyên nhân tận cùng của mọi vận động của thế giới này là nguyên nhân tinh thần.\n- Chủ nghĩa duy vật: Cho đến nay, chủ nghĩa duy vật đã được thể hiện dưới ba hình thức cơ bản: chủ nghĩa duy vật chất phác, chủ nghĩa duy vật siêu hình và chủ nghĩa duy vật biện chứng.\n+ Chủ nghĩa duy vật chất phác là kết quả nhận thức của các nhà triết học duy vật thời cổ đại. Chủ nghĩa duy vật thời kỳ này thừa nhận tính thứ nhất của vật chất nhưng lại đồng nhất vật chất với một hay một số chất cụ thể của vật chất và đưa ra những kết luận mà về sau người ta thấy mang nặng tính trực quan, ngây thơ, chất phác. Tuy hạn chế do trình độ nhận thức thời đại về vật chất và cấu trúc vật chất, nhưng chủ nghĩa duy vật chất phác thời cổ đại về cơ bản là đúng vì nó đã lấy bản thân giới tự nhiên để giải thích thế giới, không viện đến thần linh, thượng đế hay các lực lượng siêu nhiên.\n+ Chủ nghĩa duy vật siêu hình là hình thức cơ bản thứ hai trong lịch sử của chủ nghĩa duy vật, thể hiện khá rõ ở các nhà triết học thế kỷ XV đến thế kỷ XVIII và điển hình là ở thế kỷ XVII, XVIII. Đây là thời kỳ mà cơ học cổ điển đạt được những thành tựu rực rỡ nên trong khi tiếp tục phát triển quan điểm chủ nghĩa duy vật thời cổ đại, chủ nghĩa duy vật giai đoạn này chịu sự tác động mạnh mẽ của phương pháp tư duy siêu hình, cơ giới - phương pháp nhìn thế giới như một cỗ máy khổng lồ mà mỗi bộ phận tạo nên thế giới đó về cơ bản ở trong trạng thái biệt lập và tĩnh tại. Tuy không phản ánh đúng hiện thực trong toàn cục nhưng chủ nghĩa duy vật siêu hình đã góp phần không nhỏ vào việc đẩy lùi thế giới quan duy tâm và tôn giáo, đặc biệt là ở thời kỳ chuyển tiếp từ đêm trường trung cổ sang thời phục hưng.\n+ Chủ nghĩa duy vật biện chứng là hình thức cơ bản thứ ba của chủ nghĩa duy vật, do C. Mác và Ph. Ăngghen xây dựng vào những năm 40 của thế kỷ XIX, sau đó được V.I. Lênin phát triển. Với sự kế thừa tinh hoa của các học thuyết triết học trước đó và sử dụng khá triệt để thành tựu của khoa học đương thời, ngay từ khi mới ra đời chủ nghĩa duy vật biện chứng đã khắc phục được hạn chế của chủ nghĩa duy vật chất phác thời cổ đại, chủ nghĩa duy vật siêu hình và là đỉnh cao trong sự phát triển của chủ nghĩa duy vật. Chủ nghĩa duy vật biện chứng không chỉ phản ánh hiện thực đúng như chính bản thân nó tồn tại mà còn là một công cụ hữu hiệu giúp những lực lượng tiến bộ trong xã hội cải tạo hiện thực ấy.\n- Chủ nghĩa duy tâm: Chủ nghĩa duy tâm gồm có hai phái: chủ nghĩa duy tâm chủ quan và chủ nghĩa duy tâm khách quan.\n+ Chủ nghĩa duy tâm chủ quan thừa nhận tính thứ nhất của ý thức con người. Trong khi phủ nhận sự tồn tại khách quan của hiện thực, chủ nghĩa duy tâm chủ quan khẳng định mọi sự vật, hiện tượng chỉ là phức hợp của những cảm giác.\n+ Chủ nghĩa duy tâm khách quan cũng thừa nhận tính thứ nhất của ý thức nhưng coi đó là thứ tinh thần khách quan có trước và tồn tại độc lập với con người. Thực thể tinh thần khách quan này thường được gọi bằng những cái tên khác nhau như ý niệm, tinh thần tuyệt đối, lý tính thế giới, v.v..\nChủ nghĩa duy tâm triết học cho rằng ý thức, tinh thần là cái có trước và sản sinh ra giới tự nhiên. Bằng cách đó, chủ nghĩa duy tâm đã thừa nhận sự sáng tạo của một lực lượng siêu nhiên nào đó đối với toàn bộ thế giới. Vì vậy, tôn giáo thường sử dụng các học thuyết duy tâm làm cơ sở lý luận, luận chứng cho các quan điểm của mình, tuy có sự khác nhau đáng kể giữa chủ nghĩa duy tâm triết học với chủ nghĩa duy tâm tôn giáo. Trong thế giới quan tôn giáo, lòng tin là cơ sở chủ yếu và đóng vai trò chủ đạo đối với vận động. Còn chủ nghĩa duy tâm triết học lại là sản phẩm của tư duy lý tính dựa trên cơ sở tri thức và năng lực mạnh mẽ của tư duy.\nVề phương diện nhận thức luận, sai lầm cố ý của chủ nghĩa duy tâm bắt nguồn từ cách xem xét phiến diện, tuyệt đối hóa, thần thánh hóa một mặt, một đặc tính nào đó của quá trình nhận thức mang tính biện chứng của con người.\nBên cạnh nguồn gốc nhận thức, chủ nghĩa duy tâm ra đời còn có nguồn gốc xã hội. Sự tách rời lao động trí óc với lao động chân tay và địa vị thống trị của lao động trí óc đối với lao động chân tay trong các xã hội trước đây đã tạo ra quan niệm về vai trò quyết định của nhân tố tinh thần. Trong lịch sử, giai cấp thống trị và nhiều lực lượng xã hội đã từng ủng hộ, sử dụng chủ nghĩa duy tâm làm nền tảng lý luận cho những quan điểm chính trị - xã hội của mình.\nHọc thuyết triết học nào chỉ thừa nhận một trong hai thực thể (vật chất hoặc tinh thần) là bản nguyên (nguồn gốc) của thế giới, quyết định sự vận động của thế giới được gọi là nhất nguyên luận (nhất nguyên luận duy vật hoặc nhất nguyên luận duy tâm).\nTrường phái nhị nguyên luận: Trong lịch sử triết học cũng có những nhà triết học giải thích thế giới bằng cả hai bản nguyên vật chất và tinh thần, xem vật chất và tinh thần là hai bản nguyên có thể cùng quyết định nguồn gốc và sự vận động của thế giới. Học thuyết triết học như vậy được gọi là nhị nguyên luận, điển hình là Descartes (Đêcáctơ). Những người theo thuyết nhị nguyên luận thường là những người trong trường hợp giải quyết một vấn đề nào đó, ở vào một thời điểm nhất định là người duy vật, nhưng vào một thời điểm khác, và khi giải quyết một vấn đề khác lại là người duy tâm. Song, xét đến cùng nhị nguyên luận thuộc về chủ nghĩa duy tâm.\nNhững quan điểm, học phái triết học thực tế rất phong phú và đa dạng, nhưng dù đa dạng đến mấy chúng cũng chỉ thuộc về hai lập trường cơ bản. Triết học, do vậy, được chia thành hai trường phái chính: chủ nghĩa duy vật và chủ nghĩa duy tâm. Vì thế, lịch sử triết học cũng chủ yếu là lịch sử đấu tranh của hai trường phái duy vật và duy tâm."
  },
  {
    "title": "c) Thuyết có thể biết (Thuyết khả tri) và thuyết không thể biết (Thuyết bất khả tri)",
    "level": 3,
    "body": "Đây là kết quả của cách giải quyết mặt thứ hai vấn đề cơ bản của triết học. Với câu hỏi “Con người có thể nhận thức được thế giới hay không?”, tuyệt đại đa số các nhà triết học (cả các nhà duy vật và các nhà duy tâm) trả lời một cách khẳng định: Thừa nhận khả năng nhận thức được thế giới của con người.\nHọc thuyết triết học khẳng định khả năng nhận thức của con người được gọi là Thuyết khả tri (Gnosticism, Thuyết có thể biết). Thuyết khả tri khẳng định về nguyên tắc con người có thể hiểu được bản chất của sự vật. Nói cách khác, cảm giác, biểu tượng, quan niệm và nói chung ý thức mà con người có được về sự vật về nguyên tắc là phù hợp với bản thân sự vật.\nHọc thuyết triết học phủ nhận khả năng nhận thức của con người được gọi là Thuyết bất khả tri (Agnosticism, Thuyết không thể biết). Theo thuyết này, về nguyên tắc, con người không thể hiểu được bản chất của đối tượng. Kết quả nhận thức mà loài người có được chỉ là hình thức bề ngoài, hạn hẹp và cắt xén về đối tượng. Các hình ảnh, tính chất, đặc điểm... của đối tượng mà các giác quan của con người thu nhận được trong quá trình nhận thức, cho dù có tính xác thực, cũng không cho phép con người đồng nhất chúng với đối tượng. Đó không phải là cái tuyệt đối tin cậy.\nBất khả tri không tuyệt đối phủ nhận những thực tại siêu nhiên hay thực tại được cảm giác của con người, nhưng vẫn khẳng định ý thức con người không thể đạt tới thực tại tuyệt đối hay thực tại như nó vốn có, vì mọi thực tại tuyệt đối đều nằm ngoài kinh nghiệm của con người về thế giới. Thuyết bất khả tri cũng không đặt vấn đề về niềm tin, mà chỉ phủ nhận khả năng vô hạn của nhận thức.\nThuật ngữ “Thuyết bất khả tri” được đưa ra năm 1869 bởi T.H. Huxley (Hắcxli) (1825 - 1895), nhà triết học tự nhiên người Anh, người đã khái quát thực chất của lập trường này từ các tư tưởng triết học của D. Hume (Hium) và Kant. Đại biểu điển hình cho những nhà triết học bất khả tri cũng chính là Hume và Kant.\nÍt nhiều liên quan đến Thuyết bất khả tri là sự ra đời của trào lưu hoài nghi luận từ triết học Hy Lạp cổ đại. Những người theo hoài nghi luận nâng sự hoài nghi lên thành nguyên tắc trong việc xem xét tri thức đã đạt được và cho rằng con người không thể đạt đến chân lý khách quan. Tuy cực đoan về mặt nhận thức, nhưng hoài nghi luận thời phục hưng đã giữ vai trò quan trọng trong cuộc đấu tranh chống hệ tư tưởng và quyền uy của Giáo hội thời trung cổ. Hoài nghi luận thừa nhận sự hoài nghi đối với cả Kinh thánh và các tín điều tôn giáo.\nQuan niệm bất khả tri đã có trong triết học ngay từ thời Epicurus khi ông đưa ra những luận thuyết chống lại quan niệm đương thời về chân lý tuyệt đối. Nhưng phải đến Kant, bất khả tri mới trở thành học thuyết triết học có ảnh hưởng sâu rộng đến triết học, khoa học và thần học châu Âu. Trước Kant, Hume quan niệm tri thức con người chỉ dừng ở trình độ kinh nghiệm, chân lý phải phù hợp với kinh nghiệm. Hume phủ nhận những sự trừu tượng hóa vượt quá kinh nghiệm, dù là những khái quát có giá trị. Nguyên tắc kinh nghiệm của Hume có ý nghĩa đáng kể cho sự xuất hiện của các khoa học thực nghiệm, tuy nhiên, việc tuyệt đối hóa kinh nghiệm đến mức phủ nhận các thực tại siêu nhiên đã khiến Hume trở thành nhà bất khả tri luận.\nMặc dù quan điểm bất khả tri của Kant không phủ nhận các thực tại siêu nhiên như Hume, nhưng với thuyết về vật tự nó (Ding an sich, còn được dịch là vật tự thân), Kant đã tuyệt đối hóa sự bí ẩn của đối tượng được nhận thức. Kant cho rằng con người không thể có được những tri thức đúng đắn, chân thực, bản chất về những thực tại nằm ngoài kinh nghiệm có thể cảm giác được. Việc khẳng định về sự bất lực của trí tuệ trước thế giới thực tại đã làm nên quan điểm bất khả tri vô cùng độc đáo của Kant.\nTrong lịch sử triết học, Thuyết bất khả tri và quan niệm vật tự nó của Kant đã bị Feuerbach (Phoiơbắc) và Hegel phê phán gay gắt. Trên quan điểm duy vật biện chứng, Ph. Ăngghen tiếp tục phê phán Kant, khi khẳng định khả năng nhận thức vô tận của con người. Theo Ph. Ăngghen, con người có thể nhận thức được và nhận thức được một cách đúng đắn bản chất của mọi sự vật và hiện tượng. Không có một ranh giới nào của vật tự nó mà nhận thức của con người không thể vượt qua được. Ph. Ăngghen khẳng định: “Nếu chúng có thể chứng minh được tính chính xác của quan điểm của chúng ta về một hiện tượng tự nhiên nào đó, bằng cách tự chúng ta làm ra hiện tượng ấy, bằng cách tạo ra nó từ những điều kiện của nó, và hơn nữa, còn bắt nó phải phục vụ mục đích của chúng ta, thì sẽ không còn có cái “vật tự nó” không thể nắm được của Cantơ nữa”.\nNhững người theo khả tri luận tin rằng, nhận thức là một quá trình không ngừng đi sâu khám phá bản chất sự vật. Với quá trình đó, vật tự nó sẽ buộc phải biến thành “Vật cho ta”."
  },
  {
    "title": "3. Biện chứng và siêu hình",
    "level": 2,
    "body": ""
  },
  {
    "title": "a) Khái niệm biện chứng và siêu hình trong lịch sử",
    "level": 3,
    "body": "Các khái niệm “biện chứng” và “siêu hình” trong lịch sử triết học được dùng theo một số nghĩa khác nhau. Nghĩa xuất phát của từ “biện chứng” là nghệ thuật tranh luận để tìm chân lý bằng cách phát hiện mâu thuẫn trong cách lập luận (Socrates dùng). Nghĩa ban đầu của từ “siêu hình” là dùng để chỉ triết học, với tư cách là khoa học siêu cảm tính, phi thực nghiệm (Aristotle dùng). Trong triết học hiện đại, đặc biệt triết học mácxít, chúng được dùng, trước hết để chỉ hai phương pháp tư duy chung nhất đối lập nhau đó là phương pháp biện chứng và phương pháp siêu hình.\n* Phương pháp siêu hình\nPhương pháp siêu hình nhận thức đối tượng ở trạng thái cô lập, tách rời đối tượng ra khỏi các quan hệ được xem xét và coi các mặt đối lập với nhau có một ranh giới tuyệt đối.\nPhương pháp siêu hình nhận thức đối tượng ở trạng thái tĩnh; đồng nhất đối tượng với trạng thái tĩnh nhất thời đó. Thừa nhận sự biến đổi chỉ là sự biến đổi về số lượng, về các hiện tượng bề ngoài. Nguyên nhân của sự biến đổi được coi là nằm ở bên ngoài đối tượng.\nPhương pháp siêu hình có cội nguồn hợp lý từ trong khoa học cơ học cổ điển. Muốn nhận thức bất kỳ một đối tượng nào, trước hết con người phải tách đối tượng ấy ra khỏi những liên hệ nhất định và nhận thức nó ở trạng thái không biến đổi trong một không gian và thời gian xác định. Đó là phương pháp được đưa từ toán học và vật lý học cổ điển vào các khoa học thực nghiệm và vào triết học. Song, phương pháp siêu hình chỉ có tác dụng trong một phạm vi nhất định bởi hiện thực khách quan, trong bản chất của nó, không rời rạc và không ngưng đọng như phương pháp tư duy này quan niệm.\nPhương pháp siêu hình có công lớn trong việc giải quyết các vấn đề có liên quan đến cơ học cổ điển. Nhưng khi mở rộng phạm vi khái quát sang giải quyết các vấn đề về vận động, về liên hệ thì lại làm cho nhận thức rơi vào phương pháp luận siêu hình. Ph. Ăngghen đã chỉ rõ, phương pháp siêu hình “chỉ nhìn thấy những sự vật riêng biệt mà không nhìn thấy mối liên hệ qua lại giữa những sự vật ấy, chỉ nhìn thấy sự tồn tại của những sự vật ấy mà không nhìn thấy sự phát sinh và sự tiêu vong của những sự vật ấy, chỉ nhìn thấy trạng thái tĩnh của những sự vật ấy mà quên mất sự vận động của những sự vật ấy, chỉ nhìn thấy cây mà không thấy rừng”.\n* Phương pháp biện chứng\nPhương pháp biện chứng nhận thức đối tượng trong các mối liên hệ phổ biến vốn có của nó. Đối tượng và các thành phần của đối tượng luôn trong sự lệ thuộc, ảnh hưởng, ràng buộc và quy định lẫn nhau.\nPhương pháp biện chứng nhận thức đối tượng ở trạng thái luôn vận động biến đổi, nằm trong khuynh hướng phổ quát là phát triển. Quá trình vận động này thay đổi cả về lượng và chất của các sự vật, hiện tượng. Nguồn gốc của sự vận động, thay đổi đó là sự đấu tranh giữa các mặt đối lập của mâu thuẫn nội tại trong bản thân sự vật.\nQuan điểm biện chứng cho phép chủ thể nhận thức không chỉ thấy những sự vật riêng biệt mà còn thấy cả mối liên hệ giữa chúng; không chỉ thấy sự tồn tại của sự vật mà còn thấy cả sự sinh thành, phát triển và tiêu vong của sự vật; không chỉ thấy trạng thái tĩnh mà còn thấy cả trạng thái động của sự vật. Ph. Ăngghen nhận xét, tư duy của nhà siêu hình chỉ dựa trên những phản đề tuyệt đối không thể dung nhau được, đối với họ một sự vật hoặc tồn tại hoặc không tồn tại, một sự vật không thể vừa là chính nó lại vừa là cái khác, cái khẳng định và cái phủ định tuyệt đối bài trừ lẫn nhau. Ngược lại, tư duy biện chứng là tư duy mềm dẻo, linh hoạt, không tuyệt đối hóa nghiêm ngặt những ranh giới, “trong những trường hợp cần thiết, là bên cạnh cái “hoặc là... hoặc là” thì còn có cả “cái này lẫn cái kia” nữa, và thực hiện sự môi giới giữa các mặt đối lập”. Tư duy biện chứng thừa nhận một chỉnh thể trong lúc vừa là nó lại vừa không phải là nó; thừa nhận cái khẳng định và cái phủ định vừa loại trừ nhau lại vừa gắn bó với nhau.\nPhương pháp biện chứng phản ánh hiện thực đúng như nó tồn tại. Nhờ vậy, phương pháp tư duy biện chứng trở thành công cụ hữu hiệu giúp con người nhận thức và cải tạo thế giới, là phương pháp luận tối ưu của mọi khoa học."
  },
  {
    "title": "b) Các hình thức của phép biện chứng trong lịch sử",
    "level": 3,
    "body": "Cùng với sự phát triển của tư duy con người, phương pháp biện chứng đã trải qua ba giai đoạn phát triển, được thể hiện trong triết học với ba hình thức lịch sử: phép biện chứng tự phát, phép biện chứng duy tâm và phép biện chứng duy vật.\n- Hình thức thứ nhất là phép biện chứng tự phát thời cổ đại. Các nhà biện chứng cả phương Đông và phương Tây thời cổ đại đã thấy được các sự vật, hiện tượng của vũ trụ vận động trong sự sinh thành, biến hóa vô cùng vô tận. Tuy nhiên, những gì mà các nhà biện chứng thời đó thấy được chỉ là trực kiến, chưa có các kết quả của nghiên cứu và thực nghiệm khoa học minh chứng.\n- Hình thức thứ hai là phép biện chứng duy tâm. Đỉnh cao của hình thức này được thể hiện trong triết học cổ điển Đức, người khởi đầu là Kant và người hoàn thiện là Hegel. Có thể khẳng định, lần đầu tiên trong lịch sử phát triển của tư duy nhân loại, các nhà triết học Đức đã trình bày một cách có hệ thống những nội dung quan trọng nhất của phương pháp biện chứng. Theo các nhà triết học Đức, biện chứng bắt đầu từ tinh thần và kết thúc cũng ở tinh thần. Thế giới hiện thực chỉ là sự phản ánh biện chứng của ý niệm nên phép biện chứng của các nhà triết học cổ điển Đức là biện chứng duy tâm.\n- Hình thức thứ ba là phép biện chứng duy vật. Phép biện chứng duy vật được thể hiện trong triết học do C. Mác và Ph. Ăngghen xây dựng, sau đó được V.I. Lênin và các nhà triết học hậu thế phát triển. C. Mác và Ph. Ăngghen đã gạt bỏ tính thần bí, tư biện của triết học cổ điển Đức, kế thừa những hạt nhân hợp lý trong phép biện chứng duy tâm để xây dựng phép biện chứng duy vật với tư cách là học thuyết về mối liên hệ phổ biến và về sự phát triển dưới hình thức hoàn bị nhất. Công lao của C. Mác và Ph. Ăngghen còn ở chỗ tạo được sự thống nhất giữa chủ nghĩa duy vật với phép biện chứng trong lịch sử phát triển triết học nhân loại, làm cho phép biện chứng trở thành phép biện chứng duy vật và chủ nghĩa duy vật trở thành chủ nghĩa duy vật biện chứng."
  }
]