[
  {
    "title": "Giới thiệu / Mở đầu",
    "level": 0,
    "body": "Chương 2\nCHỦ NGHĨA DUY VẬT BIỆN CHỨNG"
  },
  {
    "title": "A. MỤC TIÊU",
    "level": 1,
    "body": ""
  },
  {
    "title": "1. Về kiến thức",
    "level": 2,
    "body": "- Giúp sinh viên hiểu được quan điểm của chủ nghĩa duy vật biện chứng về vật chất, các hình thức, phương thức tồn tại của vật chất; nguồn gốc, bản chất của ý thức; mối quan hệ biện chứng giữa vật chất và ý thức.\n- Giúp sinh viên nắm được những nội dung cơ bản của phép biện chứng duy vật; ý nghĩa phương pháp luận trong nhận thức và thực tiễn.\n- Trang bị cho sinh viên những kiến thức cơ bản về lý luận nhận thức của chủ nghĩa duy vật biện chứng; ý nghĩa phương pháp luận."
  },
  {
    "title": "2. Về kỹ năng: Giúp sinh viên biết vận dụng nguyên tắc phương pháp luận rút ra từ nội dung lý luận của chủ nghĩa duy vật biện chứng vào nhận thức và thực tiễn.",
    "level": 2,
    "body": ""
  },
  {
    "title": "3. Về tư tưởng: Giúp sinh viên khẳng định những nền tảng khoa học và cách mạng của chủ nghĩa duy vật biện chứng; đấu tranh chống lại các quan điểm sai trái của chủ nghĩa duy tâm và chủ nghĩa duy vật siêu hình.",
    "level": 2,
    "body": ""
  },
  {
    "title": "B. NỘI DUNG",
    "level": 1,
    "body": ""
  },
  {
    "title": "I- VẬT CHẤT VÀ Ý THỨC",
    "level": 1,
    "body": ""
  },
  {
    "title": "1. Vật chất và phương thức tồn tại của vật chất",
    "level": 2,
    "body": ""
  },
  {
    "title": "a) Quan niệm của chủ nghĩa duy tâm và chủ nghĩa duy vật trước C. Mác về phạm trù vật chất",
    "level": 3,
    "body": "Các nhà triết học duy tâm, cả chủ nghĩa duy tâm khách quan và chủ nghĩa duy tâm chủ quan, từ thời cổ đại đến hiện đại tuy buộc phải thừa nhận sự tồn tại của các sự vật, hiện tượng của thế giới nhưng lại phủ nhận đặc trưng “tự thân tồn tại” của chúng. Chủ nghĩa duy tâm khách quan thừa nhận sự tồn tại hiện thực của giới tự nhiên, nhưng lại cho rằng nguồn gốc của nó là do “sự tha hóa” của “tinh thần thế giới”. Chủ nghĩa duy tâm chủ quan cho rằng đặc trưng cơ bản nhất của mọi sự vật, hiện tượng là sự tồn tại lệ thuộc vào chủ quan, tức là một hình thức tồn tại khác của ý thức. Do đó về mặt nhận thức luận, chủ nghĩa duy tâm cho rằng con người hoặc là không thể, hoặc là chỉ nhận thức được cái bóng, cái bề ngoài của sự vật, hiện tượng. Thậm chí theo họ, quá trình nhận thức của con người chẳng qua chỉ là quá trình ý thức đi “tìm lại” chính bản thân mình dưới hình thức khác. Như vậy, về thực chất, các nhà triết học duy tâm đã phủ nhận đặc tính tồn tại khách quan của vật chất. Thế giới quan duy tâm rất gần với thế giới quan tôn giáo và tất yếu dẫn họ đến với thần học.\nQuan điểm nhất quán từ xưa đến nay của các nhà triết học duy vật là thừa nhận sự tồn tại khách quan của thế giới vật chất, lấy bản thân giới tự nhiên để giải thích tự nhiên. Lập trường đó là đúng đắn, song chưa đủ để các nhà duy vật trước C. Mác đi đến một quan niệm hoàn chỉnh về phạm trù nền tảng này. Tuy vậy, cùng với những tiến bộ của lịch sử, quan niệm của các nhà triết học duy vật về vật chất cũng từng bước phát triển theo hướng ngày càng sâu sắc và trừu tượng hóa khoa học hơn.\nChủ nghĩa duy vật thời cổ đại. Thời cổ đại, đặc biệt là ở Hy Lạp - La Mã, Trung Quốc, Ấn Độ đã xuất hiện chủ nghĩa duy vật với quan niệm chất phác về giới tự nhiên, về vật chất. Nhìn chung, các nhà duy vật thời cổ đại quy vật chất về một hay một vài dạng cụ thể và xem chúng là khởi nguyên của thế giới, tức là quy vật chất về những vật thể hữu hình, cảm tính đang tồn tại ở thế giới bên ngoài, chẳng hạn: nước (Thales), lửa (Heraclitus), không khí (Anaximenes); đất, nước, lửa, gió (Tứ đại - Ấn Độ); kim, mộc, thủy, hỏa, thổ (Ngũ hành - Trung Quốc). Một số trường hợp đặc biệt quy vật chất (không chỉ vật chất mà thế giới) về những cái trừu tượng như Không (Phật giáo), Đạo (Lão Trang).\nMột bước tiến mới trên con đường xây dựng quan niệm duy vật về vật chất được thể hiện trong quan niệm của nhà triết học Hy Lạp cổ đại Anaximander. Anaximander cho rằng, cơ sở đầu tiên của mọi vật trong vũ trụ là một dạng vật chất đơn nhất, vô định, vô hạn và tồn tại vĩnh viễn, đó là Apeirôn. Theo Anaximander, Apeirôn luôn ở trong trạng thái vận động và từ đó nảy sinh những mặt đối lập chất chứa trong nó, như nóng và lạnh, khô và ướt, sinh ra và chết đi, v.v.. Đây là một cố gắng muốn thoát ly cách nhìn trực quan về vật chất, muốn tìm một bản chất sâu sắc hơn đang ẩn giấu phía sau các hiện tượng cảm tính bề ngoài các sự vật. Tuy nhiên, khi Anaximander cho rằng, Apeirôn là một cái gì đó ở giữa nước và không khí thì ông vẫn chưa vượt khỏi hạn chế của các quan niệm trước đó về vật chất.\nBước tiến quan trọng nhất của sự phát triển phạm trù vật chất là định nghĩa vật chất của hai nhà triết học Hy Lạp cổ đại là Leucippus (Lơxíp) (khoảng 500 - 440 trước Công nguyên) và Democritos (Đêmôcrít) (khoảng 460 - 370 trước Công nguyên). Cả hai ông đều cho rằng, vật chất là nguyên tử. Nguyên tử theo họ là những hạt nhỏ nhất, không thể phân chia, không khác nhau về chất, tồn tại vĩnh viễn và sự phong phú của chúng về hình dạng, tư thế, trật tự sắp xếp quy định tính muôn vẻ của vạn vật. Theo thuyết nguyên tử thì vật chất theo nghĩa bao quát nhất, chung nhất không đồng nghĩa với những vật thể mà con người có thể cảm nhận được một cách trực tiếp, mà là một lớp các phần tử hữu hình rộng rãi nằm sâu trong mỗi sự vật, hiện tượng. Quan niệm này không những thể hiện một bước tiến khá xa của các nhà triết học duy vật trong quá trình tìm kiếm một định nghĩa đúng đắn về vật chất mà còn có ý nghĩa như một dự báo khoa học tài tình của con người về cấu trúc của thế giới vật chất nói chung.\nChủ nghĩa duy vật thế kỷ XV - XVIII. Bắt đầu từ thời kỳ phục hưng (thế kỷ XV), phương Tây đã có sự bứt phá so với phương Đông ở chỗ khoa học thực nghiệm ra đời, đặc biệt là sự phát triển mạnh của cơ học, công nghiệp. Đến thế kỷ XVII - XVIII, chủ nghĩa duy vật mang hình thức chủ nghĩa duy vật siêu hình, máy móc. Thuyết nguyên tử vẫn được các nhà triết học và khoa học tự nhiên thời kỳ phục hưng và cận đại (thế kỷ XV - XVIII) như Galilei (Galilê), Bacon, Hobbes, Spinoza, Holbach, Diderot, Newton (Niutơn)... tiếp tục nghiên cứu, khẳng định trên lập trường duy vật. Đặc biệt, những thành công kỳ diệu của Newton trong vật lý học cổ điển (nghiên cứu cấu tạo và thuộc tính của các vật thể vật chất vĩ mô - bắt đầu tính từ nguyên tử trở lên) và việc khoa học vật lý thực nghiệm chứng minh được sự tồn tại thực sự của nguyên tử càng làm cho quan niệm trên đây được củng cố thêm.\nSong, do chưa thoát khỏi phương pháp tư duy siêu hình nên nhìn chung các nhà triết học duy vật thời kỳ cận đại đã không đưa ra được những khái quát triết học đúng đắn. Họ thường đồng nhất vật chất với khối lượng, coi những định luật cơ học như những chân lý không thể thêm bớt và giải thích mọi hiện tượng của thế giới theo những chuẩn mực thuần túy cơ học; xem vật chất, vận động, không gian, thời gian như những thực thể khác nhau, không có mối liên hệ nội tại với nhau... Cũng có một số nhà triết học thời kỳ này cố gắng vạch ra những sai lầm của thuyết nguyên tử (chẳng hạn như Descartes, Kant...) nhưng không nhiều và không thể làm thay đổi căn bản cái nhìn cơ học về thế giới, không đủ đưa đến một định nghĩa hoàn toàn mới về phạm trù vật chất."
  },
  {
    "title": "b) Cuộc cách mạng trong khoa học tự nhiên cuối thế kỷ XIX, đầu thế kỷ XX và sự phá sản của các quan điểm duy vật siêu hình về vật chất",
    "level": 3,
    "body": "Cuối thế kỷ XIX, đầu thế kỷ XX, trong vật lý học đã có nhiều phát minh quan trọng. Năm 1895, Wilhelm Conrad Rontgen (Rơnghen), phát hiện ra tia X. Năm 1896, Henri Becquerel (Béccơren), phát hiện ra hiện tượng phóng xạ của nguyên tố urani. Năm 1897, Joseph John Thomson (Tômxơn), phát hiện ra điện tử. Năm 1901, Kaufman đã chứng minh được khối lượng của điện tử không phải là bất biến mà thay đổi theo vận tốc vận động của nguyên tử. Năm 1898 - 1902, nhà nữ vật lý học người Ba Lan - Marie Sklodowska (Mari Scôlôđốpsca) cùng với chồng là Pierre Curie, nhà hóa học người Pháp, đã khám phá ra chất phóng xạ mạnh là pôlôni và rađium. Những phát hiện vĩ đại đó chứng tỏ rằng, nguyên tử không phải là phần tử nhỏ nhất mà nó có thể bị phân chia, chuyển hóa. Năm 1905, thuyết tương đối hẹp và năm 1916, thuyết tương đối tổng quát của Albert Einstein (A. Anhxtanh) ra đời đã chứng minh: Không gian, thời gian, khối lượng luôn biến đổi cùng với sự vận động của vật chất. Thế giới vật chất không có và không thể có những vật thể không có kết cấu, tức là không thể có đơn vị cuối cùng, tuyệt đối đơn giản và bất biến để đặc trưng chung cho vật chất. Thế giới ấy còn nhiều điều “kỳ lạ” mà con người đã và đang tiếp tục khám phá, chẳng hạn: sự chuyển hóa giữa hạt và trường, sóng và hạt, hạt và phản hạt, “hụt khối lượng”, quan hệ bất định, v.v.. V.I. Lênin viết: “Điện tử cũng vô cùng tận như nguyên tử; tự nhiên là vô tận” là hoàn toàn đúng đắn.\nTrước những phát hiện trên của khoa học tự nhiên, không ít nhà khoa học và triết học đứng trên lập trường duy vật tự phát, siêu hình đã hoang mang, dao động, hoài nghi tính đúng đắn của chủ nghĩa duy vật. Họ cho rằng, nguyên tử không phải là phần tử nhỏ nhất, mà có thể bị phân chia, tan rã, bị “mất đi”. Do đó, vật chất cũng có thể biến mất; có hiện tượng không có khối lượng cơ học, hạt chuyển thành trường, cũng có nghĩa là vật chất chỉ còn là năng lượng, là sóng phi vật chất; quy luật cơ học không còn tác dụng gì trong thế giới vật chất “kỳ lạ”, thế giới tồn tại không có quy luật, mọi khoa học trở thành thừa và nếu có chăng cũng chỉ là sự sáng tạo tùy tiện của tư duy con người; khách thể tiêu tan, chủ thể trở thành cái có trước, cái còn lại duy nhất là chúng ta và cảm giác cùng tư duy của chúng ta để tổ chức những cảm giác đó. Theo đó, Ernst Mach (E. Makhơ) phủ nhận tính hiện thực khách quan của điện tử. Wilhelm Ostwald (Ốtvan) phủ nhận sự tồn tại thực tế của nguyên tử và phân tử. Còn Henri Bergson (Piếcsơn) thì định nghĩa: Vật chất là cái phi vật chất đang vận động (!). Đây chính là cuộc khủng hoảng vật lý học hiện đại mà như V.I. Lênin khẳng định, thực chất của nó “là ở sự đảo lộn của những quy luật cũ và những nguyên lý cơ bản, ở sự gạt bỏ thực tại khách quan ở bên ngoài ý thức, tức là ở sự thay thế chủ nghĩa duy vật bằng chủ nghĩa duy tâm và chủ nghĩa bất khả tri”.\nTình hình trên đã làm cho nhiều nhà khoa học tự nhiên trượt từ chủ nghĩa duy vật máy móc, siêu hình sang chủ nghĩa tương đối, rồi rơi vào chủ nghĩa duy tâm. V.I. Lênin gọi đó là “chủ nghĩa duy tâm vật lý học” và coi đó là “một bước ngoặt nhất thời”, là “thời kỳ ốm đau ngắn ngủi”, là “chứng bệnh của sự trưởng thành”, là “một vài sản phẩm chết, một vài thứ cặn bã nào đó phải vứt vào sọt rác”2. Để khắc phục cuộc khủng hoảng này, V.I. Lênin cho rằng: “Tinh thần duy vật cơ bản của vật lý học, cũng như của tất cả các khoa học tự nhiên hiện đại, sẽ chiến thắng tất cả mọi thứ khủng hoảng, nhưng với điều kiện tất yếu là chủ nghĩa duy vật biện chứng phải thay thế chủ nghĩa duy vật siêu hình”3."
  },
  {
    "title": "c) Quan niệm của triết học Mác - Lênin về vật chất",
    "level": 3,
    "body": "Trong đấu tranh chống chủ nghĩa duy tâm, thuyết bất khả tri và phê phán chủ nghĩa duy vật siêu hình, máy móc, C. Mác và Ph. Ăngghen đã đưa ra những tư tưởng rất quan trọng về vật chất.\nTheo Ph. Ăngghen, để có một quan niệm đúng đắn về vật chất, cần phải có sự phân biệt rõ ràng giữa vật chất với tính cách là một phạm trù của triết học với bản thân các sự vật, hiện tượng cụ thể của thế giới vật chất. “Vật chất, với tư cách là vật chất, là một sáng tạo thuần túy của tư duy và là một sự trừu tượng. Chúng ta bỏ qua những sự khác nhau về chất của những sự vật, khi chúng ta gộp chúng, với tư cách là những vật tồn tại hữu hình, vào khái niệm vật chất. Do đó, khác với những vật chất nhất định và đang tồn tại, vật chất, với tính cách là vật chất, không có sự tồn tại cảm tính”. Như vậy, vật chất với tính cách là vật chất, một sáng tạo thuần túy của tư duy, và là một trừu tượng thuần túy, không có sự tồn tại cảm tính.\nPh. Ăngghen cũng chỉ ra rằng, bản thân phạm trù vật chất cũng không phải là sự sáng tạo tùy tiện của tư duy con người, mà trái lại, là kết quả của con đường trừu tượng hóa của tư duy con người về các sự vật, hiện tượng có thể cảm biết được bằng các giác quan. Các sự vật, hiện tượng của thế giới, dù rất phong phú, muôn vẻ nhưng chúng vẫn có một đặc tính chung, thống nhất đó là tính vật chất - tính tồn tại độc lập không lệ thuộc vào ý thức. Để bao quát được tất cả các sự vật, hiện tượng cụ thể, thì tư duy cần phải nắm lấy đặc tính chung này và đưa nó vào trong phạm trù vật chất. “Ê-te có tính vật chất không? Nếu ê-te nói chung tồn tại thì ê-te phải có tính vật chất, nó phải nằm trong khái niệm vật chất”2.\nĐặc biệt, Ph. Ăngghen khẳng định, xét về thực chất, nội hàm của phạm trù vật chất chẳng qua chỉ là sự tóm tắt, tập hợp theo những thuộc tính chung của tính phong phú, muôn vẻ nhưng có thể cảm biết được bằng các giác quan của các sự vật, hiện tượng của thế giới vật chất. “Thực thể, vật chất không phải cái gì khác hơn là tổng số những vật thể từ đó người ta rút ra khái niệm ấy bằng con đường trừu tượng hóa; vận động với tính cách là vận động không phải là cái gì khác hơn là tổng số những hình thức vận động có thể cảm biết được bằng các giác quan; những từ như “vật chất” và “vận động” chỉ là những sự tóm tắt trong đó chúng ta tập hợp theo những thuộc tính chung của chúng, rất nhiều sự vật khác nhau có thể cảm biết được bằng các giác quan. Vì thế chỉ có thể nhận thức được vật chất và vận động bằng cách nghiên cứu những vật thể riêng biệt và những hình thức riêng lẻ của vận động, và khi chúng ta nhận thức được những cái ấy thì chúng ta cũng nhận thức được cả vật chất và vận động với tính cách là vật chất và vận động”."
  },
  {
    "title": "C. Mác không đưa ra một định nghĩa về vật chất, nhưng đã vận dụng đúng đắn quan điểm duy vật biện chứng về vật chất trong phân tích những vấn đề chính trị - xã hội, đặc biệt là trong phân tích quá trình sản xuất vật chất của xã hội và mở rộng quan điểm duy vật biện chứng về vật chất để phân tích tồn tại xã hội và mối quan hệ biện chứng giữa tồn tại xã hội và ý thức xã hội. C. Mác và Ph. Ăngghen đã khẳng định quan điểm duy vật biện chứng của mình trong nghiên cứu lịch sử như sau: Những tiền đề xuất phát của tôi, “Đó là những cá nhân hiện thực, là hoạt động của họ và những điều kiện sinh hoạt vật chất của họ, những điều kiện mà họ thấy có sẵn cũng như những điều kiện do hoạt động của chính họ tạo ra...”. Như vậy, vật chất trong xã hội chính là tồn tại của chính bản thân con người cùng với những điều kiện sinh hoạt vật chất của con người, hoạt động vật chất và những quan hệ vật chất giữa người với người.",
    "level": 1,
    "body": "V.I. Lênin đã tiến hành tổng kết toàn diện những thành tựu mới nhất của khoa học, đấu tranh chống mọi biểu hiện của chủ nghĩa hoài nghi, duy tâm đang lầm lẫn hoặc xuyên tạc những thành tựu mới trong nhận thức cụ thể của con người về vật chất, mưu toan bác bỏ chủ nghĩa duy vật, qua đó bảo vệ và phát triển quan niệm duy vật biện chứng về phạm trù vật chất.\nĐể đưa ra được một quan niệm thực sự khoa học về vật chất, V.I. Lênin đặc biệt quan tâm đến việc tìm kiếm phương pháp định nghĩa cho phạm trù này. Kế thừa những tư tưởng của C. Mác và Ph. Ăngghen, V.I. Lênin đã định nghĩa vật chất với tư cách là một phạm trù triết học và bằng cách đem đối lập với phạm trù ý thức trên phương diện nhận thức luận cơ bản. V.I. Lênin viết: “không thể đem lại cho hai khái niệm nhận thức luận này một định nghĩa nào khác ngoài cách chỉ rõ rằng trong hai khái niệm đó, cái nào được coi là có trước”.\nTrong tác phẩm Chủ nghĩa duy vật và chủ nghĩa kinh nghiệm phê phán, V.I. Lênin đã đưa ra định nghĩa về vật chất như sau: “Vật chất là một phạm trù triết học dùng để chỉ thực tại khách quan được đem lại cho con người trong cảm giác, được cảm giác của chúng ta chép lại, chụp lại, phản ánh, và tồn tại không lệ thuộc vào cảm giác”2. Đây là một định nghĩa hoàn chỉnh về vật chất mà cho đến nay các nhà khoa học hiện đại coi là một định nghĩa kinh điển.\nĐịnh nghĩa vật chất của V.I. Lênin bao hàm các nội dung cơ bản sau đây:\nThứ nhất, vật chất là thực tại khách quan - cái tồn tại hiện thực bên ngoài ý thức và không lệ thuộc vào ý thức.\nKhi nói vật chất là một phạm trù triết học là muốn nói phạm trù này là sản phẩm của sự trừu tượng hóa, không có sự tồn tại cảm tính. Nhưng khác về nguyên tắc với mọi sự trừu tượng hóa mang tính chất duy tâm chủ nghĩa về phạm trù này, V.I. Lênin nhấn mạnh rằng, phạm trù triết học này dùng để chỉ cái ““đặc tính” duy nhất của vật chất - mà chủ nghĩa duy vật triết học là gắn liền với việc thừa nhận đặc tính này - là cái đặc tính tồn tại với tư cách là thực tại khách quan, tồn tại ở ngoài ý thức của chúng ta”. Nói cách khác, tính trừu tượng của phạm trù vật chất bắt nguồn từ cơ sở hiện thực, do đó, không tách rời tính hiện thực cụ thể của nó. Nói đến vật chất là nói đến tất cả những gì đã và đang hiện hữu thực sự bên ngoài ý thức của con người. Vật chất là hiện thực chứ không phải là hư vô và hiện thực này mang tính khách quan chứ không phải hiện thực chủ quan. Đây cũng chính là cái “phạm vi hết sức hạn chế” mà ở đó, theo V.I. Lênin, sự đối lập giữa vật chất và ý thức là tuyệt đối. Tuyệt đối hóa tính trừu tượng của phạm trù này sẽ không thấy vật chất, sẽ rơi vào quan điểm duy tâm. Ngược lại, nếu tuyệt đối hóa tính hiện thực cụ thể của phạm trù này sẽ đồng nhất vật chất với vật thể, và đó là thực chất quan điểm của chủ nghĩa duy vật trước C. Mác về vấn đề này. Như vậy, mọi sự vật, hiện tượng từ vi mô đến vĩ mô, từ những cái đã biết đến những cái chưa biết, từ những sự vật “giản đơn nhất” đến những hiện tượng vô cùng “kỳ lạ”, dù tồn tại trong tự nhiên hay trong xã hội cũng đều là những đối tượng tồn tại khách quan, độc lập với ý thức con người, nghĩa là đều thuộc phạm trù vật chất, đều là các dạng cụ thể của vật chất. Xã hội loài người cũng là một dạng tồn tại đặc biệt của vật chất. Theo V.I. Lênin, trong đời sống xã hội thì “khách quan không phải theo ý nghĩa là một xã hội những sinh vật có ý thức, những con người, có thể tồn tại và phát triển không phụ thuộc vào sự tồn tại của những sinh vật có ý thức (...), mà khách quan theo ý nghĩa là tồn tại xã hội không phụ thuộc vào ý thức xã hội của con người”.\nKhẳng định trên đây có ý nghĩa rất quan trọng trong việc phê phán thế giới quan duy tâm vật lý học, giải phóng khoa học tự nhiên khỏi cuộc khủng hoảng thế giới quan, khuyến khích các nhà khoa học đi sâu tìm hiểu thế giới vật chất, khám phá ra những thuộc tính mới, kết cấu mới của vật chất, không ngừng làm phong phú tri thức của con người về thế giới.\nThứ hai, vật chất là cái mà khi tác động vào các giác quan con người thì đem lại cho con người cảm giác.\nTrái với quan niệm “khách quan” mang tính chất duy tâm về sự tồn tại của vật chất, V.I. Lênin khẳng định rằng, vật chất luôn biểu hiện đặc tính hiện thực khách quan của mình thông qua sự tồn tại không lệ thuộc vào ý thức của các sự vật, hiện tượng cụ thể, tức là luôn biểu hiện sự tồn tại hiện thực của mình dưới dạng các thực thể. Các thực thể này do những đặc tính bản thể luận vốn có của nó, nên khi trực tiếp hoặc gián tiếp tác động vào các giác quan sẽ đem lại cho con người những cảm giác. Mặc dù không phải mọi sự vật, hiện tượng, quá trình trong thế giới khi tác động lên giác quan của con người đều được các giác quan con người nhận biết; có cái phải qua dụng cụ khoa học, thậm chí có cái bằng dụng cụ khoa học nhưng cũng chưa biết; có cái đến nay vẫn chưa có dụng cụ khoa học để biết được; song, nếu nó tồn tại khách quan, hiện thực ở bên ngoài, độc lập, không phụ thuộc vào ý thức của con người thì nó vẫn là vật chất.\nChủ nghĩa duy vật biện chứng không bàn đến vật chất một cách chung chung, mà bàn đến nó trong mối quan hệ với ý thức của con người; trong đó, xét trên phương diện nhận thức luận thì vật chất là cái có trước, là tính thứ nhất, là cội nguồn của cảm giác (ý thức); còn cảm giác (ý thức) là cái có sau, là tính thứ hai, là cái phụ thuộc vào vật chất. Đó cũng là câu trả lời theo lập trường nhất nguyên duy vật của V.I. Lênin đối với mặt thứ nhất vấn đề cơ bản của triết học.\nThứ ba, vật chất là cái mà ý thức chẳng qua chỉ là sự phản ánh của nó.\nChỉ có một thế giới duy nhất là thế giới vật chất. Trong thế giới ấy, theo quy luật vốn có của nó mà đến một thời điểm nhất định sẽ cùng một lúc tồn tại hai hiện tượng - hiện tượng vật chất và hiện tượng tinh thần. Các hiện tượng vật chất luôn tồn tại khách quan, không lệ thuộc vào các hiện tượng tinh thần. Còn các hiện tượng tinh thần (cảm giác, tư duy, ý thức...) lại luôn luôn có nguồn gốc từ các hiện tượng vật chất và những gì có được trong các hiện tượng tinh thần ấy (nội dung của chúng) chẳng qua cũng chỉ là chép lại, chụp lại, là bản sao của các sự vật, hiện tượng đang tồn tại với tư cách là hiện thực khách quan. Như vậy, cảm giác là cơ sở duy nhất của mọi sự hiểu biết, song bản thân nó lại không ngừng chép lại, chụp lại, phản ánh hiện thực khách quan, nên về nguyên tắc, con người có thể nhận thức được thế giới vật chất. Trong thế giới vật chất không có gì là không thể biết, chỉ có những cái đã biết và những cái chưa biết, do hạn chế của con người trong từng giai đoạn lịch sử nhất định. Cùng với sự phát triển của khoa học, các giác quan của con người ngày càng được “nối dài”, giới hạn nhận thức của các thời đại bị vượt qua, bị mất đi chứ không phải vật chất mất đi như những người duy tâm quan niệm.\nKhẳng định trên đây có ý nghĩa hết sức quan trọng trong việc bác bỏ thuyết “bất khả tri”, đồng thời có tác dụng khuyến khích các nhà khoa học đi sâu tìm hiểu thế giới vật chất, góp phần làm giàu kho tàng tri thức nhân loại. Ngày nay, khoa học tự nhiên, khoa học xã hội và nhân văn ngày càng phát triển với những khám phá mới càng khẳng định tính đúng đắn của quan niệm duy vật biện chứng về vật chất, chứng tỏ định nghĩa vật chất của V.I. Lênin vẫn giữ nguyên giá trị, và do đó, chủ nghĩa duy vật biện chứng ngày càng khẳng định vai trò là hạt nhân thế giới quan, phương pháp luận đúng đắn của các khoa học hiện đại.\nÝ nghĩa phương pháp luận của quan niệm vật chất của triết học Mác - Lênin\nĐịnh nghĩa vật chất của V.I. Lênin đã giải quyết hai mặt vấn đề cơ bản của triết học trên lập trường của chủ nghĩa duy vật biện chứng; cung cấp nguyên tắc thế giới quan và phương pháp luận khoa học để đấu tranh chống chủ nghĩa duy tâm, thuyết không thể biết, chủ nghĩa duy vật siêu hình và mọi biểu hiện của chúng trong triết học tư sản hiện đại về phạm trù này. Trong nhận thức và thực tiễn, đòi hỏi con người phải quán triệt nguyên tắc khách quan, xuất phát từ hiện thực khách quan, tôn trọng khách quan, nhận thức và vận dụng đúng quy luật khách quan... Định nghĩa vật chất của V.I. Lênin là cơ sở khoa học cho việc xác định vật chất trong lĩnh vực xã hội, đó là các điều kiện sinh hoạt vật chất, hoạt động vật chất và các quan hệ vật chất xã hội giữa người với người. Nó còn tạo sự liên kết giữa chủ nghĩa duy vật biện chứng và chủ nghĩa duy vật lịch sử thành một hệ thống lý luận thống nhất, góp phần tạo nên nền tảng lý luận khoa học cho việc phân tích một cách duy vật biện chứng các vấn đề của chủ nghĩa duy vật lịch sử, trước hết là các vấn đề về sự vận động và phát triển của phương thức sản xuất vật chất, về mối quan hệ giữa tồn tại xã hội và ý thức xã hội, về mối quan hệ giữa quy luật khách quan của lịch sử và hoạt động có ý thức của con người..."
  },
  {
    "title": "d) Phương thức tồn tại của vật chất",
    "level": 3,
    "body": "Phương thức tồn tại của vật chất tức là cách thức tồn tại và hình thức tồn tại của vật chất. Chủ nghĩa duy vật biện chứng khẳng định: Vận động là cách thức tồn tại, đồng thời là hình thức tồn tại của vật chất; không gian, thời gian là hình thức tồn tại của vật chất.\n* Vận động\nSự tồn tại của thế giới vật chất hết sức phong phú và phức tạp. Với tư cách là một khái niệm triết học, vận động theo nghĩa chung nhất là mọi sự biến đổi nói chung. Ph. Ăngghen viết: “Vận động, hiểu theo nghĩa chung nhất, - tức được hiểu là một phương thức tồn tại của vật chất, là một thuộc tính cố hữu của vật chất, - thì bao gồm tất cả mọi sự thay đổi và mọi quá trình diễn ra trong vũ trụ, kể từ sự thay đổi vị trí đơn giản cho đến tư duy”.\n- Vận động là phương thức tồn tại của vật chất\nTrước hết, vận động là thuộc tính cố hữu của vật chất. Không ở đâu và ở nơi nào lại có thể có vật chất không vận động. Sự tồn tại của vật chất là tồn tại bằng cách vận động, tức là vật chất dưới các dạng thức của nó luôn luôn trong quá trình biến đổi không ngừng. Các dạng tồn tại cụ thể của vật chất không thể không có thuộc tính vận động. Thế giới vật chất, từ những thiên thể khổng lồ đến những hạt cơ bản vô cùng nhỏ, từ giới vô cơ đến giới hữu cơ, từ hiện tượng tự nhiên đến hiện tượng xã hội, tất cả đều ở trạng thái không ngừng vận động, biến đổi. Sở dĩ như vậy là vì, bất cứ sự vật, hiện tượng nào cũng là một thể thống nhất có kết cấu nhất định giữa các nhân tố, các khuynh hướng, các bộ phận khác nhau, đối lập nhau. Trong hệ thống ấy, chúng luôn tác động, ảnh hưởng lẫn nhau và chính sự ảnh hưởng, tác động qua lại lẫn nhau ấy gây ra sự biến đổi nói chung, tức là vận động. Như thế, vận động của vật chất là tự thân vận động và mang tính phổ biến.\nVật chất chỉ có thể tồn tại bằng cách vận động và thông qua vận động mà biểu hiện sự tồn tại của nó với các hình dạng phong phú, muôn vẻ, vô tận. Do đó, con người chỉ nhận thức được sâu sắc sự vật, hiện tượng bằng cách xem xét chúng trong quá trình vận động. Nhận thức sự vận động của một sự vật, một hiện tượng chính là nhận thức bản thân sự vật, hiện tượng đó. Nhiệm vụ của mọi khoa học, suy đến cùng và xét về thực chất là nghiên cứu sự vận động của vật chất trong các phạm vi, lĩnh vực, trình độ, kết cấu khác nhau. Ph. Ăngghen khẳng định: “Các hình thức và các dạng khác nhau của vật chất chỉ có thể nhận thức được thông qua vận động; thuộc tính của vật thể chỉ bộc lộ qua vận động; về một vật thể không vận động thì không có gì mà nói cả”.\nChủ nghĩa duy tâm và tôn giáo cho rằng, có vận động mà không có vật chất, tức là có lực lượng phi vật chất vận động bên ngoài thế giới vật chất. Một số nhà duy tâm còn viện dẫn cả những thành tựu của khoa học hiện đại để minh chứng cho quan điểm của chủ nghĩa duy năng ra đời từ thế kỷ XIX. Họ giải thích mối quan hệ phụ thuộc lẫn nhau giữa khối lượng và năng lượng thành sự biến đổi của khối lượng thành năng lượng phi vật chất. V.I. Lênin cho rằng, quan niệm trên đây của các nhà triết học duy tâm chẳng qua chỉ là “thử dùng thuật ngữ “mới” để ngụy trang cho những sai lầm cũ về nhận thức luận”.\nVận động là thuộc tính cố hữu và là phương thức tồn tại của vật chất; do đó, nó tồn tại vĩnh viễn, không thể tạo ra và không bị tiêu diệt. Quan niệm về tính không thể tạo ra và không bị tiêu diệt của vận động đã được các nhà khoa học tự nhiên chứng minh bằng quy luật bảo toàn và chuyển hóa năng lượng. Theo quy luật này, vận động của vật chất được bảo toàn cả về số lượng và chất lượng. Bảo toàn về lượng của vận động có nghĩa là tổng số vận động của vũ trụ là không thay đổi, lượng vận động của sự vật này mất đi thì cũng ngang bằng lượng vận động của các sự vật khác nhận được. Bảo toàn về chất của vận động là bảo toàn các hình thức vận động và bảo toàn khả năng chuyển hóa của các hình thức vận động. Một hình thức vận động cụ thể thì có thể mất đi để chuyển hóa thành hình thức vận động khác, còn vận động nói chung tồn tại vĩnh viễn gắn liền với bản thân vật chất.\n- Những hình thức vận động cơ bản của vật chất\nHình thức vận động của vật chất rất đa dạng, được biểu hiện ra với các quy mô, trình độ và tính chất hết sức khác nhau. Việc khám phá và phân chia các hình thức vận động của vật chất diễn ra cùng với sự phát triển nhận thức của con người. Dựa vào những thành tựu khoa học của thời đại mình, Ph. Ăngghen đã chia vận động của vật chất thành năm hình thức cơ bản: cơ học, vật lý, hóa học, sinh học và xã hội. “Vận động trong không gian vũ trụ, vận động cơ học của các vật thể tương đối nhỏ trên một thiên thể riêng biệt, chấn động phân tử dưới hình thức nhiệt, dòng điện, dòng từ phổ, phân giải và hợp chất hóa học, sự sống hữu cơ cho đến cái sản phẩm cao nhất của nó là tư duy”.\nThông qua các hình thức cơ bản của vận động cho thấy, vật chất tồn tại hiện hữu dưới dạng là một đối tượng cơ học, hay vật lý, hóa học, sinh học hoặc xã hội. Chính vì vậy, vận động nói chung là một hình thức tồn tại của vật chất. Cơ sở của sự phân chia đó dựa trên các nguyên tắc: các hình thức vận động phải tương ứng với trình độ nhất định của tổ chức vật chất; các hình thức vận động có mối liên hệ phát sinh, nghĩa là hình thức vận động cao nảy sinh trên cơ sở của những hình thức vận động thấp và bao hàm hình thức vận động thấp; hình thức vận động cao khác về chất so với hình thức vận động thấp và không thể quy về hình thức vận động thấp. Việc phân chia các hình thức vận động cơ bản có ý nghĩa quan trọng đối với việc phân chia đối tượng và xác định mối quan hệ giữa các ngành khoa học, đồng thời cũng cho phép vạch ra các nguyên lý đặc trưng cho sự tương quan giữa các hình thức vận động của vật chất. Trong tương lai, khoa học hiện đại có thể sẽ phát hiện ra những trình độ tổ chức vật chất mới, và do đó, cũng có thể tìm ra những hình thức vận động mới, cho nên có thể và cần phải phát triển, bổ sung cho sự phân loại nói trên của Ph. Ăngghen, mặc dù những nguyên tắc căn bản của sự phân loại đó vẫn giữ nguyên giá trị.\nCác hình thức vận động tồn tại trong mối liên hệ không thể tách rời nhau. Giữa hai hình thức vận động cao và thấp có thể có hình thức vận động trung gian, đó là những mắt khâu chuyển tiếp trong quá trình chuyển hóa lẫn nhau của các hình thức vận động. Tuy nhiên, những kết cấu vật chất đặc thù bao giờ cũng được đặc trưng bởi một hình thức vận động cơ bản nhất định và khi đó các hình thức vận động khác chỉ tồn tại như những nhân tố, những vệ tinh của hình thức vận động cơ bản. Vì vậy, vừa phải thấy mối liên hệ giữa các hình thức vận động, vừa phải phân biệt sự khác nhau về chất của chúng.\nCác nhà triết học duy vật thế kỷ XVII và XVIII, do quan niệm siêu hình, đã quy mọi hình thức vận động thành một hình thức duy nhất là vận động cơ học. Họ coi hoạt động của giới tự nhiên và của cả con người không gì khác hơn là hoạt động của một cỗ máy. Việc quy hình thức vận động phức tạp thành hình thức vận động giản đơn được gọi là chủ nghĩa cơ giới. Quan niệm sai lầm của chủ nghĩa cơ giới là nguyên nhân dẫn đến bế tắc trong việc lý giải những biến đổi của thế giới sinh vật và xã hội.\nĐến giữa thế kỷ XIX, những người theo chủ nghĩa Đácuyn xã hội, một biến tướng của chủ nghĩa cơ giới, lại quy vận động xã hội thành vận động sinh học, coi con người như là một sinh vật thuần túy. Họ cho rằng, sự tồn tại, phát triển của xã hội là quá trình chọn lọc tự nhiên, trong đó con người cắn xé, tiêu diệt lẫn nhau để sinh tồn, kẻ nào mạnh, thích ứng được thì tồn tại, ngược lại sẽ bị tiêu diệt. Rõ ràng, thuyết tiến hóa của Darwin (Đácuyn) là một khoa học chân chính; còn chủ nghĩa Đácuyn xã hội là sai lầm, bịa đặt vì nó hạ con người xuống hàng con vật. Sự ra đời của chủ nghĩa Đácuyn xã hội có nguồn gốc nhận thức, nhưng chủ yếu là do nguyên nhân giai cấp. Nó là cơ sở lý luận cho sự áp đặt trật tự tư bản, biện hộ cho chính sách xâm lược của chủ nghĩa đế quốc. V.I. Lênin cho rằng, dựa vào những khái niệm như “đấu tranh sinh tồn”, “đồng hóa”, “dị hóa” thì sẽ không hiểu gì về khoa học xã hội, và do đó không thể dán nhãn hiệu “sinh vật học” lên những hiện tượng xã hội như khủng hoảng kinh tế, cách mạng xã hội và đấu tranh giai cấp. Bởi vậy, nghiên cứu sự thống nhất và khác nhau của các hình thức vận động của vật chất vừa là vấn đề có ý nghĩa phương pháp luận quan trọng, đồng thời là vấn đề có ý nghĩa thực tiễn sâu sắc, giúp chúng ta đề phòng và khắc phục những sai lầm trong nghiên cứu khoa học và thực tiễn xã hội.\n- Vận động và đứng im\nSự vận động không ngừng của vật chất không những không loại trừ mà trái lại còn bao hàm trong đó sự đứng im tương đối.\nTheo quan điểm của chủ nghĩa duy vật biện chứng, đứng im là trạng thái ổn định về chất của sự vật, hiện tượng trong những mối quan hệ và điều kiện cụ thể, là hình thức biểu hiện sự tồn tại thực sự của các sự vật, hiện tượng và là điều kiện cho sự vận động chuyển hóa của vật chất. Như vậy, đứng im chỉ có tính tạm thời, chỉ xảy ra trong một mối quan hệ nhất định chứ không phải trong mọi mối quan hệ cùng một thời điểm, chỉ xảy ra với một hình thức vận động nào đó, ở một lúc nào đó, chứ không phải cùng một lúc đối với mọi hình thức vận động. Hơn nữa, đứng im chỉ là sự biểu hiện của một trạng thái vận động - vận động trong thăng bằng, trong sự ổn định tương đối. Nói cách khác, đứng im là một dạng của vận động, trong đó sự vật chưa thay đổi căn bản về chất, nó còn là nó chứ chưa chuyển hóa thành cái khác.\nVận động cá biệt có xu hướng hình thành, duy trì sự tồn tại ổn định của một sự vật, hiện tượng nào đó. Nhưng, vận động nói chung, tức là sự tác động qua lại của vô số các sự vật, hiện tượng, lại làm cho tất cả các sự vật, hiện tượng không ngừng biến đổi, cho nên đứng im chỉ tương đối, tạm thời. Ph. Ăngghen viết: “vận động riêng biệt có xu hướng chuyển thành cân bằng, vận động toàn bộ lại phá hoại sự cân bằng riêng biệt”.\nMặc dù mang tính chất tương đối tạm thời, nhưng đứng im lại “chứng thực” cho hình thức tồn tại thực sự của vật chất, là điều kiện cho sự vận động chuyển hóa của vật chất. Không có đứng im thì không có sự ổn định của sự vật và con người cũng không bao giờ nhận thức được chúng. Không có đứng im thì sự vật, hiện tượng cũng không thể thực hiện được sự vận động chuyển hóa tiếp theo. Vận động và đứng im tạo nên sự thống nhất biện chứng của các mặt đối lập trong sự phát sinh, tồn tại và phát triển của mọi sự vật, hiện tượng, nhưng vận động là tuyệt đối, còn đứng im là tương đối.\nSự vật, hiện tượng khác nhau, hoặc cùng một sự vật, hiện tượng nhưng trong các mối quan hệ khác nhau, ở các điều kiện khác nhau, thì đứng im cũng khác nhau. Ví dụ: đứng im của một nguyên tử sẽ khác đứng im của một hình thái kinh tế - xã hội; đứng im của một xã hội về mặt chính trị sẽ khác đứng im về mặt kinh tế... Vì vậy, vấn đề không chỉ ở chỗ khẳng định tính tuyệt đối của vận động và tính tương đối của đứng im mà phải nghiên cứu sự vận động và đứng im của sự vật, hiện tượng với quan điểm lịch sử, cụ thể.\nQuan niệm của phép biện chứng duy vật về vận động của vật chất đòi hỏi phải quán triệt quan điểm vận động vào nhận thức và thực tiễn. Quan điểm vận động đòi hỏi phải xem xét, đánh giá sự vật, hiện tượng trong quá trình vận động, đồng thời khi tiến hành cải tạo sự vật, hiện tượng phải thông qua những hình thức vận động vốn có, đặc trưng của chúng. Nhận thức các hình thức vận động của vật chất thực chất là nhận thức bản thân thế giới vật chất.\n* Không gian và thời gian\nDựa trên những thành tựu của khoa học và thực tiễn, chủ nghĩa duy vật biện chứng đã khẳng định tính khách quan của không gian và thời gian, xem không gian và thời gian là hình thức tồn tại của vật chất vận động; trong đó, không gian là hình thức tồn tại của vật chất xét về mặt quảng tính, sự cùng tồn tại, trật tự, kết cấu và sự tác động lẫn nhau. Thời gian là hình thức tồn tại của vật chất vận động xét về mặt độ dài diễn biến, sự kế tiếp của các quá trình.\nKhông gian và thời gian là những hình thức tồn tại của vật chất vận động, được con người khái quát khi nhận thức thế giới. Không có không gian và thời gian thuần túy tách rời vật chất vận động. V.I. Lênin viết: “Trong thế giới, không có gì ngoài vật chất đang vận động và vật chất đang vận động không thể vận động ở đâu ngoài không gian và thời gian”.\nKhông gian và thời gian là hai thuộc tính, hai hình thức tồn tại khác nhau của vật chất vận động, nhưng chúng không tách rời nhau. Không có sự vật, hiện tượng nào tồn tại trong không gian mà lại không có một quá trình diễn biến của nó. Cũng không thể có sự vật, hiện tượng nào có thời gian tồn tại mà lại không có quảng tính, kết cấu nhất định. Tính chất của không gian và sự biến đổi của nó bao giờ cũng gắn liền với tính chất và sự biến đổi của thời gian và ngược lại. Do đó, về thực chất không gian và thời gian là một thể thống nhất không gian - thời gian. Vật chất có ba chiều không gian và một chiều thời gian.\nSự phát triển của triết học và khoa học đã bác bỏ quan niệm sai lầm của Newton về một không gian, thời gian thuần túy, đồng nhất. Đặc biệt, những hệ quả rút ra từ thuyết tương đối của Albert Einstein đã chứng minh rằng không gian, thời gian có tính khả biến, phụ thuộc vào tốc độ, khối lượng, trường hấp dẫn của các đối tượng vật chất và các quá trình vật chất khác nhau. Do vậy, vật chất vận động quy định không gian, thời gian chứ không phải không gian là cái “thùng rỗng”, cái “khung cứng” bất biến chứa đầy vật chất bên trong như quan niệm của những người máy móc, siêu hình.\nKhông gian và thời gian của vật chất nói chung là vô tận, xét về cả phạm vi lẫn tính chất. Khoa học hiện đại đã chứng minh rằng trong thế giới không ở đâu có tận cùng về không gian, cũng như không ở đâu có ngưng đọng, không biến đổi hoặc không có sự tiếp nối của các quá trình. Không gian và thời gian của một sự vật, hiện tượng cụ thể là có tận cùng và hữu hạn.\nQuan niệm đúng đắn và khoa học trên đây của chủ nghĩa duy vật biện chứng về không gian và thời gian đã bác bỏ quan niệm của chủ nghĩa duy tâm chủ quan coi không gian và thời gian là hình thức trực quan tiên nghiệm, là sự sắp xếp các cảm giác mà con người thu được  theo một trật tự nhất định (quan niệm của Kant), hoặc chỉ là hệ thống liên kết chặt chẽ của những chuỗi cảm giác, do con người sinh ra (quan niệm của E. Mach). Khi phân tích thực chất của những quan niệm này, V.I. Lênin cho rằng: “Đó là một điều vô lý duy tâm rõ rệt nảy sinh ra một cách tất nhiên từ học thuyết nói rằng vật thể là những phức hợp cảm giác”.\nQuan niệm của chủ nghĩa duy vật biện chứng về không gian và thời gian là cơ sở lý luận khoa học để đấu tranh chống lại quan niệm duy tâm, siêu hình tách rời không gian và thời gian với vật chất vận động. Quan niệm đó đòi hỏi phải quán triệt nguyên tắc phương pháp luận về tính lịch sử - cụ thể trong nhận thức và hoạt động thực tiễn.\nđ) Tính thống nhất vật chất của thế giới\n* Tồn tại của thế giới là tiền đề cho sự thống nhất của thế giới\nTrong quan niệm về sự thống nhất của thế giới phải lấy việc thừa nhận sự tồn tại của nó làm tiền đề. Không thừa nhận sự tồn tại của thế giới thì không thể nói tới việc nhận thức thế giới.\nTrong việc nhận thức thế giới, vấn đề đầu tiên nảy sinh đối với tư duy triết học là: Thế giới quanh ta có thực hay chỉ là sản phẩm thuần túy của tư duy con người? Hơn nữa, mọi sự vật, hiện tượng mà ta đã biết được không phải là vĩnh viễn, vậy có thể nói tới sự tồn tại của chúng và suy rộng ra có thể nói về sự tồn tại của thế giới hay không? Nếu khẳng định là có, thì tồn tại là gì?\nTheo nghĩa chung nhất, tồn tại là phạm trù dùng để chỉ tính có thực của thế giới xung quanh con người. Khẳng định sự tồn tại là gạt bỏ những nghi ngờ về tính không thực, sự hư vô, tức là gạt bỏ sự “không tồn tại”.\nSự tồn tại của thế giới là hết sức phong phú về dạng, loại. Có tồn tại vật chất và tồn tại tinh thần. Có tồn tại khách quan và tồn tại chủ quan. Có tồn tại của tự nhiên và tồn tại của xã hội... Nhưng quy luật phát triển của lịch sử tư tưởng triết học vừa cho phép lại vừa đòi hỏi con người không thể dừng lại ở việc khẳng định hay phủ định tồn tại nói chung, mà phải đi đến quan niệm về bản chất của tồn tại. Theo đó, hình thành hai trường phái đối lập nhau trong việc giải quyết vấn đề này. Chủ nghĩa duy vật hiểu sự tồn tại của thế giới như một chỉnh thể mà bản chất của nó là vật chất. Trái lại, các nhà triết học duy tâm khẳng định chỉ có thế giới tinh thần mới tồn tại nên bản chất của tồn tại cũng là tinh thần.\nĐúng là thế giới quanh ta tồn tại, nhưng hình thức tồn tại của thế giới là hết sức đa dạng. Vì thế, tồn tại của thế giới là tiền đề cho sự thống nhất của thế giới. Song, tính thống nhất của thế giới không phải ở sự tồn tại của nó. Sự khác nhau về nguyên tắc giữa quan niệm duy vật và quan niệm duy tâm không phải ở việc có thừa nhận hay không thừa nhận tính thống nhất của thế giới, mà là ở chỗ chủ nghĩa duy vật cho rằng, cơ sở của sự thống nhất của thế giới là ở tính vật chất của nó.\n* Thế giới thống nhất ở tính vật chất\nCăn cứ vào đời sống thực tiễn và sự phát triển lâu dài của triết học và khoa học, chủ nghĩa duy vật biện chứng khẳng định bản chất của thế giới là vật chất, thế giới thống nhất ở tính vật chất. Điều đó được thể hiện ở những điểm cơ bản sau đây:\n- Chỉ một thế giới duy nhất và thống nhất là thế giới vật chất. Thế giới vật chất tồn tại khách quan, có trước và độc lập với ý thức con người, được ý thức con người phản ánh.\n- Mọi bộ phận của thế giới có mối quan hệ vật chất thống nhất với nhau, biểu hiện ở chỗ chúng đều là những dạng cụ thể của vật chất, là sản phẩm của vật chất, cùng chịu sự chi phối của những quy luật khách quan, phổ biến của thế giới vật chất.\n- Thế giới vật chất không do ai sinh ra và cũng không tự mất đi, tồn tại vĩnh viễn, vô hạn và vô tận. Trong thế giới, các sự vật, hiện tượng luôn luôn vận động, biến đổi không ngừng và chuyển hóa lẫn nhau, là nguồn gốc, nguyên nhân và kết quả của nhau, về thực chất, đều là những quá trình vật chất.\nQuan niệm trên đây của chủ nghĩa duy vật biện chứng đã được cuộc sống hiện thực của con người và toàn bộ sự phát triển của khoa học xác định. Con người không thể bằng ý thức của mình sản sinh ra được các đối tượng vật chất, mà chỉ có thể cải biến thế giới vật chất trên cơ sở nắm vững những thuộc tính khách quan vốn có của các dạng vật chất và những quy luật vận động của thế giới vật chất.\nVới sự phát triển của thiên văn học, quang phổ học, vũ trụ học, người ta khẳng định rằng: Không hề có một thế giới siêu nhiên nào ngoài trái đất. Hóa học hiện đại đã chứng minh rằng, giới hữu cơ không có bản chất thần bí, tách biệt với giới vô cơ mà được cấu tạo từ những thành phần vô cơ, phát triển từ giới vô cơ; sự khác nhau giữa chúng chỉ ở kết cấu và trình độ tổ chức, giữa chúng có thể và tất yếu chuyển hóa sang nhau trong những điều kiện nhất định theo quy luật khách quan của thế giới vật chất.\nSự phát triển của sinh vật học, từ những phát hiện về tế bào, tiến hóa luận của Darwin cho đến lý thuyết về gen, về các phân tử ADN và ARN đã cho chúng ta biết chắc chắn rằng thực vật, động vật, cơ thể con người đều có thành phần vô cơ, có cấu trúc và phân hóa tế bào như nhau, có cùng cơ cấu di truyền sự sống, là các bậc thang trong quá trình tiến hóa của thế giới vật chất. Điều đó chứng tỏ sự phong phú của thế giới không đồng nghĩa với tổng số các biến cố ngẫu nhiên, không phải là sự bày ra lộn xộn của các sự vật, hiện tượng, không phải là sự sáng tạo ra một cách tùy tiện của một lực lượng siêu nhiên nào mà là một chỉnh thể thống nhất, trong đó các sự vật, hiện tượng luôn có mối liên hệ tất yếu với nhau, là điều kiện tồn tại cho nhau, luôn được sinh ra, phát triển và mất đi theo một lôgích nhất định, theo những quy luật khách quan vốn có của thế giới vật chất.\nSự phát triển của định luật bảo toàn và chuyển hóa năng lượng cũng như các quy luật về vật chất vận động đều chứng minh rằng, vật chất không tự nhiên sinh ra và không mất đi, mà luôn chuyển hóa từ dạng này sang dạng khác. Những thành tựu mới nhất về thiên văn học, cơ học lượng tử, thuyết tương đối cùng với sự phát hiện ra hạt và trường, hạt và phản hạt, cũng như khoa học thực nghiệm đã tạo ra được các phản nguyên tử, giải mã được bản đồ gen người... càng cho chúng ta thấy rõ không có thế giới phi vật chất, không có giới hạn cuối cùng của vật chất nói chung cả về quy mô, tính chất, kết cấu và thuộc tính. Cùng với sự phát triển của khoa học và thực tiễn, con người ngày càng phát hiện ra nhiều mắt khâu trung gian trong sợi dây chuyền vận động vô tận của vật chất, và chính điều ấy cho phép chúng ta khẳng định tính liên tục, thống nhất của các quá trình, các trình độ phát triển từ thấp đến cao của vật chất. Không có bất cứ sự vật, hiện tượng nào là hư vô hay sinh ra từ hư vô mà chỉ có các sự vật, hiện tượng vật chất có nguồn gốc vật chất.\nXã hội loài người suy cho cùng cũng là cấp độ đặc biệt của tổ chức vật chất và là cấp độ cao nhất của cấu trúc vật chất. Trong xã hội đó, tuy nhân tố hoạt động là những con người có ý thức, song không làm mất đi tính vật chất, khách quan của đời sống xã hội, của các quan hệ vật chất xã hội. Xã hội cũng là một bộ phận của thế giới vật chất, có nền tảng vật chất, có kết cấu và quy luật vận động khách quan không lệ thuộc vào ý thức của chính con người. Những quan hệ vật chất xã hội tồn tại khách quan, nhưng lại là kết quả của hoạt động thực tiễn của con người. Con người có vai trò năng động, sáng tạo to lớn trong thế giới vật chất, chứ hoàn toàn không hề bất lực trước nó.\nNhư vậy, thế giới bao gồm cả tự nhiên và xã hội, về bản chất là vật chất, thống nhất ở tính vật chất. Ph. Ăngghen kết luận: “Tính thống nhất thực sự của thế giới là ở tính vật chất của nó, và tính vật chất này được chứng minh không phải bằng vài ba lời lẽ khéo léo của kẻ làm trò ảo thuật, mà bằng một sự phát triển lâu dài và khó khăn của triết học và khoa học tự nhiên”."
  },
  {
    "title": "2. Nguồn gốc, bản chất và kết cấu của ý thức",
    "level": 2,
    "body": "Ý thức là một trong hai phạm trù cơ bản được các trường phái triết học quan tâm nghiên cứu, nhưng tùy theo cách lý giải khác nhau mà có những quan niệm rất khác nhau, là cơ sở để hình thành các trường phái triết học khác nhau, hai đường lối cơ bản đối lập nhau là chủ nghĩa duy vật và chủ nghĩa duy tâm. Đứng vững trên lập trường của chủ nghĩa duy vật biện chứng, khái quát những thành tựu mới nhất của khoa học tự nhiên và bám sát thực tiễn xã hội, triết học Mác - Lênin đã góp phần làm sáng tỏ vấn đề ý thức, mối quan hệ giữa vật chất và ý thức."
  },
  {
    "title": "a) Nguồn gốc của ý thức",
    "level": 3,
    "body": "* Quan điểm của chủ nghĩa duy tâm\nKhi lý giải nguồn gốc ra đời của ý thức, các nhà triết học duy tâm cho rằng, ý thức là nguyên thể đầu tiên, tồn tại vĩnh viễn, là nguyên nhân sinh thành, chi phối sự tồn tại, biến đổi của toàn bộ thế giới vật chất. Chủ nghĩa duy tâm khách quan với những đại biểu tiêu biểu như­ Plato, Hegel đã tuyệt đối hóa vai trò của lý tính, khẳng định thế giới “ý niệm”, hay “ý niệm tuyệt đối” là bản thể, sinh ra toàn bộ thế giới hiện thực. Ý thức của con người chỉ là sự “hồi tưởng” về “ý niệm”, hay “tự ý thức” lại “ý niệm tuyệt đối”. Còn chủ nghĩa duy tâm chủ quan với những đại biểu như G. Berkeley (G. Béccơli), E. Mach lại tuyệt đối hóa vai trò của cảm giác, coi cảm giác là tồn tại duy nhất, “tiên thiên”, sản sinh ra thế giới vật chất. Ý thức của con người là do cảm giác sinh ra, nhưng cảm giác theo quan niệm của họ không phải là sự phản ánh thế giới khách quan mà chỉ là cái vốn có của mỗi cá nhân tồn tại tách rời, biệt lập với thế giới bên ngoài. Đó là những quan niệm hết sức phiến diện, sai lầm của chủ nghĩa duy tâm, cơ sở lý luận của tôn giáo.\n* Quan điểm của chủ nghĩa duy vật siêu hình\nĐối lập với các quan niệm của chủ nghĩa duy tâm, các nhà duy vật siêu hình phủ nhận tính chất siêu tự nhiên của ý thức, tinh thần. Họ xuất phát từ thế giới hiện thực để lý giải nguồn gốc của ý thức. Tuy nhiên, do trình độ phát triển khoa học của thời đại đó còn nhiều hạn chế và bị ph­ương pháp siêu hình chi phối nên những quan niệm về ý thức còn mắc nhiều sai lầm.\nCác nhà duy vật siêu hình đã đồng nhất ý thức với vật chất. Họ coi ý thức cũng chỉ là một dạng vật chất đặc biệt, do vật chất sản sinh ra. Chẳng hạn, từ thời cổ đại, Democritos quan niệm ý thức là do những nguyên tử đặc biệt (hình cầu, nhẹ, linh động) liên kết với nhau tạo thành. Các nhà duy vật tầm th­ường thế kỷ XVIII (Can Vogt (Phôgtơ), Jacob Moleschott (Môlétsốt), Ludwing Buchne (Buykhơne...), lại cho rằng: “Óc tiết ra ý thức như gan tiết ra mật”. Một số nhà duy vật khác thuộc phái “Vật hoạt luận” (J.B. Robinet, E. Hechken, Diderot) lại quan niệm ý thức là thuộc tính phổ biến của mọi dạng vật chất - từ giới vô sinh đến giới hữu sinh, mà cao nhất là con người. Theo họ, có chăng sự khác nhau giữa các giống, loài chỉ là ở cấp độ biểu hiện ra bề ngoài bằng ngôn ngữ hay không mà thôi. Nhà triết học Pháp Diderot cho rằng: “cảm giác là đặc tính chung của vật chất, hay là sản phẩm của tính tổ chức của vật chất”.\nNhững sai lầm, hạn chế của chủ nghĩa duy tâm và chủ nghĩa duy vật siêu hình trong quan niệm về ý thức đã được các giai cấp bóc lột, thống trị triệt để lợi dụng, lấy đó làm cơ sở lý luận, công cụ để nô dịch tinh thần quần chúng lao động.\n* Quan điểm của chủ nghĩa duy vật biện chứng\nTrong khi phê phán chủ nghĩa duy tâm khách quan cho rằng “ý niệm” có trước, sáng tạo ra thế giới, C. Mác đồng thời khẳng định quan điểm duy vật biện chứng về ý thức: “ý niệm chẳng qua chỉ là vật chất được đem chuyển vào trong đầu óc con người và được cải biến đi ở trong đó”.\nDựa trên những thành tựu mới của khoa học tự nhiên, nhất là sinh lý học - thần kinh hiện đại, các nhà kinh điển của chủ nghĩa Mác - Lênin khẳng định rằng, xét về nguồn gốc tự nhiên, ý thức chỉ là thuộc tính của vật chất; nhưng không phải của mọi dạng vật chất, mà là thuộc tính của một dạng vật chất sống có tổ chức cao nhất là bộ óc người. Óc người là khí quan vật chất của ý thức. Ý thức là chức năng của bộ óc người. Mối quan hệ giữa bộ óc ng­ười hoạt động bình thường và ý thức không thể tách rời bộ óc. Tất cả những quan niệm tách rời hoặc đồng nhất ý thức với óc người đều dẫn đến quan điểm duy tâm, thần bí hoặc duy vật tầm thường. Ý thức là chức năng của bộ óc người hoạt động bình thường. Sinh lý và ý thức là hai mặt của một quá trình - quá trình sinh lý thần kinh trong bộ óc người mang nội dung ý thức, cũng giống như tín hiệu vật chất mang nội dung thông tin.\nTrái đất hình thành trải qua quá trình tiến hóa lâu dài dẫn đến sự xuất hiện con người. Đó cũng là lịch sử phát triển năng lực phản ánh của thế giới vật chất từ thấp đến cao và cao nhất là trình độ phản ánh - ý thức. Phản ánh là thuộc tính phổ biến của mọi dạng vật chất, được biểu hiện trong sự liên hệ, tác động qua lại giữa các đối tượng vật chất với nhau. Đó là sự tái tạo những đặc điểm của một hệ thống vật chất này ở một hệ thống vật chất khác trong quá trình tác động qua lại của chúng. Sự phản ánh phụ thuộc vào vật tác động và vật nhận tác động; đồng thời luôn mang nội dung thông tin của vật tác động. Các kết cấu vật chất càng phát triển, hoàn thiện thì năng lực phản ánh của nó càng cao. Những đặc trưng cơ bản vừa nêu trên có giá trị khoa học, cung cấp cơ sở để làm sáng tỏ nguồn gốc tự nhiên của ý thức.\nLịch sử tiến hóa của thế giới vật chất đồng thời là lịch sử phát triển thuộc tính phản ánh của vật chất. Giới tự nhiên vô sinh có kết cấu vật chất đơn giản, do vậy trình độ phản ánh đặc trưng của chúng là phản ánh vật lý, hóa học. Đó là trình độ phản ánh mang tính thụ động, chưa có sự định hướng, lựa chọn. Giới tự nhiên hữu sinh ra đời với kết cấu vật chất phức tạp hơn, do đó thuộc tính phản ánh cũng phát triển lên một trình độ mới, khác về chất so với giới tự nhiên vô sinh. Đó là trình độ phản ánh sinh học trong các cơ thể sống có tính định h­ướng, lựa chọn, giúp cho các cơ thể sống thích nghi với môi trường để tồn tại. Trình độ phản ánh sinh học của các cơ thể sống cũng bao gồm nhiều hình thức cụ thể cao thấp khác nhau tùy thuộc vào mức độ hoàn thiện, đặc điểm cấu trúc của các cơ quan chuyên trách làm chức năng phản ánh: ở thực vật, là sự kích thích; ở động vật có hệ thần kinh, là sự phản xạ; ở động vật cấp cao có bộ óc, là tâm lý.\nTâm lý động vật là trình độ phản ánh cao nhất của các loài động vật, bao gồm cả phản xạ không có điều kiện và có điều kiện. Tuy nhiên, tâm lý động vật chưa phải là ý thức, mà đó vẫn là trình độ phản ánh mang tính bản năng của các loài động vật bậc cao, xuất phát từ nhu cầu sinh lý tự nhiên, trực tiếp của cơ thể động vật chi phối. Mặc dù ở một số loài động vật bậc cao, bước đầu đã có trí khôn, trí nhớ, biết “suy nghĩ” theo cách riêng của chúng, nh­ưng theo Ph. Ăngghen, đó chỉ là “cái tiền sử” duy nhất gợi ý cho chúng ta tìm hiểu “bộ óc có tư duy của con người” đã ra đời như thế nào.\nBộ óc người có cấu trúc đặc biệt phát triển, rất tinh vi và phức tạp, bao gồm khoảng 14 - 15 tỷ tế bào thần kinh. Sự phân khu của não bộ và hệ thống dây thần kinh liên hệ với các giác quan để thu nhận và xử lý thông tin từ thế giới khách quan vào não bộ, hình thành những phản xạ có điều kiện và không có điều kiện, điều khiển các hoạt động của cơ thể trong quan hệ với thế giới bên ngoài. Ý thức là hình thức phản ánh đặc trưng chỉ có ở con người và là hình thức phản ánh cao nhất của thế giới vật chất. Ý thức là sự phản ánh thế giới hiện thực bởi bộ óc con người. Như vậy, sự xuất hiện con người và hình thành bộ óc của con người có năng lực phản ánh hiện thực khách quan là nguồn gốc tự nhiên của ý thức.\nTuy vậy, sự ra đời của ý thức không phải chỉ có nguồn gốc tự nhiên mà còn do nguồn gốc xã hội. Sự phát triển của giới tự nhiên mới tạo ra tiền đề vật chất có năng lực phản ánh, chỉ là nguồn gốc sâu xa của ý thức. Hoạt động thực tiễn của loài người mới là nguồn gốc trực tiếp quyết định sự ra đời của ý thức. C. Mác và Ph. Ăngghen khẳng định: “con người cũng có cả “ý thức” nữa. Song đó không phải là một ý thức bẩm sinh sinh ra đã là ý thức “thuần túy”... Do đó ngay từ đầu, ý thức đã là một sản phẩm xã hội, và vẫn là như vậy chừng nào con người còn tồn tại”. Sự hình thành, phát triển của ý thức là một quá trình thống nhất không tách rời giữa nguồn gốc tự nhiên và nguồn gốc xã hội. Trong các công trình nghiên cứu khoa học của mình, C. Mác và Ph. Ăngghen đã nhiều lần chỉ rõ rằng, ý thức không những có nguồn gốc tự nhiên mà còn có nguồn gốc xã hội và là một hiện tượng mang bản chất xã hội.\nĐể tồn tại, con người phải tạo ra những vật phẩm để thỏa mãn nhu cầu của mình. Hoạt động lao động sáng tạo của loài người có nhiều ý nghĩa đặc biệt. Ph. Ăngghen đã chỉ rõ những động lực xã hội trực tiếp thúc đẩy sự ra đời của ý thức: “Trước hết là lao động; sau lao động và đồng thời với lao động là ngôn ngữ; đó là hai sức kích thích chủ yếu đã ảnh hưởng đến bộ óc của con vượn, làm cho bộ óc đó dần dần biến chuyển thành bộ óc con người”. Thông qua hoạt động lao động cải tạo thế giới khách quan mà con người đã từng bước nhận thức được thế giới, có ý thức ngày càng sâu sắc về thế giới.\nÝ thức hình thành không phải là quá trình con người tiếp nhận thụ động các tác động từ thế giới khách quan vào bộ óc của mình, mà chủ yếu từ hoạt động thực tiễn. Con người sử dụng công cụ lao động tác động vào đối tượng hiện thực, bắt chúng phải bộc lộ thành những hiện tượng, những thuộc tính, kết cấu... nhất định và thông qua giác quan, hệ thần kinh tác động vào bộ óc để con người phân loại dưới dạng thông tin, qua đó nhận biết nó ngày càng sâu sắc. Ph. Ăngghen đã khẳng định: “Nhưng cùng với sự phát triển của bàn tay thì từng bước một đầu óc cũng phát triển, ý thức xuất hiện, trước hết là về những điều kiện của các kết quả có ích thực tiễn và về sau,... là về những quy luật tự nhiên chi phối các kết quả có ích đó”.\nTrải qua quá trình hoạt động thực tiễn lâu dài, trong những điều kiện, hoàn cảnh khác nhau, với nhiều loại đối tượng khác nhau; cùng với sự phát triển của tri thức khoa học, các phương pháp tư duy khoa học cũng dần được hình thành, phát triển giúp nhận thức lý tính của loài người ngày càng sâu sắc. Nhận thức lý tính phát triển làm cho ý thức ngày càng trở nên năng động, sáng tạo hơn. Ý thức không chỉ là sự phản ánh tái tạo mà còn chủ yếu là sự phản ánh sáng tạo hiện thực khách quan. Thông qua thực tiễn những sáng tạo trong tư duy được con người hiện thực hóa, cho ra đời nhiều vật phẩm chư­a có trong tự nhiên. Đó là “giới tự nhiên thứ hai” in đậm dấu ấn của bàn tay và khối óc con người.\nLà phương thức tồn tại cơ bản của con người, lao động mang tính xã hội đã làm nảy sinh nhu cầu giao tiếp, trao đổi kinh nghiệm giữa các thành viên trong xã hội. Từ nhu cầu đó, bộ máy phát âm, trung tâm ngôn ngữ trong bộ óc con người được hình thành và hoàn thiện dần. Ph. Ăngghen viết: “Đem so sánh con người với các loài vật, người ta sẽ thấy rõ rằng ngôn ngữ bắt nguồn từ lao động và cùng phát triển với lao động, đó là cách giải thích duy nhất đúng về nguồn gốc của ngôn ngữ”.\nNgôn ngữ là hệ thống tín hiệu vật chất mang nội dung ý thức. Ngôn ngữ xuất hiện trở thành “vỏ vật chất” của tư duy; là hiện thực trực tiếp của ý thức; là phương thức để ý thức tồn tại với tư cách là sản phẩm xã hội - lịch sử. Cùng với lao động, ngôn ngữ có vai trò to lớn đối với sự tồn tại và phát triển của ý thức. Ngôn ngữ (tiếng nói và chữ viết) vừa là phương tiện giao tiếp, vừa là công cụ của tư duy. Nhờ ngôn ngữ, con người có thể khái quát, trừu tượng hóa, suy nghĩ độc lập, tách khỏi sự vật cảm tính; có ngôn ngữ để có thể giao tiếp, trao đổi tư tưởng, lưu giữ, kế thừa những tri thức, kinh nghiệm phong phú của xã hội đã tích lũy được qua các thế hệ, thời kỳ lịch sử. Ý thức là một hiện tượng có tính xã hội, do đó không có phương tiện trao đổi xã hội về mặt ngôn ngữ thì ý thức không thể hình thành và phát triển được.\nLao động và ngôn ngữ là sự kích thích chủ yếu làm chuyển biến dần bộ óc của loài vượn người thành bộ óc con người và tâm lý động vật thành ý thức con người. Ý thức là sự phản ánh hiện thực khách quan bởi bộ óc của con người, nhưng không phải cứ có thế giới khách quan và bộ óc người là có ý thức, mà phải đặt chúng trong mối quan hệ với thực tiễn xã hội. Ý thức là sản phẩm xã hội, một hiện tượng xã hội đặc trưng của loài người.\nXem xét nguồn gốc tự nhiên và nguồn gốc xã hội của ý thức cho thấy, ý thức xuất hiện là kết quả của quá trình tiến hóa lâu dài của giới tự nhiên, của lịch sử trái đất, đồng thời là kết quả trực tiếp của thực tiễn xã hội - lịch sử của con người; trong đó, nguồn gốc tự nhiên là điều kiện cần, còn nguồn gốc xã hội là điều kiện đủ để ý thức hình thành, tồn tại và phát triển. Nếu chỉ nhấn mạnh mặt tự nhiên mà quên đi mặt xã hội, hoặc ng­ược lại chỉ nhấn mạnh mặt xã hội mà quên đi mặt tự nhiên của nguồn gốc ý thức đều dẫn đến những quan niệm sai lầm, phiến diện của chủ nghĩa duy tâm hoặc duy vật siêu hình, không thể hiểu được thực chất của hiện tượng ý thức, tinh thần của loài ng­ười nói chung, cũng như­ của mỗi người nói riêng. Hoạt động thực tiễn phong phú của loài người là môi trường để ý thức hình thành, phát triển và khẳng định sức mạnh sáng tạo của nó. Nghiên cứu nguồn gốc của ý thức cũng là một cách tiếp cận để hiểu rõ bản chất của ý thức, khẳng định bản chất xã hội của ý thức."
  },
  {
    "title": "b) Bản chất của ý thức",
    "level": 3,
    "body": "Do không hiểu được nguồn gốc ra đời của ý thức nên chủ nghĩa duy tâm đã có những quan niệm sai lầm về bản chất của ý thức. Chủ nghĩa duy tâm đã cường điệu vai trò của ý thức một cách thái quá, trừu tượng tới mức thoát ly đời sống hiện thực, biến nó thành một thực thể tồn tại độc lập, thực tại duy nhất và nguồn gốc sinh ra thế giới vật chất.\nNgược lại, chủ nghĩa duy vật siêu hình đã tầm thường hóa vai trò của ý thức. Họ coi ý thức cũng chỉ là một dạng vật chất; hoặc coi ý thức chỉ là sự phản ánh giản đơn, thụ động thế giới vật chất, tách rời thực tiễn xã hội rất phong phú, sinh động. Những quan niệm sai lầm đó đã không cho phép con người hiểu được bản chất của ý thức, cũng như biện chứng của quá trình phản ánh ý thức.\nTrên cơ sở nhận thức đúng đắn nguồn gốc ra đời của ý thức và nắm vững thuyết phản ánh, chủ nghĩa duy vật biện chứng đã luận giải một cách khoa học bản chất của ý thức. Vật chất và ý thức là hai hiện tượng chung nhất của thế giới hiện thực, mặc dù khác nhau về bản chất, nhưng giữa chúng luôn có mối liên hệ biện chứng. Do vậy, muốn hiểu đúng bản chất của ý thức cần xem xét nó trong mối quan hệ qua lại với vật chất, mà chủ yếu là đời sống hiện thực có tính thực tiễn của con người.\nBản chất của ý thức là hình ảnh chủ quan của thế giới khách quan, là quá trình phản ánh tích cực, sáng tạo hiện thực khách quan của óc người.\nNhư vậy, khi xem xét ý thức về mặt bản thể luận thì ý thức chỉ là “hình ảnh” về hiện thực khách quan trong óc người. Đây là đặc tính đầu tiên để nhận biết ý thức. Đối với con người, cả ý thức và vật chất đều là hiện thực, nghĩa là đều tồn tại thực. Nhưng cần phân biệt giữa chúng có sự khác nhau, đối lập nhau về bản chất: vật chất là hiện thực khách quan; còn ý thức là hiện thực chủ quan. Ý thức là cái phản ánh thế giới khách quan, ý thức không phải là sự vật, mà chỉ là “hình ảnh” của sự vật ở trong óc người. Ý thức tồn tại phi cảm tính, đối lập với các đối tượng vật chất mà nó phản ánh luôn tồn tại cảm tính. Thế giới khách quan là nguyên bản, là tính thứ nhất. Còn ý thức chỉ là bản sao, là “hình ảnh” về thế giới đó, là tính thứ hai. Đây là căn cứ quan trọng nhất để khẳng định thế giới quan duy vật biện chứng, phê phán chủ nghĩa duy tâm và duy vật siêu hình trong quan niệm về bản chất của ý thức.\nÝ thức là hình ảnh chủ quan của thế giới khách quan. Về nội dung mà ý thức phản ánh là khách quan, còn hình thức phản ánh là chủ quan. Ý thức là cái vật chất ở bên ngoài “di chuyển” vào trong đầu óc của con người và được cải biến đi ở trong đó. Kết quả phản ánh của ý thức tùy thuộc vào nhiều yếu tố: đối tượng phản ánh, điều kiện lịch sử - xã hội, phẩm chất, năng lực, kinh nghiệm sống của chủ thể phản ánh. Cùng một đối tượng phản ánh nhưng với các chủ thể phản ánh khác nhau có đặc điểm tâm lý, tri thức, kinh nghiệm, thể chất khác nhau, trong những hoàn cảnh lịch sử khác nhau... thì kết quả phản ánh đối tượng trong ý thức cũng rất khác nhau. Ph. Ăngghen đã từng chỉ rõ tính chất biện chứng phức tạp của quá trình phản ánh: “Trên thực tế, bất kỳ phản ánh nào của hệ thống thế giới vào trong tư tưởng cũng đến bị hạn chế về mặt khách quan bởi những điều kiện lịch sử, và về mặt chủ quan bởi những đặc điểm về thể chất và tinh thần của tác giả”. Trong ý thức của chủ thể, sự phù hợp giữa tri thức và khách thể chỉ là tương đối, biểu tượng về thế giới khách quan có thể đúng đắn hoặc sai lầm, và cho dù phản ánh chính xác đến đâu thì đó cũng chỉ là sự phản ánh gần đúng, có xu hướng tiến dần đến khách thể.\nÝ thức có đặc tính tích cực, sáng tạo, gắn bó chặt chẽ với thực tiễn xã hội. Đây là một đặc tính căn bản để phân biệt trình độ phản ánh ý thức người với trình độ phản ánh tâm lý động vật. Ý thức không phải là kết quả của sự phản ánh ngẫu nhiên, đơn lẻ, thụ động thế giới khách quan. Trái lại, đó là kết quả của quá trình phản ánh có định hướng, có mục đích rõ rệt. Là hiện tượng xã hội, ý thức hình thành, phát triển gắn liền với hoạt động thực tiễn xã hội. Bằng hoạt động thực tiễn đa dạng, phong phú của mình, con người làm biến đổi thế giới và qua đó chủ động khám phá không ngừng cả bề rộng và chiều sâu của các đối tượng phản ánh.\nÝ thức phản ánh ngày càng sâu sắc, từng bước xâm nhập các tầng bản chất, quy luật, điều kiện đem lại hiệu quả hoạt động thực tiễn. Trên cơ sở đó, bằng những thao tác của tư duy trừu tượng đem lại những tri thức mới để chỉ đạo hoạt động thực tiễn, chủ động cải tạo thế giới trong hiện thực, sáng tạo ra “thiên nhiên thứ hai” in đậm dấu ấn của con người. Như vậy, sáng tạo là đặc trưng bản chất nhất của ý thức. Ý thức phản ánh hiện thực khách quan vào bộ óc người, song đây là sự phản ánh đặc biệt, gắn liền với thực tiễn sinh động cải tạo thế giới khách quan theo nhu cầu của con người.\nSự phản ánh ý thức là quá trình thống nhất của ba mặt: Một là, trao đổi thông tin giữa chủ thể và đối tượng phản ánh. Đây là quá trình mang tính hai chiều, có định hướng và chọn lọc các thông tin cần thiết. Hai là, mô hình hóa đối tượng trong tư duy dưới dạng hình ảnh tinh thần. Thực chất đây là quá trình “sáng tạo lại” hiện thực của ý thức theo nghĩa: mã hóa các đối tượng vật chất thành các ý tưởng tinh thần phi vật chất. Ba là, chuyển hóa mô hình từ tư duy ra hiện thực khách quan, tức là quá trình hiện thực hóa tư tưởng, thông qua hoạt động thực tiễn biến cái quan niệm thành cái thực tại, biến các ý tưởng phi vật chất trong tư duy thành các dạng vật chất ngoài hiện thực. Để thúc đẩy quá trình chuyển hóa này, con người cần sáng tạo đồng bộ nội dung, phương pháp, phương tiện, công cụ phù hợp để tác động vào hiện thực khách quan nhằm thực hiện mục đích của mình. Phản ánh và sáng tạo là hai mặt thuộc bản chất của ý thức.\nTừ kết quả nghiên cứu nguồn gốc và bản chất của ý thức cho thấy, ý thức là hình thức phản ánh cao nhất riêng có của óc người về hiện thực khách quan trên cơ sở thực tiễn xã hội - lịch sử.\nÝ thức không phải là cái không thể nhận thức được như chủ nghĩa duy tâm quan niệm, nhưng cũng không phải là cái tầm thường như người theo chủ nghĩa duy vật tầm thường gán cho nó. Thực chất, ý thức chỉ là thuộc tính phản ánh của một dạng vật chất đặc biệt là bộ óc người; nói cách khác, chỉ có con người mới có ý thức. Loài người xuất hiện là kết quả của lịch sử vận động, phát triển lâu dài của thế giới vật chất. Cấu trúc hoàn thiện của bộ óc người là nền tảng vật chất để ý thức hoạt động; cùng với hoạt động thực tiễn và đời sống xã hội phong phú tạo động lực mạnh mẽ thúc đẩy ý thức hình thành và không ngừng phát triển. Không có bộ óc của con người, không có hoạt động thực tiễn xã hội thì không thể có ý thức. Sáng tạo là thuộc tính đặc trưng bản chất nhất của ý thức. Sức sáng tạo của ý thức trong tinh thần và sức sáng tạo của con người trong thực tiễn khác nhau về bản chất nhưng chỉ là những biểu hiện khác nhau của năng lực sáng tạo, khẳng định sức mạnh của con người trong nhận thức và cải tạo thế giới."
  },
  {
    "title": "c) Kết cấu của ý thức",
    "level": 3,
    "body": "Để nhận thức được sâu sắc về ý thức, cần xem xét nắm vững tổ chức kết cấu của nó; tiếp cận từ các góc độ khác nhau sẽ đem lại những tri thức nhiều mặt về cấu trúc, hoặc cấp độ của ý thức.\n* Các lớp cấu trúc của ý thức\nMuốn cải tạo được sự vật, trước hết con người phải có sự hiểu biết sâu sắc về sự vật đó. Do đó, nội dung và phương thức tồn tại cơ bản của ý thức phải là tri thức. Ý thức mà không bao hàm tri thức, không dựa vào tri thức thì ý thức đó là một sự trừu tượng trống rỗng, không giúp ích gì cho con người trong hoạt động thực tiễn.\nTheo C. Mác, “Phương thức tồn tại của ý thức và của một cái gì đó đối với ý thức là tri thức... Cho nên một cái gì đó nảy sinh ra đối với ý thức, chừng nào ý thức biết cái đó”. Tri thức có nhiều lĩnh vực khác nhau như:­ tri thức về tự nhiên, xã hội, con người; và có nhiều cấp độ khác nhau như: tri thức cảm tính và tri thức lý tính; tri thức kinh nghiệm và tri thức lý luận; tri thức tiền khoa học và tri thức khoa học, v.v.. Tích cực tìm hiểu, tích lũy tri thức về thế giới xung quanh là yêu cầu thường xuyên của con người trên bước đường cải tạo thế giới. Tuy nhiên, không thể đồng nhất ý thức với sự hiểu biết, tri thức về sự vật.\nCùng với quá trình nhận thức sự vật, trong ý thức còn nảy sinh thái độ của con người đối với đối tượng phản ánh. Tình cảm là một hình thái đặc biệt của sự phản ánh tồn tại, nó phản ánh quan hệ giữa người với người và quan hệ giữa người với thế giới khách quan. Tình cảm tham gia và trở thành một trong những động lực quan trọng của hoạt động con người. Sự hòa quyện giữa tri thức với tình cảm và trải nghiệm thực tiễn đã tạo nên tính bền vững của niềm tin thôi thúc con người hoạt động vươn lên trong mọi hoàn cảnh.\nNhận thức không phải là một quá trình dễ dàng, phẳng lặng mà là một quá trình phản ánh những khó khăn, gian khổ thường gặp phải trên mỗi bước đường đi tới chân lý. Muốn vượt qua khó khăn để đạt tới mục đích, chủ thể nhận thức phải có ý chí, quyết tâm cao. Ý chí chính là những cố gắng, nỗ lực, khả năng huy động mọi tiềm năng trong mỗi con người vào hoạt động để có thể vượt qua mọi trở ngại, đạt mục đích đề ra. Nhận rõ vị trí, vai trò của các nhân tố cấu thành ý thức và mối quan hệ giữa các yếu tố đó, đòi hỏi mỗi chủ thể phải luôn tích cực học tập, rèn luyện, bồi dưỡng nâng cao tri thức, tình cảm, niềm tin, ý chí trong nhận thức và cải tạo thế giới.\n* Các cấp độ của ý thức\nKhi xem xét ý thức theo chiều sâu của thế giới nội tâm con người, cần nhận thức được các yếu tố: tự ý thức, tiềm thức, vô thức... Tất cả những yếu tố đó cùng với những yếu tố khác hợp thành ý thức, quy định tính phong phú, nhiều vẻ của đời sống tinh thần của con người.\nTự ý thức là ý thức hướng về nhận thức bản thân mình trong mối quan hệ với ý thức về thế giới bên ngoài. Đây là một thành tố rất quan trọng của ý thức, đánh dấu trình độ phát triển của ý thức. Trong quá trình phản ánh thế giới khách quan, con người cũng tự phân biệt, tách mình, đối lập mình với thế giới đó để đánh giá mình thông qua các mối quan hệ. Nhờ vậy, con người tự ý thức về bản thân mình như một thực thể hoạt động có cảm giác, đang tư duy; tự đánh giá năng lực và trình độ hiểu biết của bản thân về thế giới, cũng như các quan điểm, tư tưởng, tình cảm, nguyện vọng, hành vi, đạo đức và lợi ích của mình. Qua đó, xác định đúng vị trí, điểm mạnh, điểm yếu của mình, ý thức về mình như một cá nhân - chủ thể có ý thức đầy đủ về hành động của mình; luôn làm chủ bản thân, chủ động điều chỉnh hành vi của mình trong tác động qua lại với thế giới khách quan.\nTự ý thức không chỉ là tự ý thức của cá nhân, mà còn là tự ý thức của các nhóm xã hội khác nhau (như: một tập thể, một giai cấp, một dân tộc, thậm chí cả xã hội) về địa vị của họ trong hệ thống quan hệ sản xuất, về lợi ích và lý tưởng của mình. Chủ nghĩa duy tâm, phản động coi tự ý thức là một thực thể độc lập, tự nó, sẵn có trong cá nhân, là sự tự hướng về bản thân mình, khẳng định cái tôi, tách rời khỏi những quan hệ xã hội, trở thành cái tôi thuần túy, trừu tượng trống rỗng. Thực chất của những quan điểm đó là nhằm phủ định bản chất xã hội của ý thức, biện hộ cho chủ nghĩa cá nhân vị kỷ, cực đoan của các thế lực phản động hiện nay.\nTiềm thức là những hoạt động tâm lý diễn ra bên ngoài sự kiểm soát của ý thức. Về thực chất, tiềm thức là những tri thức mà chủ thể có từ trước gần như đã thành bản năng, kỹ năng nằm trong tầng sâu ý thức của chủ thể, là ý thức dưới dạng tiềm tàng. Do đó, tiềm thức có thể tự động gây ra các hoạt động tâm lý và nhận thức mà chủ thể không cần kiểm soát chúng một cách trực tiếp. Tiềm thức có vai trò quan trọng trong đời sống và tư duy khoa học. Tiềm thức gắn bó rất chặt chẽ với loại hình tư duy chính xác, được lặp lại nhiều lần. Khi tiềm thức hoạt động sẽ góp phần giảm bớt sự quá tải của đầu óc khi công việc lặp lại nhiều lần, mà vẫn đảm bảo độ chính xác cao và chặt chẽ cần thiết của tư duy khoa học.\nVô thức là những hiện tượng tâm lý không phải do lý trí điều khiển, nằm ngoài phạm vi của lý trí mà ý thức không kiểm soát được trong một lúc nào đó. Chúng điều khiển những hành vi thuộc về bản năng, thói quen... trong con người thông qua phản xạ không điều kiện. Con người là một thực thể xã hội có ý thức, nhưng không phải mọi hành vi của con người đều do lý trí chỉ đạo. Trong đời sống của con người, có những hành vi do bản năng chi phối hoặc do những động tác được lặp đi lặp lại nhiều lần trở thành thói quen đến mức chúng tự động xảy ra ngay cả khi không có sự điều khiển của lý trí. Vô thức là những trạng thái tâm lý ở tầng sâu điều chỉnh sự suy nghĩ, hành vi, thái độ ứng xử của con người mà chưa có sự can thiệp của lý trí.\nVô thức biểu hiện ra thành nhiều hiện tượng khác nhau như bản năng ham muốn, giấc mơ, bị thôi miên, lỡ lời, nói nhịu,... Mỗi hiện tượng vô thức có vùng hoạt động riêng, có vai trò, chức năng riêng, song tất cả đều có một chức năng chung là giải tỏa những ức chế trong hoạt động thần kinh vượt ngưỡng, nhất là những ham muốn bản năng không được phép bộc lộ ra và thực hiện trong quy tắc của đời sống cộng đồng. Nó góp phần quan trọng trong việc lập lại thế cân bằng trong hoạt động tinh thần của con người mà không dẫn tới trạng thái ức chế quá mức như ấm ức, dày vò mặc cảm, “libiđô”... Nghiên cứu những hiện tượng vô thức giúp cho con người luôn làm chủ đời sống nội tâm, có phương pháp kiềm chế đúng quy luật những trạng thái ức chế của tinh thần.\nVô thức là hoạt động tầng sâu của tâm lý - ý thức, có vai trò to lớn trong đời sống và hoạt động của con người. Trong một số hoàn cảnh, vô thức giúp cho con người giảm bớt sự căng thẳng không cần thiết của ý thức do thần kinh làm việc quá tải. Nhờ vô thức mà những chuẩn mực con người đặt ra được thực hiện một cách tự nhiên, không có sự khiên cưỡng. Vô thức có ý nghĩa quan trọng trong giáo dục thế hệ trẻ, trong hoạt động khoa học và nghệ thuật. Tuy nhiên, không nên cường điệu hóa, tuyệt đối hóa và thần bí hóa vô thức. Vô thức là vô thức trong con người xã hội có ý thức, nên vô thức không thể là hiện tượng cô lập, tách rời với ý thức và thế giới bên ngoài, càng không thể là cái quyết định ý thức cũng như hành vi của con người. Trong hoạt động của con người, ý thức vẫn giữ vai trò chủ đạo, quyết định hành vi của cá nhân. Nhờ có ý thức điều khiển, các hiện tượng vô thức được điều chỉnh, hướng tới các giá trị chân, thiện, mỹ. Vô thức chỉ là một mắt khâu trong cuộc sống có ý thức của con người.\n* Vấn đề “trí tuệ nhân tạo”\nNgày nay, khoa học và công nghệ hiện đại đã có những bước phát triển mạnh mẽ, sản xuất ra nhiều loại máy móc không những có khả năng thay thế lao động cơ bắp, mà còn có thể thay thế cho một phần lao động trí óc của con người. Chẳng hạn máy tính điện tử, “người máy thông minh”, “trí tuệ nhân tạo”. Song, điều đó không có nghĩa là máy móc cũng có ý thức như­ con người. Ý thức và máy tính điện tử là hai quá trình khác nhau về bản chất. “Người máy thông minh” thực ra chỉ là một quá trình vật lý. Hệ thống thao tác của nó đã được con người lập trình phỏng theo một số thao tác của tư duy con người. Máy móc chỉ là những kết cấu kỹ thuật do con người sáng tạo ra. Còn con người là một thực thể xã hội năng động được hình thành trong tiến trình lịch sử tiến hóa lâu dài của giới tự nhiên và thực tiễn xã hội. Máy không thể sáng tạo lại hiện thực dưới dạng tinh thần trong bản thân nó. Năng lực đó chỉ có con người có ý thức mới thực hiện được và qua đó lập trình cho máy móc thực hiện. Sự phản ánh sáng tạo, tái tạo lại hiện thực chỉ có ở ý thức của con người với tư cách là một thực thể xã hội, hoạt động cải tạo thế giới khách quan. Ý thức mang bản chất xã hội. Do vậy, dù máy móc có hiện đại đến đâu chăng nữa cũng không thể hoàn thiện được như­ bộ óc con người.\nÝ thức là hình thức phản ánh cao nhất chỉ có ở óc người về hiện thực khách quan trên cơ sở thực tiễn xã hội - lịch sử. Sự hoàn thiện trong cấu trúc vật chất của bộ óc người và hoạt động thực tiễn xã hội phong phú đã tạo ra những tiền đề vật chất đầy đủ cho đặc tính phản ánh - ý thức người phát triển, ngày càng xâm nhập vào tầng sâu của thế giới hiện thực, gắn nhận thức với cải tạo thế giới. Thực tiễn xã hội là động lực trực tiếp to lớn thúc đẩy ý thức hình thành và phát triển đáp ứng nhu cầu của xã hội ngày càng phong phú, đa dạng. Ý thức nhân đôi thế giới trong tinh thần, nhờ đó con người sáng tạo ra “giới tự nhiên thứ hai” in đậm dấu ấn của con người. Con người ngày càng sáng tạo ra các thế hệ “người máy thông minh” cao cấp hơn giúp cho con người khắc phục được nhiều mặt hạn chế của mình.\nCon người là một thực thể tự nhiên - xã hội có ý thức, chủ thể sáng tạo ra mọi giá trị vật chất và tinh thần, quyết định sự tồn tại và phát triển của xã hội. Khẳng định vai trò to lớn của ý thức trong đời sống hiện thực của con người về thực chất là khẳng định vai trò của con người - chủ thể mang ý thức đó. Cần có thái độ đúng đối với con người, quan tâm, chăm lo phát triển con người toàn diện cả về thể chất và tinh thần. Đặc biệt quan tâm bồi dưỡng thế hệ trẻ có kiến thức, nắm vững khoa học - công nghệ hiện đại, có tình cảm cách mạng trong sáng, ý chí vươn lên xây dựng đất nước giàu mạnh.\nCần nắm vững nguyên lý cơ bản của chủ nghĩa Mác - Lênin: “Ý thức [...] không bao giờ có thể là cái gì khác hơn là sự tồn tại được ý thức [...], và tồn tại của con người là quá trình đời sống hiện thực của con người” để vận dụng vào thực tiễn cách mạng Việt Nam hiện nay. Muốn ý thức xã hội chủ nghĩa thực sự giữ vai trò chủ đạo trong đời sống tinh thần nhân dân, phát huy được tính tích cực xã hội của mỗi người trong sự nghiệp xây dựng và bảo vệ Tổ quốc xã hội chủ nghĩa hiện nay cần quán triệt tốt đường lối đổi mới của Đảng, lấy đổi mới kinh tế làm trung tâm. Xây dựng nền kinh tế thị trường định hướng xã hội chủ nghĩa, tạo ra nền tảng vật chất vững chắc để xây dựng đời sống văn hóa tinh thần phong phú cho nhân dân, có giác ngộ xã hội chủ nghĩa, có văn hóa, khoa học kỹ thuật, tri thức phát triển. Xây dựng nhân tố con người thực sự là nguồn lực phát triển đất nước bền vững. Chăm lo bồi dưỡng phát triển nguồn nhân lực có chất lượng cao, phẩm chất nhân cách phát triển toàn diện; xây dựng đội ngũ cán bộ có đủ đức, đủ tài để hoàn thành xuất sắc nhiệm vụ. Để làm được điều đó, cần gắn với quá trình xây dựng mọi mặt, tạo môi trường thuận lợi cho xây dựng con người, phát huy cao nhất tính tích cực xã hội, rèn luyện bản lĩnh, nâng cao trình độ khoa học, trình độ chuyên môn cho mỗi người."
  },
  {
    "title": "3. Mối quan hệ giữa vật chất và ý thức",
    "level": 2,
    "body": "Mối quan hệ giữa vật chất và ý thức là “Vấn đề cơ bản lớn của mọi triết học, đặc biệt là của triết học hiện đại”. Tùy theo lập trường thế giới quan khác nhau, khi giải quyết mối quan hệ giữa vật chất và ý thức mà hình thành hai đường lối cơ bản trong triết học là chủ nghĩa duy vật và chủ nghĩa duy tâm. Khẳng định nguyên tắc tính đảng trong triết học, V.I. Lênin đã viết: “Triết học hiện đại cũng có tính đảng như­ triết học hai nghìn năm về trước. Những đảng phái đang đấu tranh với nhau, về thực chất, - mặc dù thực chất đó bị che giấu bằng những nhãn hiệu mới của thủ đoạn lang băm hoặc tính phi đảng ngu xuẩn - là chủ nghĩa duy vật và chủ nghĩa duy tâm”."
  },
  {
    "title": "a) Quan điểm của chủ nghĩa duy tâm và chủ nghĩa duy vật siêu hình",
    "level": 3,
    "body": "Trong lịch sử triết học, khi lý giải mối quan hệ giữa vật chất và ý thức, các nhà triết học đã phạm nhiều sai lầm chủ quan, phiến diện do không hiểu được bản chất thực sự của vật chất và ý thức. Khi nghiên cứu các tư tưởng triết học trong lịch sử, trong tác phẩm Luận c­ương về Phoiơbắc, C. Mác đã chỉ rõ hạn chế của cả chủ nghĩa duy vật trực quan và chủ nghĩa duy tâm: “sự vật, thực tại, cảm tính chỉ được nhận thức dưới hình thức khách thể, hay hình thức trực quan, chứ không được nhận thức là hoạt động cảm tính của con người, là thực tiễn, không được nhận thức về mặt chủ quan. Do đó, mặt năng động được chủ nghĩa duy tâm phát triển, đối lập với chủ nghĩa duy vật, nhưng chỉ phát triển một cách trừu tượng - dĩ nhiên, chủ nghĩa duy tâm không hiểu hoạt động hiện thực, cảm tính”.\nĐối với chủ nghĩa duy tâm, ý thức, tinh thần vốn có của con người đã bị trừu tượng hóa, tách khỏi con người hiện thực thành một lực lượng thần bí, tiên thiên. Họ coi ý thức là tồn tại duy nhất, tuyệt đối, là tính thứ nhất từ đó sinh ra tất cả; còn thế giới vật chất chỉ là bản sao, biểu hiện khác của ý thức tinh thần, là tính thứ hai, do ý thức tinh thần sinh ra. Trên thực tế, chủ nghĩa duy tâm là cơ sở lý luận của tôn giáo, chủ nghĩa ngu dân. Mọi con đường mà chủ nghĩa duy tâm mở ra đều dẫn con người đến với thần học, với “đường sáng thế”. Trong thực tiễn, người duy tâm phủ nhận tính khách quan, cường điệu vai trò của nhân tố chủ quan, duy ý chí, hành động bất chấp điều kiện, quy luật khách quan.\nChủ nghĩa duy vật siêu hình tuyệt đối hóa yếu tố vật chất, chỉ nhấn mạnh một chiều vai trò của vật chất sinh ra ý thức, quyết định ý thức, phủ nhận tính độc lập tương đối của ý thức, không thấy được tính năng động, sáng tạo, vai trò to lớn của ý thức trong hoạt động thực tiễn cải tạo hiện thực khách quan. Do vậy, họ đã phạm nhiều sai lầm có tính nguyên tắc bởi thái độ “khách quan chủ nghĩa”, thụ động, ỷ lại, trông chờ, không đem lại hiệu quả trong hoạt động thực tiễn."
  },
  {
    "title": "b) Quan điểm của chủ nghĩa duy vật biện chứng",
    "level": 3,
    "body": "Nắm vững phép biện chứng duy vật và luôn theo sát, kịp thời khái quát những thành tựu mới nhất của khoa học tự nhiên, các nhà kinh điển của chủ nghĩa Mác - Lênin đã khắc phục được những sai lầm, hạn chế của các quan niệm duy tâm, siêu hình và nêu lên những quan điểm khoa học, khái quát đúng đắn về mặt triết học trên hai lĩnh vực lớn nhất của thế giới là vật chất, ý thức và mối quan hệ giữa chúng.\nTheo quan điểm triết học Mác - Lênin, vật chất và ý thức có mối quan hệ biện chứng, trong đó vật chất quyết định ý thức, còn ý thức tác động tích cực trở lại vật chất.\n* Vật chất quyết định ý thức\nVai trò quyết định của vật chất đối với ý thức được thể hiện trên những khía cạnh sau:\nThứ nhất, vật chất quyết định nguồn gốc của ý thức.\nVật chất “sinh” ra ý thức, vì ý thức xuất hiện gắn liền với sự xuất hiện của con người cách đây từ 3 đến 7 triệu năm, mà con người là kết quả của một quá trình phát triển, tiến hóa lâu dài, phức tạp của giới tự nhiên, của thế giới vật chất. Con người do giới tự nhiên, vật chất sinh ra, cho nên lẽ tất nhiên, ý thức - một thuộc tính của bộ phận con người - cũng do giới tự nhiên, vật chất sinh ra. Các thành tựu của khoa học tự nhiên hiện đại đã chứng minh rằng, giới tự nhiên có trước con người; vật chất là cái có trước, ý thức là cái có sau; vật chất là tính thứ nhất, ý thức là tính thứ hai. Vật chất tồn tại khách quan, độc lập với ý thức và là nguồn gốc sinh ra ý thức. Bộ óc người là một dạng vật chất có tổ chức cao nhất, là cơ quan phản ánh để hình thành ý thức. Ý thức tồn tại phụ thuộc vào hoạt động thần kinh của bộ não trong quá trình phản ánh hiện thực khách quan. Sự vận động của thế giới vật chất là yếu tố quyết định sự ra đời của cái vật chất có tư duy là bộ óc người.\nThứ hai, vật chất quyết định nội dung của ý thức.\nSuy cho cùng, dưới bất kỳ hình thức nào, ý thức đều là phản ánh hiện thực khách quan. Ý thức mà trong nội dung của nó chẳng qua là kết quả của sự phản ánh hiện thực khách quan vào trong đầu óc con người. Hay nói cách khác, có thế giới hiện thực vận động, phát triển theo những quy luật khách quan của nó, được phản ánh vào ý thức mới có nội dung của ý thức.\nThế giới khách quan, trước hết và chủ yếu là hoạt động thực tiễn có tính xã hội - lịch sử của loài người, là yếu tố quyết định nội dung mà ý thức phản ánh. C. Mác và Ph. Ăngghen chỉ rõ: “Ý thức [...] không bao giờ có thể là cái gì khác hơn là sự tồn tại được ý thức [...]”. Ý thức chỉ là hình ảnh của thế giới khách quan. Sự phát triển của hoạt động thực tiễn cả về bề rộng và chiều sâu là động lực mạnh mẽ nhất quyết định tính phong phú và độ sâu sắc nội dung của tư duy, ý thức con người qua các thế hệ, qua các thời đại từ mông muội tới văn minh, hiện đại.\nThứ ba, vật chất quyết định bản chất của ý thức.\nPhản ánh và sáng tạo là hai thuộc tính không tách rời trong bản chất của ý thức. Nhưng sự phản ánh của con người không phải là “soi gương”, “chụp ảnh” hoặc là “phản ánh tâm lý” mà là phản ánh tích cực, tự giác, sáng tạo thông qua thực tiễn. Khác với chủ nghĩa duy vật cũ, xem xét thế giới vật chất như là những sự vật, hiện tượng cảm tính, chủ nghĩa duy vật biện chứng xem xét thế giới vật chất là thế giới của con người hoạt động thực tiễn. Chính thực tiễn là hoạt động vật chất có tính cải biến thế giới của con người - là cơ sở để hình thành, phát triển ý thức, trong đó ý thức của con người vừa phản ánh, vừa sáng tạo, phản ánh để sáng tạo và sáng tạo trong phản ánh.\nThứ tư, vật chất quyết định sự vận động, phát triển của ý thức.\nMọi sự tồn tại, phát triển của ý thức đều gắn liền với quá trình biến đổi của vật chất; vật chất thay đổi thì sớm hay muộn, ý thức cũng phải thay đổi theo. Con người - một sinh vật có tính xã hội ngày càng phát triển cả về thể chất lẫn tinh thần, thì dĩ nhiên ý thức - một hình thức phản ánh của óc người cũng phát triển cả về nội dung và hình thức phản ánh. Đời sống xã hội ngày càng văn minh và khoa học ngày càng phát triển đã chứng minh điều đó.\nLoài người nguyên thủy sống bầy đàn dựa vào sản vật của thiên nhiên thì tư duy của họ cũng đơn sơ, giản dị. Cùng với mỗi bước phát triển của sản xuất, tư duy, ý thức của con người cũng ngày càng mở rộng, đời sống tinh thần của con người ngày càng phong phú. Con người không chỉ ý thức được hiện tại, mà còn ý thức được cả những vấn đề trong quá khứ và dự kiến được cả trong tương lai, trên cơ sở khái quát ngày càng sâu sắc bản chất, quy luật vận động, phát triển của tự nhiên, xã hội và tư duy. Sự vận động, biến đổi không ngừng của thế giới vật chất, của thực tiễn là yếu tố quyết định sự vận động, biến đổi của tư duy, ý thức của con người. Khi sản xuất xã hội xuất hiện chế độ tư hữu, ý thức chính trị, pháp quyền cũng dần thay thế cho ý thức quần cư, cộng đồng thời nguyên thủy. Trong nền sản xuất tư bản, tính chất xã hội hóa của sản xuất phát triển là cơ sở để ý thức xã hội chủ nghĩa ra đời, đỉnh cao là sự hình thành và phát triển không ngừng lý luận khoa học của chủ nghĩa Mác - Lênin.\nTrong đời sống xã hội, vai trò quyết định của vật chất đối với ý thức được biểu hiện ở vai trò của kinh tế đối với chính trị, đời sống vật chất đối với đời sống tinh thần, tồn tại xã hội đối với ý thức xã hội. Trong xã hội, sự phát triển của kinh tế xét đến cùng quy định sự phát triển của văn hóa; đời sống vật chất thay đổi thì sớm muộn đời sống tinh thần cũng thay đổi theo.\nVật chất và ý thức là hai hiện tượng đối lập nhau về bản chất, nhưng về mặt nhận thức luận, cần quán triệt sâu sắc tư tưởng biện chứng của V.I. Lênin, rằng “sự đối lập giữa vật chất và ý thức chỉ có ý nghĩa tuyệt đối trong những phạm vi hết sức hạn chế: trong trường hợp này, chỉ giới hạn trong vấn đề nhận thức luận cơ bản là thừa nhận cái gì là cái có trước và cái gì là cái có sau? Ngoài giới hạn đó, thì không còn nghi ngờ gì nữa rằng sự đối lập đó là tương đối”. Ở đây, tính tương đối của sự đối lập giữa vật chất và ý thức thể hiện qua mối quan hệ giữa thực thể vật chất đặc biệt - bộ óc người và thuộc tính của chính nó.\n* Ý thức có tính độc lập tương đối và tác động trở lại vật chất\nĐiều này được thể hiện trên những khía cạnh sau:\nThứ nhất, tính độc lập tương đối của ý thức thể hiện ở chỗ, ý thức là sự phản ánh thế giới vật chất vào trong đầu óc con người, do vật chất sinh ra, nhưng khi đã ra đời thì ý thức có “đời sống” riêng, có quy luật vận động, phát triển riêng, không lệ thuộc một cách máy móc vào vật chất. Ý thức một khi ra đời thì có tính độc lập tương đối, tác động trở lại thế giới vật chất. Ý thức có thể thay đổi nhanh, chậm, song hành so với hiện thực, nhưng nhìn chung nó thường thay đổi chậm so với sự biến đổi của thế giới vật chất.\nThứ hai, sự tác động của ý thức đối với vật chất phải thông qua hoạt động thực tiễn của con người. Nhờ hoạt động thực tiễn, ý thức có thể làm biến đổi những điều kiện, hoàn cảnh vật chất, thậm chí còn tạo ra “thiên nhiên thứ hai” phục vụ cho cuộc sống của con người. Còn tự bản thân ý thức thì không thể biến đổi được hiện thực. Con người dựa trên những tri thức về thế giới khách quan, hiểu biết những quy luật khách quan, từ đó đề ra mục tiêu, phương hướng, biện pháp và ý chí quyết tâm để thực hiện thắng lợi mục tiêu đã xác định. Đặc biệt là ý thức tiến bộ, cách mạng một khi thâm nhập vào quần chúng nhân dân - lực lượng vật chất xã hội, thì có vai trò rất to lớn. “Vũ khí của sự phê phán cố nhiên không thể thay thế được sự phê phán của vũ khí, lực lượng vật chất chỉ có thể bị đánh đổ bằng lực lượng vật chất; nhưng lý luận cũng sẽ trở thành lực lượng vật chất, một khi nó thâm nhập vào quần chúng”.\nThứ ba, vai trò của ý thức thể hiện ở chỗ chỉ đạo hoạt động, hành động của con người; nó có thể quyết định làm cho hoạt động của con người đúng hay sai, thành công hay thất bại. Khi phản ánh đúng hiện thực, ý thức có thể dự báo, tiên đoán một cách chính xác cho hiện thực, có thể hình thành nên những lý luận định hướng đúng đắn và những lý luận này được đưa vào quần chúng sẽ góp phần động viên, cổ vũ, khai thác mọi tiềm năng sáng tạo, từ đó sức mạnh vật chất được nhân lên gấp bội. Ngược lại, ý thức có thể tác động tiêu cực khi nó phản ánh sai lạc, xuyên tạc hiện thực.\nThứ tư, xã hội càng phát triển thì vai trò của ý thức ngày càng to lớn, nhất là trong thời đại ngày nay, thời đại thông tin, kinh tế tri thức, thời đại của cuộc cách mạng khoa học và công nghệ hiện đại, khi mà tri thức khoa học đã trở thành lực lượng sản xuất trực tiếp. Trong bối cảnh toàn cầu hóa, vai trò của tri thức khoa học, của tư tưởng chính trị, tư tưởng nhân văn là hết sức quan trọng.\nTính năng động, sáng tạo của ý thức mặc dù rất to lớn, nhưng không thể vượt quá tính quy định của những tiền đề vật chất đã xác định, phải dựa vào các điều kiện khách quan và năng lực chủ quan của các chủ thể hoạt động. Nếu quên điều đó chúng ta sẽ lại rơi vào “vũng bùn” của chủ nghĩa chủ quan, duy tâm, duy ý chí, phiêu l­ưu và không tránh khỏi thất bại trong hoạt động thực tiễn.\nÝ nghĩa phương pháp luận\nTừ mối quan hệ giữa vật chất và ý thức trong triết học Mác - Lênin, rút ra nguyên tắc phương pháp luận là tôn trọng tính khách quan kết hợp với phát huy tính năng động chủ quan. Trong nhận thức và hoạt động thực tiễn, mọi chủ trương, đường lối, kế hoạch, mục tiêu đều phải xuất phát từ thực tế khách quan, từ những điều kiện, tiền đề vật chất hiện có. Phải tôn trọng và hành động theo quy luật khách quan, nếu không sẽ gây ra những hậu quả tai hại khôn lường. Nhận thức sự vật, hiện tượng phải chân thực, đúng đắn, tránh tô hồng hoặc bôi đen đối tượng, không được gán cho đối tượng cái mà nó không có. Nhìn chung, nhận thức, cải tạo sự vật, hiện tượng, phải xuất phát từ chính bản thân sự vật, hiện tượng đó với những thuộc tính, mối liên hệ bên trong vốn có của nó. Cần phải tránh chủ nghĩa chủ quan, bệnh chủ quan duy ý chí; chủ nghĩa duy vật tầm thường, chủ nghĩa thực dụng, chủ nghĩa khách quan.\nPhải phát huy tính năng động sáng tạo của ý thức, phát huy vai trò của nhân tố con người, chống tư tưởng, thái độ thụ động, ỷ lại, ngồi chờ, bảo thủ, trì trệ, thiếu tính sáng tạo; phải coi trọng vai trò của ý thức, coi trọng công tác tư tưởng và giáo dục tư tưởng, coi trọng giáo dục lý luận của chủ nghĩa Mác - Lênin và tư tưởng Hồ Chí Minh. Đồng thời, phải giáo dục và nâng cao trình độ tri thức khoa học, củng cố, bồi dưỡng nhiệt tình, ý chí cách mạng cho cán bộ, đảng viên và nhân dân nói chung, nhất là trong điều kiện nền văn minh trí tuệ, kinh tế tri thức, toàn cầu hóa hiện nay; coi trọng việc giữ gìn, rèn luyện phẩm chất đạo đức cho cán bộ, đảng viên, bảo đảm sự thống nhất giữa nhiệt tình cách mạng và tri thức khoa học.\nĐể thực hiện nguyên tắc tôn trọng tính khách quan kết hợp phát huy tính năng động chủ quan, còn phải nhận thức và giải quyết đúng đắn các quan hệ lợi ích, phải biết kết hợp hài hòa lợi ích cá nhân, lợi ích tập thể, lợi ích xã hội; phải có động cơ trong sáng, thái độ thật sự khách quan, khoa học, không vụ lợi trong nhận thức và hành động của mình."
  }
]