[
  {
    "title": "II- PHÉP BIỆN CHỨNG DUY VẬT",
    "level": 1,
    "body": "Phép biện chứng duy vật là “linh hồn sống”, là “cái quyết định” của chủ nghĩa Mác, bởi khi nghiên cứu các quy luật phát triển phổ biến của hiện thực khách quan và của nhận thức khoa học, phép biện chứng duy vật thực hiện chức năng phương pháp luận chung nhất của hoạt động nhận thức và thực tiễn. Chức năng này thể hiện ở chỗ, con người dựa vào các nguyên lý, được cụ thể hóa bằng các cặp phạm trù và quy luật cơ bản của phép biện chứng duy vật để đề ra các nguyên tắc tương ứng, định hướng hoạt động lý luận và thực tiễn của mình."
  },
  {
    "title": "1. Hai loại hình biện chứng và phép biện chứng duy vật",
    "level": 2,
    "body": ""
  },
  {
    "title": "a) Hai loại hình biện chứng",
    "level": 3,
    "body": "Biện chứng thường được hiểu theo hai nghĩa: Thứ nhất, là phạm trù dùng để chỉ những mối liên hệ qua lại lẫn nhau, sự vận động và phát triển của bản thân các sự vật, hiện tượng, quá trình tồn tại độc lập bên ngoài ý thức con người; thứ hai, là phạm trù dùng để chỉ những mối liên hệ và sự vận động, biến đổi của chính quá trình phản ánh hiện thực khách quan vào đầu óc con người. Ở nghĩa thứ hai này biện chứng trở thành quan điểm, phương pháp “... xem xét những sự vật và những phản ánh của chúng trong tư tưởng trong mối liên hệ qua lại lẫn nhau của chúng, trong sự ràng buộc, sự vận động, sự phát sinh và sự tiêu vong của chúng”, tức là thành phép biện chứng. Nó cho phép tư duy không chỉ nhìn thấy sự vật cá biệt mà còn thấy cả mối liên hệ qua lại giữa chúng, vừa thấy bộ phận vừa thấy toàn thể, không chỉ thấy cây mà còn thấy rừng.\nTheo hai nghĩa nêu trên, về thực chất biện chứng đã được chia thành biện chứng khách quan và biện chứng chủ quan (phép biện chứng). Biện chứng khách quan là khái niệm dùng để chỉ biện chứng của bản thân thế giới tồn tại khách quan, độc lập với ý thức con người. Biện chứng chủ quan chính là sự phản ánh biện chứng khách quan vào đầu óc của con người, là biện chứng của chính quá trình nhận thức, là biện chứng của tư duy phản ánh hiện thực khách quan vào bộ óc con người. Do có sự thống nhất giữa phép biện chứng, lý luận nhận thức và lôgích (biện chứng) trên cơ sở thống nhất tư duy và tồn tại, nên biện chứng chủ quan một mặt phản ánh thế giới khách quan, mặt khác phản ánh những quy luật của tư duy biện chứng.\nGiữa biện chứng khách quan và biện chứng chủ quan có mối quan hệ thống nhất với nhau, tạo nên cơ sở phương pháp luận của hoạt động cải tạo tự nhiên, cải tạo xã hội. Sự khác nhau giữa chúng được Ph. Ăngghen chỉ ra: “Biện chứng gọi là khách quan thì chi phối trong toàn bộ giới tự nhiên, còn biện chứng gọi là chủ quan, tức là tư duy biện chứng, thì chỉ là phản ánh sự chi phối..., của sự vận động thông qua những mặt đối lập..., thông qua sự đấu tranh thường xuyên... và sự chuyển hóa cuối cùng của chúng từ mặt đối lập này thành mặt đối lập kia,...”. Trong mối quan hệ này, biện chứng khách quan quy định biện chứng chủ quan, tức là bản thân sự vật, hiện tượng trong thế giới tồn tại biện chứng như thế nào thì tư duy, nhận thức của con người về chúng cũng phải phản ánh đúng như thế ấy.\nTính độc lập tương đối của biện chứng chủ quan với biện chứng khách quan được thể hiện trên thực tế: Sự vật, hiện tượng được phản ánh và nhận thức của con người về chúng không hoàn toàn trùng khít nhau, bởi quá trình tư duy, nhận thức còn phải tuân theo những quy luật mang tính mục đích và sáng tạo của con người. Do vậy, Ph. Ăngghen đòi hỏi tư duy khoa học vừa phải phân định rõ ràng, vừa phải thấy sự thống nhất giữa biện chứng khách quan và biện chứng chủ quan, “phép biện chứng đã được coi là khoa học về những quy luật phổ biến nhất của mọi vận động. Điều đó có nghĩa là những quy luật ấy phải có hiệu lực đối với vận động trong giới tự nhiên và trong lịch sử loài người cũng như đối với vận động của tư duy”."
  },
  {
    "title": "b) Khái niệm phép biện chứng duy vật",
    "level": 3,
    "body": ""
  },
  {
    "title": "C. Mác, Ph. Ăngghen và V.I. Lênin không đưa ra một định nghĩa thống nhất nào về phép biện chứng duy vật, mà trong các tác phẩm của các ông có nhiều định nghĩa khác nhau về phép biện chứng duy vật. Trong tác phẩm Chống Đuyrinh, khi bàn về các quy luật, Ph. Ăngghen định nghĩa: “phép biện chứng chẳng qua chỉ là môn khoa học về những quy luật phổ biến của sự vận động và sự phát triển của tự nhiên, của xã hội loài người và của tư duy”2. Khi chỉ ra nội dung chủ yếu của phép biện chứng, Ph. Ăngghen định nghĩa: “Phép biện chứng là khoa học về sự liên hệ phổ biến. Những quy luật chủ yếu: sự chuyển hóa lượng thành chất, - sự xâm nhập lẫn nhau của các mâu thuẫn đối cực và sự chuyển hóa từ mâu thuẫn này sang mâu thuẫn khác khi mâu thuẫn đó lên tới cực độ, - sự phát triển bằng mâu thuẫn hoặc phủ định của phủ định, - phát triển theo hình thức xoáy trôn ốc”3, “phép biện chứng đã được coi là khoa học về những quy luật phổ biến nhất của mọi vận động. Điều đó có nghĩa là những quy luật ấy phải có hiệu lực đối với vận động trong giới tự nhiên và trong lịch sử loài người cũng như đối với vận động của tư duy”.",
    "level": 1,
    "body": "Khi giới thiệu về C. Mác, V.I. Lênin định nghĩa: “... phép biện chứng, tức là học thuyết về sự phát triển, dưới hình thức hoàn bị nhất, sâu sắc nhất và không phiến diện, học thuyết về tính tương đối của nhận thức của con người, nhận thức này phản ánh vật chất luôn luôn phát triển không ngừng”. Khi bàn về các yếu tố của phép biện chứng, V.I. Lênin đưa ra định nghĩa: “Có thể định nghĩa vắn tắt phép biện chứng là học thuyết về sự thống nhất của các mặt đối lập. Như thế là nắm được hạt nhân của phép biện chứng, nhưng điều đó đòi hỏi phải có những sự giải thích và một sự phát triển thêm”. Trong văn cảnh khác liên quan đến quan điểm của Hegel về phép biện chứng, V.I. Lênin viết: “Theo nghĩa đen, phép biện chứng là sự nghiên cứu mâu thuẫn trong ngay bản chất của các đối tượng”4, “phép biện chứng chính là lý luận nhận thức (của Hêghen và) của chủ nghĩa Mác: đó là một “mặt” (không phải một “mặt” mà là thực chất)”5.\nTừ những định nghĩa trên có thể chỉ ra một số đặc điểm và vai trò của phép biện chứng duy vật. Về đặc điểm, phép biện chứng duy vật hình thành từ sự thống nhất hữu cơ giữa thế giới quan duy vật và phương pháp luận biện chứng; giữa lý luận nhận thức và lôgích biện chứng. Mỗi nguyên lý của phép biện chứng duy vật đều được xây dựng trên lập trường duy vật, mỗi luận điểm của phép biện chứng duy vật đều được rút ra từ sự vận hành của giới tự nhiên và lịch sử xã hội loài người; mỗi nguyên lý, quy luật, phạm trù của phép biện chứng đều được luận giải trên cơ sở khoa học và được chứng minh bằng toàn bộ sự phát triển của khoa học tự nhiên trước đó.\nVề vai trò, phép biện chứng duy vật đã kế thừa và phát triển phép biện chứng từ tự phát đến tự giác, tạo ra chức năng phương pháp luận chung nhất, giúp định hướng việc đề ra các nguyên tắc tương ứng trong hoạt động nhận thức và thực tiễn; là một hình thức tư duy hiệu quả quan trọng nhất đối với khoa học, bởi chỉ có nó mới có thể đem lại phương pháp giải thích những quá trình phát triển diễn ra trong thế giới, giải thích những mối quan hệ chung, những bước quá độ từ lĩnh vực này sang lĩnh vực khác.\nĐối tượng nghiên cứu của phép biện chứng duy vật là trạng thái tồn tại có tính quy luật phổ biến nhất của sự vật, hiện tượng trong thế giới. Vấn đề này thể hiện trong các câu hỏi: Sự vật, hiện tượng quanh ta và cả bản thân ta tồn tại trong trạng thái liên hệ qua lại, quy định, chuyển hóa lẫn nhau và luôn vận động, phát triển hay trong trạng thái tách rời, cô lập nhau và đứng im, không vận động, phát triển?... Để trả lời câu hỏi trên, phép biện chứng duy vật đã đưa ra nội dung gồm hai nguyên lý, sáu cặp phạm trù và ba quy luật cơ bản. Hai nguyên lý khái quát chung tính biện chứng của thế giới; các cặp phạm trù phản ánh mối liên hệ, sự tác động biện chứng phổ biến nhất giữa các mặt của sự vật, hiện tượng có tính quy luật trong từng cặp; các quy luật cơ bản nghiên cứu mối liên hệ và khuynh hướng phát triển của thế giới các sự vật, hiện tượng để chỉ ra nguồn gốc, cách thức và khuynh hướng của sự vận động, phát triển của thế giới ấy. Các quan điểm, nguyên tắc được tạo ra từ nội dung này nêu ra kết luận, các quy luật này phải có hiệu lực đối với cả ba lĩnh vực: giới tự nhiên, lịch sử loài người và tư duy con người. Các quan điểm định hướng và nguyên tắc chỉ đạo ấy tạo cho phép biện chứng duy vật khả năng thực hiện chức năng phương pháp luận chung nhất cho hoạt động nhận thức và hoạt động thực tiễn của con người.\nPhương pháp biện chứng phản ánh “tính biện chứng khách quan” của sự vận động, phát triển của thế giới. Lý luận triết học theo nguyên tắc của phương pháp đó được gọi là “phép biện chứng”. Phép biện chứng duy vật với hệ thống các nguyên lý, quy luật, phạm trù của nó được khái quát sâu sắc từ hiện thực, từ thực tiễn nên nó có khả năng phản ánh chính xác nhất sự vật, hiện tượng, các liên hệ và tư duy. Cùng với thời gian và nhu cầu giải quyết các vấn đề hiện thực, phép biện chứng có thể được phát triển cả về chiều rộng lẫn chiều sâu. Song ở bất kỳ cấp độ nào của nhận thức, nguyên lý về mối liên hệ phổ biến và về sự phát triển vẫn là những nguyên lý có trình độ khái quát và phạm vi ứng dụng phổ quát nhất. Làm sáng tỏ và phong phú thêm những quy luật thể hiện hai nguyên lý này chính là đối tượng của phép biện chứng duy vật."
  },
  {
    "title": "2. Nội dung của phép biện chứng duy vật",
    "level": 2,
    "body": ""
  },
  {
    "title": "a) Hai nguyên lý của phép biện chứng duy vật",
    "level": 3,
    "body": "Nguyên lý là thuật ngữ đa nghĩa khá bất định có nguồn gốc từ tiếng Hy Lạp cổ αρχή (tiếng Latinh là principium) với nghĩa đen là “đầu tiên nhất” - định đề, khẳng định để trên cơ sở đó các định luật và lý thuyết khoa học, các văn bản pháp luật được xây dựng, các chuẩn mực, quy tắc hoạt động trong xã hội được lựa chọn tuân theo. Như vậy, nguyên lý là những khởi điểm (điểm xuất phát đầu tiên) hay những luận điểm cơ bản nhất có tính chất tổng quát của một học thuyết chi phối sự vận hành tất cả các đối tượng thuộc lĩnh vực quan tâm nghiên cứu của nó. Theo nghĩa đó, nguyên lý triết học là những luận điểm - định đề khái quát nhất được hình thành nhờ sự quan sát, trải nghiệm của nhiều thế hệ người trong mọi lĩnh vực tự nhiên, xã hội và tư duy; rồi đến lượt mình chúng lại làm cơ sở, tiền đề cho những suy lý tiếp theo rút ra những nguyên tắc, quy luật, quy tắc, phương pháp... phục vụ cho các hoạt động nhận thức và thực tiễn của con người.\n* Nguyên lý về mối liên hệ phổ biến\n- Khái niệm\nTrong khi cùng tồn tại, các đối tượng luôn tương tác với nhau, qua đó thể hiện các thuộc tính và bộc lộ bản chất bên trong, khẳng định mình là những đối tượng thực tồn. Sự thay đổi các tương tác tất yếu làm đối tượng, các thuộc tính của nó thay đổi, và trong một số trường hợp có thể còn làm nó biến mất, chuyển hóa thành đối tượng khác. Sự tồn tại của đối tượng, sự hiện hữu các thuộc tính của nó phụ thuộc vào các tương tác giữa nó với các đối tượng khác, chứng tỏ rằng, đối tượng có liên hệ với các đối tượng khác.\n“Mối liên hệ” là một phạm trù triết học dùng để chỉ các mối ràng buộc tương hỗ, quy định và ảnh hưởng lẫn nhau giữa các yếu tố, bộ phận trong một đối tượng hoặc giữa các đối tượng với nhau. Liên hệ là quan hệ giữa hai đối tượng nếu sự thay đổi của một trong số chúng nhất định làm đối tượng kia thay đổi. Chẳng hạn, vận động của vật thể có liên hệ hữu cơ với khối lượng của nó bởi sự thay đổi vận tốc vận động tất yếu làm khối lượng của nó thay đổi; các sinh vật đều có liên hệ với môi trường bên ngoài,...\nNgược lại, cô lập (tách rời) là trạng thái của các đối tượng khi sự thay đổi của đối tượng này không ảnh hưởng đến các đối tượng khác, không làm chúng thay đổi. Chẳng hạn, sự biến đổi các nguyên tắc đạo đức không làm quỹ đạo chuyển động của trái đất thay đổi, hay những thay đổi xảy ra khi các hạt cơ bản tương tác với nhau cũng khó làm cho các nguyên tắc đạo đức thay đổi.\nĐiều này không có nghĩa là một số đối tượng luôn liên hệ, còn những đối tượng khác lại chỉ cô lập. Trong các trường hợp liên hệ xét ở trên vẫn có sự cô lập, cũng như ở các trường hợp cô lập vẫn có mối liên hệ qua lại. Mọi đối tượng đều trong trạng thái vừa cô lập vừa liên hệ với nhau. Chúng liên hệ với nhau ở một số khía cạnh và không liên hệ với nhau ở những khía cạnh khác, trong chúng có cả những biến đổi khiến các đối tượng khác thay đổi, lẫn những biến đổi không làm các đối tượng khác thay đổi. Như vậy, liên hệ và cô lập thống nhất với nhau mà ví dụ điển hình là quan hệ giữa cơ thể sống và môi trường. Cơ thể sống gắn bó với môi trường nhưng đồng thời cũng tách biệt, có tính độc lập tương đối. Một số thay đổi nhất định của môi trường làm cơ thể sống thay đổi, nhưng có những thay đổi khác lại không làm nó thay đổi. Chỉ những biến đổi môi trường gắn với hoạt động sống của cơ thể mới làm ảnh hưởng đến cơ thể; còn thay đổi nào không gắn với hoạt động đó thì không gây ra sự biến đổi. Như vậy, liên hệ và cô lập luôn tồn tại cùng nhau, là những mặt tất yếu của mọi quan hệ cụ thể giữa các đối tượng.\nTrước đây, các nhà duy tâm rút các mối liên hệ giữa các sự vật ra từ ý thức, tinh thần (Hegel cho rằng, ý niệm tuyệt đối là nền tảng của các mối liên hệ; còn Berkeley trên lập trường duy tâm chủ quan lại cho rằng, cảm giác là nền tảng của mối liên hệ giữa các đối tượng). Từ chỗ cho rằng mọi tồn tại trong thế giới đều là những mắt khâu của một thực thể vật chất duy nhất, là những trạng thái và hình thức tồn tại khác nhau của nó, phép biện chứng duy vật thừa nhận có mối liên hệ phổ biến giữa các đối tượng. Khi bàn đến mối liên hệ, con người mới chỉ chú ý đến sự ràng buộc, tác động lẫn nhau giữa các đối tượng vật chất - hữu hình, trong khi đối với thế giới tinh thần, các đối tượng không là những sự vật hữu hình mà lại vô hình như các hình thức của tư duy (khái niệm, phán đoán, suy lý) hay các phạm trù khoa học - hình thức của nhận thức cũng liên hệ chặt chẽ với nhau và liên hệ với các vật thật - nguyên mẫu hiện thực khách quan, mà các hình thức này chỉ là sự phản ánh, tái tạo lại chúng. Khi quan niệm về sự liên hệ được mở rộng đến các đối tượng tinh thần và giữa chúng vốn thuộc chủ thể với các đối tượng khách quan thì sẽ có quan niệm về mối liên hệ phổ biến. Có rất nhiều loại liên hệ, trong đó có loại liên hệ chung nhất, là đối tượng nghiên cứu của phép biện chứng, loại liên hệ này được gọi là liên hệ phổ biến. Thế giới không phải là thể hỗn loạn các đối tượng, mà là hệ thống các liên hệ đối tượng. Như vậy, chính tính thống nhất vật chất của thế giới là cơ sở cho mọi liên hệ. Nhờ sự thống nhất đó các đối tượng không thể tồn tại cô lập, mà luôn tác động qua lại, chuyển hóa lẫn nhau.\nQuan điểm siêu hình về sự tồn tại của các sự vật, hiện tượng trong thế giới thường phủ định mối liên hệ tất yếu giữa các đối tượng, được phổ biến rộng rãi trong khoa học tự nhiên rồi lan truyền sang triết học. Ở Tây Âu thế kỷ XVII - XVIII, trình độ của khoa học tự nhiên còn nhiều hạn chế, chủ yếu mới chỉ dừng lại ở việc s­ưu tập tài liệu, nghiên cứu thế giới trong sự tách rời từng bộ phận riêng lẻ. Điều này đã làm nảy sinh quan điểm siêu hình, coi các sự vật, hiện tượng tồn tại tách rời nhau, cái này bên cạnh cái kia, hết cái này đến cái kia, giữa chúng không có mối liên hệ ràng buộc quy định và chuyển hóa lẫn nhau, hoặc nếu có thì đó chỉ là mối liên hệ có tính ngẫu nhiên, bên ngoài; giới vô cơ không có mối liên hệ với giới hữu cơ, xã hội loài người chỉ là tổng số các cá thể riêng lẻ, nhận thức cảm tính và nhận thức lý tính tách rời nhau... Quan điểm này dẫn thế giới quan triết học đến sai lầm là dựng lên ranh giới giả tạo giữa các sự vật, hiện tượng, đặt đối lập các nghiên cứu khoa học chuyên ngành với nhau. Vì vậy, quan điểm siêu hình không có khả năng phát hiện ra những quy luật, bản chất và tính phổ biến của sự vận động, phát triển của các sự vật, hiện tượng trong thế giới.\nTrái lại, quan điểm biện chứng duy vật cho rằng, các sự vật, hiện tượng của thế giới tồn tại trong mối liên hệ qua lại với nhau, quy định lẫn nhau, thâm nhập, chuyển hóa lẫn nhau, không tách biệt nhau. Đó là nội dung của nguyên lý về mối liên hệ phổ biến. Cơ sở của sự tồn tại đa dạng các mối liên hệ là tính thống nhất vật chất của thế giới. Theo đó, các sự vật, hiện tượng phong phú trong thế giới chỉ là những dạng tồn tại khác nhau của một thế giới vật chất duy nhất.\n- Tính chất của mối liên hệ phổ biến\nPhép biện chứng duy vật khẳng định tính khách quan của các mối liên hệ, tác động trong thế giới. Có mối liên hệ, tác động giữa các sự vật, hiện tượng vật chất với nhau. Có mối liên hệ giữa sự vật, hiện tượng vật chất với các hiện tượng tinh thần. Có mối liên hệ giữa những hiện tượng tinh thần với nhau (mối liên hệ và tác động giữa các hình thức của nhận thức)... Các mối liên hệ, tác động đó suy đến cùng đều là sự quy định, tác động qua lại, chuyển hóa và phụ thuộc lẫn nhau giữa các sự vật, hiện tượng.\nTính phổ biến của các mối liên hệ thể hiện ở chỗ, bất kỳ ở đâu, trong tự nhiên, xã hội và tư duy đều có vô vàn các mối liên hệ đa dạng, chúng giữ những vai trò, vị trí khác nhau trong sự vận động, chuyển hóa của các sự vật, hiện tượng. Mối liên hệ qua lại, quy định, chuyển hóa lẫn nhau không những diễn ra ở mọi sự vật, hiện tượng tự nhiên, xã hội, tư duy, mà còn diễn ra giữa các mặt, các yếu tố, các quá trình của mỗi sự vật, hiện tượng.\nMối liên hệ phổ biến có tính đa dạng, phong phú. Có mối liên hệ về không gian và cũng có mối liên hệ về mặt thời gian giữa các sự vật, hiện tượng. Có mối liên hệ chung tác động lên toàn bộ hay trong những lĩnh vực rộng lớn của thế giới; có mối liên hệ riêng chỉ tác động trong từng lĩnh vực, từng sự vật và hiện tượng cụ thể. Có mối liên hệ trực tiếp giữa nhiều sự vật, hiện tượng, có mối liên hệ gián tiếp. Có mối liên hệ tất nhiên, có mối liên hệ ngẫu nhiên. Có mối liên hệ bản chất, có mối liên hệ không bản chất chỉ đóng vai trò phụ thuộc. Có mối liên hệ chủ yếu và có mối liên hệ thứ yếu... Các mối liên hệ đó giữ những vai trò khác nhau quy định sự vận động, phát triển của sự vật, hiện tượng.\nĐể phân loại các mối liên hệ phải tùy thuộc vào tính chất và vai trò của từng mối liên hệ. Tuy vậy, việc phân loại này cũng chỉ mang tính t­ương đối, bởi vì các mối liên hệ của các đối tượng rất phức tạp, không thể tách chúng khỏi tất cả các mối liên hệ khác. Mọi liên hệ còn cần được nghiên cứu cụ thể trong sự biến đổi và phát triển cụ thể của chúng.\nNhư vậy, nguyên lý về mối liên hệ phổ biến khái quát toàn cảnh thế giới trong những mối liên hệ chằng chịt giữa các sự vật, hiện tượng. Tính vô hạn của thế giới, cũng như tính vô lượng các sự vật, hiện tượng đó chỉ có thể giải thích được trong mối liên hệ phổ biến, được quy định bằng các mối liên hệ có hình thức, vai trò khác nhau.\nMỗi sự vật, hiện tượng tồn tại trong nhiều mối liên hệ, tác động qua lại với nhau; do vậy, khi nghiên cứu đối tượng cụ thể cần tuân thủ nguyên tắc toàn diện.\nTừ nội dung của nguyên lý về mối liên hệ phổ biến, phép biện chứng khái quát thành nguyên tắc toàn diện với những yêu cầu đối với chủ thể hoạt động nhận thức và thực tiễn sau: Thứ nhất, khi nghiên cứu, xem xét đối tượng cụ thể, cần đặt nó trong chỉnh thể thống nhất của tất cả các mặt, các bộ phận, các yếu tố, các thuộc tính, các mối liên hệ của chỉnh thể đó; “cần phải nhìn bao quát và nghiên cứu tất cả các mặt, tất cả các mối liên hệ và “quan hệ gián tiếp” của sự vật đó”, tức là trong chỉnh thể thống nhất của “tổng hòa những quan hệ muôn vẻ của sự vật ấy với những sự vật khác”. Thứ hai, chủ thể phải rút ra được các mặt, các mối liên hệ tất yếu của đối tượng đó và nhận thức chúng trong sự thống nhất hữu cơ nội tại, bởi chỉ có như vậy, nhận thức mới có thể phản ánh được đầy đủ sự tồn tại khách quan với nhiều thuộc tính, nhiều mối liên hệ, quan hệ và tác động qua lại của đối tượng. Thứ ba, cần xem xét đối tượng này trong mối liên hệ với đối tượng khác và với môi trường xung quanh, kể cả các mặt của các mối liên hệ trung gian, gián tiếp; trong không gian, thời gian nhất định, tức là cần nghiên cứu cả những mối liên hệ của đối tượng trong quá khứ, hiện tại và phán đoán tương lai. Thứ tư, quan điểm toàn diện đối lập với quan điểm phiến diện, một chiều, chỉ thấy mặt này mà không thấy mặt khác; hoặc chú ý đến nhiều mặt nhưng lại xem xét dàn trải, không thấy mặt bản chất của đối tượng nên dễ rơi vào thuật ngụy biện (đánh tráo các mối liên hệ cơ bản thành không cơ bản hoặc ngược lại) và chủ nghĩa chiết trung (lắp ghép vô nguyên tắc các mối liên hệ trái ngược nhau vào một mối liên hệ phổ biến).\n* Nguyên lý về sự phát triển\nPhát triển là quá trình vận động từ thấp đến cao, từ kém hoàn thiện đến hoàn thiện hơn, từ chất cũ đến chất mới ở trình độ cao hơn. Như vậy, phát triển là vận động nhưng không phải mọi vận động đều là phát triển, mà chỉ vận động nào theo khuynh hướng đi lên thì mới là phát triển. Vận động diễn ra trong không gian và thời gian, nếu thoát ly chúng thì không thể có phát triển. Do vậy, ở phương Tây trước Kant chưa có quan niệm về phát triển, vì trước đó người ta mới chỉ suy tư về không gian mà chưa đặt vấn đề suy tư sâu về thời gian. Còn ở phương Đông với văn hóa coi trọng truyền thống, mà Nho giáo là điển hình, thì quan niệm phát triển không hẳn hướng về tương lai mà thường hướng về quá khứ. Một xã hội lý tưởng không phải là xã hội sẽ có mà là đã có. Như vậy, nếu người phương Tây xem vật chất vận động trong thời gian tuyến tính, thì người phương Đông lại xem vật chất vận động trong thời gian tuần hoàn. Xét từ cách tiếp cận phương Tây thì phương Đông không có khái niệm “phát triển”, mà chỉ có khái niệm “tăng trưởng”.\nCần phân biệt hai khái niệm gắn với khái niệm phát triển là tiến hóa và tiến bộ. Tiến hóa là một dạng của phát triển, diễn ra theo cách từ từ và thường là sự biến đổi hình thức của tồn tại xã hội từ đơn giản đến phức tạp. Thuyết tiến hóa tập trung giải thích khả năng sống sót và thích ứng của cơ thể xã hội trong cuộc đấu tranh sinh tồn. Trong khi đó, khái niệm tiến bộ đề cập đến sự phát triển có giá trị tích cực. Tiến bộ là một quá trình biến đổi hướng tới cải thiện thực trạng xã hội từ chỗ chưa hoàn thiện đến hoàn thiện hơn so với thời điểm ban đầu. Trong tiến bộ, khái niệm phát triển đã được lượng hóa thành tiêu chí cụ thể để đánh giá mức độ trưởng thành của các dân tộc, các lĩnh vực của đời sống con người...\nTừ quan niệm, phát triển là sự vận động theo chiều hướng đi lên, các nhà kinh điển của chủ nghĩa Mác - Lênin đã vạch rõ, thực chất của phát triển là sự phát sinh đối tượng mới phù hợp với quy luật tiến hóa và sự diệt vong của đối tượng cũ đã trở nên lỗi thời. Đối tượng mới chỉ là cái phù hợp với khuynh hướng tiến bộ của lịch sử, có tiền đồ rộng lớn; đối tượng cũ là cái đã mất - vai trò tất yếu lịch sử, ngày càng đi vào xu hướng diệt vong. Bởi vì: Một là, xét từ mối quan hệ giữa đối tượng mới và hoàn cảnh thì đối tượng mới có kết cấu và chức năng thích ứng với điều kiện mới đã biến đổi; đối tượng cũ chỉ gồm các loại yếu tố và chức năng không còn phù hợp với hoàn cảnh đã biến đổi, xu thế diệt vong là không thể cứu vãn. Hai là, xét mối quan hệ giữa đối tượng cũ và đối tượng mới thì đối tượng mới là cái đã manh nha nảy mầm từ trong lòng đối tượng cũ, là cái phủ định những tiêu cực trong đối tượng cũ, đồng thời bảo lưu được những cái hợp lý, thích hợp với điều kiện mới và bổ sung nội dung mới chưa có ở đối tượng cũ. Hai phương diện trên là nguyên nhân có sức mạnh to lớn làm cho đối tượng mới về bản chất có thể vượt qua đối tượng cũ. Trong lĩnh vực lịch sử xã hội, đối tượng mới là kết quả của hoạt động sáng tạo theo hướng tiên tiến của xã hội; về cơ bản phù hợp với lợi ích và nhu cầu của đông đảo nhân dân, có khả năng bảo vệ được nhân dân, do vậy nó tất yếu chiến thắng đối tượng cũ. Đặc biệt, trong thời kỳ diễn ra những biến động xã hội lớn, sự chiến thắng của đối tượng mới trước đối tượng cũ biểu hiện rất rõ. Nắm vững quy luật này có ý nghĩa rất quan trọng đối với sự sáng tạo và phát triển của nước ta trong sự nghiệp đổi mới hiện nay.\nVận động tuyệt đối và đứng yên tương đối là những thuộc tính cố hữu của các đối tượng vật chất. Là sự thống nhất của biến đổi và bền vững, đối tượng không tồn tại vĩnh hằng. Những biến đổi diễn ra trong nó ở phạm vi một độ bền vững xác định có xu hướng phá vỡ sự bền vững đó và biến nó thành đối tượng khác, đến lượt mình, do những biến đổi diễn ra ở mức độ tích lũy cao hơn, nó lại biến thành đối tượng thứ ba, và cứ thế mãi khiến cho vật chất, trong khi vận động, biến đổi thường xuyên, lại chuyển hóa không ngừng từ trạng thái bền vững này sang trạng thái bền vững khác.\nMột số nhà triết học cho rằng, vận động diễn ra theo vòng tròn, luôn lặp lại những chu kỳ như cũ; số khác khẳng định rằng, trong tiến trình những biến đổi thường xuyên lại diễn ra sự vận động từ cao xuống thấp, tức là thoái bộ; một số khác lại giải thích toàn bộ những thay đổi diễn ra trong thế giới bằng sự vận động từ thấp đến cao. Thực tế thì có cả vận động từ thấp đến cao, từ cao xuống thấp và vận động theo vòng tròn. Tuy nhiên, các xu hướng đó không như nhau. Vận động từ thấp tới cao, đi lên là xu hướng hàng đầu trong số chúng; nó là thuộc tính căn bản cố hữu nội tại của vật chất. Ph. Ăngghen cho rằng, phát triển “... là mối liên hệ nhân quả của sự vận động tiến lên từ thấp đến cao thông qua tất cả những sự vận động chữ chi và những bước thụt lùi tạm thời...”.\nQuan điểm siêu hình phủ nhận sự phát triển, tuyệt đối hóa mặt ổn định của sự vật, hiện tượng. Phát triển ở đây chỉ là sự tăng lên hoặc giảm đi về mặt lượng, chỉ là sự tuần hoàn, lặp đi lặp lại mà không có sự thay đổi về chất, không có sự ra đời của sự vật, hiện tượng mới và nguồn gốc của sự “phát triển” đó nằm ngoài chúng. Phân biệt sự khác nhau cơ bản giữa quan điểm siêu hình và quan điểm biện chứng về sự phát triển, V.I. Lênin viết: “Hai quan niệm cơ bản (...) về sự phát triển (sự tiến hóa): sự phát triển coi như là giảm đi và tăng lên, như là lặp lại, và sự phát triển coi như là sự thống nhất của các mặt đối lập (sự phân đôi của cái thống nhất thành những mặt đối lập bài trừ lẫn nhau và mối quan hệ lẫn nhau giữa các mặt đối lập ấy)... Quan niệm thứ nhất là chết cứng, nghèo nàn, khô khan. Quan niệm thứ hai là sinh động... cho ta chìa khóa của “sự tự vận động” của tất thảy mọi cái đang tồn tại; chỉ có nó mới cho ta chìa khóa của những “bư­ớc nhảy vọt”, của “sự gián đoạn của tính tiệm tiến”, của sự “chuyển hóa thành mặt đối lập”, của sự tiêu diệt cái cũ và sự nảy sinh ra cái mới”.\nNhư vậy, quan điểm biện chứng đối lập với quan điểm siêu hình về sự phát triển ở chỗ: coi sự phát triển là sự vận động đi lên, là quá trình tiến lên thông qua bước nhảy; sự vật, hiện tượng cũ mất đi, sự vật, hiện tượng mới ra đời thay thế; chỉ ra nguồn gốc bên trong của sự vận động, phát triển là đấu tranh giữa các mặt đối lập bên trong sự vật, hiện tượng. Các sự vật, hiện tượng của thế giới tồn tại trong sự vận động, phát triển và chuyển hóa không ngừng. Cơ sở của sự vận động đó là sự tác động lẫn nhau giữa các sự vật, hiện tượng và mâu thuẫn giữa các mặt đối lập trong mỗi sự vật, hiện tượng. Vì thế, V.I. Lênin cho rằng, học thuyết về sự phát triển của phép biện chứng duy vật là “hoàn bị nhất, sâu sắc nhất và không phiến diện”. Do vậy, quan điểm này được xây dựng thành khoa học nhằm phát hiện ra các quy luật, bản chất và tính phổ biến của vận động, phát triển của sự vật, hiện tượng trong thế giới.\nTùy theo các lĩnh vực khác nhau mà sự vận động đó có thể là vận động từ thấp đến cao, từ đơn giản đến phức tạp và từ kém hoàn thiện đến hoàn thiện hơn. Đặc điểm chung của sự phát triển là tính tiến lên theo đường xoáy ốc, có kế thừa, d­ường như lặp lại sự vật, hiện tượng cũ nhưng trên cơ sở cao hơn. Quá trình đó diễn ra vừa dần dần, vừa có những bước nhảy vọt... làm cho sự phát triển mang tính quanh co, phức tạp, có thể có những bước thụt lùi tương đối trong sự tiến lên. Trong phép biện chứng duy vật, phát triển chỉ là một trường hợp đặc biệt của vận động, chỉ khái quát xu hướng chung của vận động là vận động đi lên của sự vật, hiện tượng mới trong quá trình thay thế sự vật, hiện tượng cũ. Tùy thuộc vào hình thức tồn tại của các tổ chức vật chất cụ thể mà “phát triển” thể hiện khác nhau.\nCũng như mối liên hệ phổ biến, phát triển có tính khách quan thể hiện ở chỗ, nguồn gốc của nó nằm trong chính bản thân sự vật, hiện tượng, chứ không phải do tác động từ bên ngoài và đặc biệt không phụ thuộc vào ý thích, ý muốn chủ quan của con người. Phát triển có tính phổ biến, sự phát triển có mặt ở khắp mọi nơi trong các lĩnh vực tự nhiên, xã hội và tư duy. Phát triển có tính kế thừa, sự vật, hiện tượng mới ra đời không thể là sự phủ định tuyệt đối, phủ định sạch trơn, đoạn tuyệt một cách siêu hình đối với sự vật, hiện tượng cũ. Sự vật, hiện tượng mới ra đời từ sự vật, hiện tượng cũ, chứ không phải ra đời từ hư vô. Vì vậy trong sự vật, hiện tượng mới còn giữ lại, có chọn lọc và cải tạo các yếu tố còn tác dụng, còn thích hợp với chúng, trong khi gạt bỏ mặt tiêu cực, lỗi thời, lạc hậu của sự vật, hiện tượng cũ đang gây cản trở sự vật, hiện tượng mới tiếp tục phát triển. Phát triển có tính đa dạng, phong phú, tuy sự phát triển diễn ra trong mọi lĩnh vực tự nhiên, xã hội và tư duy, nhưng mỗi sự vật, hiện tượng lại có quá trình phát triển không giống nhau. Tính đa dạng, phong phú của sự phát triển còn phụ thuộc vào không gian và thời gian, vào các yếu tố, điều kiện tác động lên sự phát triển đó...\nNghiên cứu nguyên lý về sự phát triển giúp nhận thức được rằng, muốn nắm được bản chất, khuynh hướng phát triển của sự vật, hiện tượng thì phải tự giác tuân thủ nguyên tắc phát triển, tránh tư tưởng bảo thủ, trì trệ. Nguyên tắc này yêu cầu: Thứ nhất, khi nghiên cứu, cần đặt đối tượng vào sự vận động, phát hiện xu hướng biến đổi của nó để không chỉ nhận thức nó ở trạng thái hiện tại, mà còn dự báo được khuynh hướng phát triển trong tương lai. Thứ hai, cần nhận thức được rằng, phát triển là quá trình trải qua nhiều giai đoạn, mỗi giai đoạn có đặc điểm, tính chất, hình thức khác nhau nên cần tìm hình thức, phương pháp tác động phù hợp để thúc đẩy hoặc kìm hãm sự phát triển đó. Thứ ba, phải sớm phát hiện và ủng hộ đối tượng mới hợp quy luật, tạo điều kiện cho nó phát triển; chống lại quan điểm bảo thủ, trì trệ, định kiến. Thứ tư, trong quá trình thay thế đối tượng cũ bằng đối tượng mới phải biết kế thừa các yếu tố tích cực từ đối tượng cũ và phát triển sáng tạo chúng trong điều kiện mới. Tóm lại, muốn nắm được bản chất, khuynh hướng phát triển của đối tượng nghiên cứu cần “phải xét sự vật trong sự phát triển, trong “sự tự vận động” (...), trong sự biến đổi của nó”."
  },
  {
    "title": "b) Các cặp phạm trù cơ bản của phép biện chứng duy vật",
    "level": 3,
    "body": "Trong quá trình nhận thức, con người thâm nhập ngày càng sâu hơn vào các đối tượng để nắm bắt và thể hiện thông qua các khái niệm những thuộc tính và mối liên hệ chung, đó là vận động, không gian, thời gian, nhân quả, tính quy luật, tất yếu, ngẫu nhiên, giống nhau, khác nhau, mâu thuẫn... Chúng là những đặc trưng của các đối tượng vật chất, là những hình thức tồn tại phổ biến của vật chất, còn các khái niệm phản ánh chúng là những phạm trù triết học.\nNhư vậy, phạm trù triết học là hình thức hoạt động trí óc phổ biến của con người, là những mô hình tư tưởng phản ánh những thuộc tính và mối liên hệ vốn có ở tất cả các đối tượng hiện thực. Phạm trù triết học giúp con người suy ngẫm những chất liệu cụ thể đã thu nhận được trong quá trình nhận thức và cải biến hiện thực, chỉ ra những đặc trưng cơ bản nhất của khách thể. Chẳng hạn, khảo sát đối tượng bằng cặp phạm trù cái chung và cái riêng, con người làm rõ sự đồng nhất và khác biệt của nó với các khách thể khác; thông qua cặp phạm trù “nhân quả” và “tất yếu”, con người nắm bắt được chuỗi quy định nhân quả, những thuộc tính và liên hệ tất nhiên, ngẫu nhiên; phân tích đối tượng đó thông qua phạm trù chất và lượng, nắm rõ được các đặc trưng tương ứng và có thể cả mối liên hệ lẫn nhau giữa chúng...\nTất cả các đối tượng đều nằm trong sự phụ thuộc và liên hệ phổ biến lẫn nhau. Do vậy, những khái niệm của con người phản ánh chúng cũng liên hệ, phụ thuộc lẫn nhau, linh động, và khi có điều kiện phù hợp đều chuyển hóa vào nhau thành mặt đối lập của mình. Chỉ có như thế chúng mới phản ánh được tính vận động của đối tượng. V.I. Lênin viết: “... những khái niệm của con người không bất động, mà luôn luôn vận động, chuyển hóa từ cái nọ sang cái kia; không như vậy, chúng không phản ánh đời sống sinh động”.\nCác phạm trù đều phản ánh các hình thức tồn tại phổ biến, các mặt và các mối liên hệ phổ biến của hiện thực khách quan. Thông qua khảo sát mối liên hệ hữu cơ và sự phụ thuộc lẫn nhau của hệ thống phạm trù phản ánh chúng sẽ nhận thấy được sự phong phú của tính quy luật biện chứng. Lần đầu tiên vấn đề phạm trù được trình bày bao quát trong triết học Hegel. Hegel cũng lấy các nguyên tắc biện chứng làm cơ sở cho hệ thống các phạm trù của mình, trình bày các phạm trù trong sự vận động, phát triển, chuyển hóa lẫn nhau, và xét chúng như là những nấc thang phát triển của ý niệm tuyệt đối. Trong hệ thống phạm trù đầy mâu thuẫn, Hegel đã tái hiện được một loạt các tính quy luật và mối liên hệ phổ biến sâu sắc.\nKhác với Hegel, các nhà kinh điển triết học Mác - Lênin xét các phạm trù như là các hình thức phản ánh phổ biến về hiện thực và như những nấc thang phát triển của nhận thức xã hội và thực tiễn. Mỗi phạm trù gắn với một thời kỳ phát triển nhận thức nhất định. Trong khi ghi nhận những thuộc tính và mối liên hệ phổ biến do nhận thức vạch ra ở một thời kỳ phát triển, các phạm trù phản ánh những đặc thù của thời kỳ đó và là những điểm tựa để con người vươn cao tiếp tục nhận thức, là những nút điểm đánh dấu bước chuyển của nhận thức từ thời kỳ phát triển này sang thời kỳ khác. V.I. Lênin viết: “Trước con người, có màng lưới những hiện tượng tự nhiên. Con người bản năng, người man rợ, không tự tách khỏi giới tự nhiên. Người có ý thức tự tách khỏi giới tự nhiên, những phạm trù là những giai đoạn của sự tách khỏi đó, tức là của sự nhận thức thế giới, chúng là những điểm nút của màng lưới, giúp ta nhận thức và nắm vững được màng lưới”.\nV.I. Lênin đúc rút sự liên hệ giữa các cặp phạm trù từ các tính quy luật của tồn tại và nhận thức, ông cho rằng trong khi phản ánh mối tương quan của các mặt và các mối liên hệ phổ biến tương ứng, tương quan giữa các cặp phạm trù cũng thể hiện cả sự vận động tất yếu của nhận thức từ thấp đến cao. Sự xuất hiện của bất kỳ phạm trù mới nào cũng đều được quy định bởi chính tiến trình phát triển của nhận thức. Nhận thức thâm nhập ngày càng sâu vào thế giới các đối tượng, vạch ra những mặt và những mối liên hệ phổ biến mới mà các cặp phạm trù cũ đã không thể bao quát được và do vậy đòi hỏi những cặp phạm trù mới để phản ánh phù hợp hơn. Khi đã xuất hiện, mọi cặp phạm trù mới đều tất yếu liên hệ với các cặp phạm trù cũ, có vị trí thích hợp trong hệ thống chung của các phạm trù được xác định bởi quá trình nhận thức đang phát triển.\nCác mối liên hệ phổ biến giữa các sự vật, hiện tượng được phép biện chứng duy vật khái quát thành các cặp phạm trù cơ bản. Tính cặp đôi của các phạm trù thể hiện sự phản ánh biện chứng tính thống nhất và đấu tranh giữa các mặt đối lập của thế giới khách quan. Các cặp phạm trù hình thành và phát triển trong hoạt động nhận thức, hoạt động cải tạo tự nhiên, cải tạo xã hội của con người. Trong phép biện chứng duy vật, các cặp phạm trù có vai trò phương pháp luận khác nhau. Các cặp phạm trù cái riêng và cái chung, tất nhiên và ngẫu nhiên, bản chất và hiện tượng là cơ sở phương pháp luận của các phương pháp: phân tích và tổng hợp, diễn dịch và quy nạp, khái quát hóa và trừu tượng hóa để nhận thức được toàn bộ các mối liên hệ theo hệ thống. Các cặp phạm trù nguyên nhân và kết quả, khả năng và hiện thực là cơ sở phương pháp luận chỉ ra các mối liên hệ và sự phát triển của các sự vật, hiện tượng như những quá trình tự nhiên. Cặp phạm trù nội dung và hình thức là cơ sở phương pháp luận nắm bắt các hình thức tồn tại hoặc biểu hiện của đối tượng trong sự phụ thuộc vào nội dung, phản ánh tính đa dạng của các phương pháp nhận thức và hoạt động thực tiễn.\nTừ điểm xuất phát là thế giới khách quan tồn tại độc lập với ý thức của con người; luôn vận động, liên hệ, chuyển hóa lẫn nhau và phát triển, phép biện chứng duy vật khẳng định, các cặp phạm trù cũng phải vận động và phát triển để phản ánh đúng và đầy đủ về những sự vật, hiện tượng. Đồng thời, để sự nhận thức về chúng ngày càng trở nên sâu sắc hơn thì phép biện chứng duy vật phải ngày càng được bổ sung thêm những cặp phạm trù mới. Như vậy, các cặp phạm trù của phép biện chứng duy vật không phải là một hệ thống nhất thành bất biến, mà phát triển cùng với sự phát triển của khoa học. Mối liên hệ giữa các cặp phạm trù của khoa học chuyên ngành với các cặp phạm trù của phép biện chứng duy vật là mối quan hệ giữa cái đơn nhất với cái chung. Khi nghiên cứu các cặp phạm trù cần đặt chúng trong các mối liên hệ với nhau và với các quy luật của phép biện chứng duy vật, bởi nếu chỉ nghiên cứu riêng các cặp phạm trù hoặc các quy luật của phép biện chứng duy vật thì chúng ta chưa thể nắm được đầy đủ các mối liên hệ bản chất của thế giới, “Quy luật nắm lấy cái gì là yên tĩnh - mà chính vì vậy mà quy luật, mọi quy luật, đều là chật hẹp, không đầy đủ, gần đúng”.\n* Cái riêng và cái chung\nCái riêng là phạm trù triết học dùng để chỉ một sự vật, hiện tượng nhất định. Cái đơn nhất là phạm trù triết học dùng để chỉ các mặt, các đặc điểm chỉ vốn có ở một sự vật, hiện tượng (một cái riêng) nào đó mà không lặp lại ở sự vật, hiện tượng nào khác. Cái chung là phạm trù triết học dùng để chỉ những mặt, những thuộc tính không những có ở một sự vật, hiện tượng nào đó, mà còn lặp lại trong nhiều sự vật, hiện tượng (nhiều cái riêng) khác.\nTrong lịch sử triết học có hai xu hướng là duy thực và duy danh đối lập nhau giải quyết vấn đề quan hệ giữa cái riêng và cái chung. Các nhà duy thực khẳng định, cái chung tồn tại độc lập, không phụ thuộc vào cái riêng. Có hai luận giải: Theo luận giải thứ nhất (khá phổ biến) thì cái chung mang tính tư tưởng, tinh thần, tồn tại dưới dạng các khái niệm chung; theo cách lý giải thứ hai thì cái chung mang tính vật chất, tồn tại dưới dạng một khối không đổi, bao trùm tất cả, tự trùng với mình hoặc dưới dạng nhóm các đối tượng... Còn cái riêng, hoặc hoàn toàn không có (do xuất phát từ Plato vốn coi các sự vật cảm tính là không thực, chỉ là cái bóng của những ý niệm), hoặc tồn tại phụ thuộc vào cái chung; là cái thứ yếu, tạm thời, do cái chung sinh ra.\nCác nhà duy danh cho rằng, cái chung không tồn tại thực trong hiện thực khách quan, chỉ có sự vật đơn lẻ, cái riêng mới tồn tại thực, chỉ tồn tại trong tư duy con người, chỉ là tên gọi của các đối tượng đơn lẻ. Tuy cùng coi cái riêng là duy nhất có thực, song các nhà duy danh giải quyết khác nhau vấn đề hình thức tồn tại của nó. Một số người (như Occam) cho rằng, cái riêng tồn tại như đối tượng vật chất cảm tính; số khác (như Berkeley) lại coi cảm giác là hình thức tồn tại của cái riêng...\nChủ nghĩa duy vật biện chứng đã khắc phục những khiếm khuyết của cả hai xu hướng đó trong việc lý giải mối quan hệ giữa cái chung và cái riêng. Cả cái chung lẫn cái đơn nhất đều không tồn tại độc lập, tự thân, vì chúng là thuộc tính nên phải gắn với đối tượng xác định; chỉ cái riêng (đối tượng, quá trình, hiện tượng riêng) mới tồn tại độc lập. Còn cái chung và cái đơn nhất đều chỉ tồn tại trong cái riêng, như là các mặt của cái riêng.\nCái chung không tồn tại độc lập, mà là một mặt của cái riêng và liên hệ không tách rời với cái đơn nhất, như cái đơn nhất liên hệ chặt chẽ với cái chung. “Bất cứ cái chung nào cũng chỉ bao quát một cách đại khái tất cả mọi vật riêng lẻ. Bất cứ cái riêng nào cũng không gia nhập đầy đủ vào cái chung...”. Cái riêng không vĩnh cửu mà xuất hiện, tồn tại một thời gian xác định rồi biến thành cái riêng khác, rồi lại thành cái riêng khác nữa... cứ thế đến vô cùng. V.I. Lênin viết: “Bất cứ cái riêng nào cũng thông qua hàng nghìn sự chuyển hóa mà liên hệ với những cái riêng thuộc loại khác (sự vật, hiện tượng, quá trình)”2. Cái riêng “chỉ tồn tại trong mối liên hệ đưa đến cái chung”3 và có khả năng chuyển hóa ở những điều kiện phù hợp thành cái riêng bất kỳ khác.\nMọi cái riêng đều là sự thống nhất của các mặt đối lập, vừa là cái đơn nhất vừa là cái chung. Thông qua những thuộc tính, những đặc điểm không lặp lại của mình, cái riêng thể hiện là cái đơn nhất; nhưng thông qua những thuộc tính lặp lại ở các đối tượng khác - lại thể hiện là cái chung. Trong khi là những mặt của cái riêng, cái đơn nhất và cái chung không đơn giản tồn tại trong cái riêng, mà gắn bó hữu cơ với nhau và trong những điều kiện xác định chuyển hóa vào nhau.\nMối liên hệ giữa cái đơn nhất với cái chung thể hiện trước hết ở mối liên hệ lẫn nhau trong một thể thống nhất gồm các mặt, các yếu tố đơn lẻ vốn có trong một sự vật, hiện tượng này và các mặt, các yếu tố được lặp lại ở nó và trong các sự vật, hiện tượng khác. Mối liên hệ giữa cái chung với cái riêng biểu hiện ở mối liên hệ lẫn nhau giữa các thuộc tính (hay các bộ phận) cùng có ở nhiều đối tượng với từng đối tượng đó được xét như cái toàn bộ. Như vậy, cái riêng là cái toàn bộ, cái chung chỉ là bộ phận, bởi bên cạnh cái chung thì bất cứ đối tượng (cái riêng) nào cũng còn có cái đơn nhất, tức là bên cạnh những mặt được lặp lại còn có những mặt không lặp lại, những mặt cá biệt; vì vậy, bất cứ sự vật, hiện tượng riêng lẻ nào cũng là sự thống nhất giữa các mặt đối lập đó. Trong cùng một lúc, sự vật, hiện tượng đó vừa là cái đơn nhất, vừa là cái chung; thông qua các đặc điểm cá biệt, các mặt không lặp lại của mình, sự vật, hiện tượng (cái riêng) đó biểu hiện là cái đơn nhất, nhưng thông qua các mặt lặp lại trong các sự vật, hiện tượng khác, nó biểu hiện là cái chung.\nÝ nghĩa phương pháp luận\nThứ nhất, nếu bất cứ cái chung nào cũng chỉ tồn tại trong cái riêng, như một thuộc tính chung của một số cái riêng, nằm trong mối liên hệ chặt chẽ với cái đơn nhất và mối liên hệ đó đem lại cho cái chung một hình thức riêng biệt, thì các phương pháp thực tiễn dựa trên việc vận dụng một quy luật chung nào đó đều không thể như nhau đối với mọi sự vật, hiện tượng (cái riêng) có liên hệ với cái chung đó. Vì bản thân cái chung trong mọi sự vật, hiện tượng không phải là một và không giống nhau hoàn toàn, mà chỉ là biểu hiện của cái chung đã được cá biệt hóa, thì các phương pháp xuất phát từ cái chung đó, trong mỗi trường hợp cụ thể, cần phải thay đổi hình thức, phải cá biệt hóa cho phù hợp với đặc điểm của từng trường hợp.\nThứ hai, nếu bất kỳ một phương pháp nào cũng bao hàm cả cái chung lẫn cái đơn nhất thì khi sử dụng một kinh nghiệm nào đó trong điều kiện khác không nên sử dụng hình thức hiện có của nó, mà chỉ nên rút ra những mặt chung đối với trường hợp đó, chỉ rút ra những cái thích hợp với điều kiện nhất định đó.\nThứ ba, trong quá trình phát triển của sự vật, trong những điều kiện nhất định “cái đơn nhất” có thể biến thành “cái chung” và ngược lại “cái chung” có thể biến thành “cái đơn nhất”, nên trong hoạt động thực tiễn có thể và cần phải tạo điều kiện thuận lợi để “cái đơn nhất” có lợi cho con người trở thành “cái chung” và “cái chung” bất lợi trở thành “cái đơn nhất”. Tuy nhiên, vẫn còn một khó khăn trong tư duy mà nhiều người biết nhưng thường lảng tránh tìm hiểu, giải đáp thấu đáo, đó là: Cái riêng và cái chung không nằm trên cùng một mặt bằng cơ sở, không cùng một đơn vị đo. Cái riêng là đối tượng, còn cái chung và cái đơn nhất chỉ là các thuộc tính của nhiều (hoặc một) cái riêng đó, cho nên phép biện chứng đích thực phải đẩy chúng lên thành cặp phạm trù cái đặc thù và cái phổ biến.\nCái đặc thù và cái phổ biến. Cái chung trong tương quan với cái đơn nhất được hiểu như trên chỉ là cái chung hình thức, cái phổ biến trừu tượng, có rất ít ý nghĩa đối với nhận thức; trong khi tư duy nhận thức yêu cầu phải đạt đến trình độ hiểu cái chung biện chứng, cái phổ biến cụ thể, đúng như V.I. Lênin đòi hỏi: ““Không phải chỉ là cái phổ biến trừu tượng, mà là cái phổ biến bao hàm cả sự phong phú của cái đặc thù, cái cá thể, cái cá biệt” (tất cả sự phong phú của cái đặc thù và cái cá biệt!)”. Để làm rõ cái đơn nhất thì cần phải so sánh đối tượng được xét với tất cả các đối tượng khác, nhưng thực tế không thể làm được điều đó. Vì thế người ta thường chỉ so sánh một đối tượng với một số xác định các đối tượng. Do đó cái chung đối lập không hẳn ngay với cái đơn nhất, mà với cái vừa ít chung hơn, vừa ít đơn nhất hơn, tức là với cái đặc thù. Việc so sánh thuộc tính của một đối tượng với thuộc tính của tất cả đối tượng sẽ giúp chúng ta hình dung về cái đơn nhất, nhưng nếu so sánh thuộc tính của một số đối tượng với thuộc tính của tất cả, sẽ cho hình dung về cái đặc thù. Như vậy, cái đặc thù chỉ ra sự khác biệt cùng có ở một số cái riêng với cái chung vốn có ở tất cả cái riêng.\nDựa vào những thuộc tính và mối liên hệ vốn có ở tất cả các đối tượng, hoặc ở tất cả các giai đoạn, trạng thái vận động khác nhau của cùng một đối tượng, thì không thể phân biệt chúng với nhau. Những thứ đó không thể là cái đặc thù, mà phải là cái chung làm cơ sở cho sự tồn tại bền vững của mọi đối tượng, hoặc gắn kết các giai đoạn, trạng thái vận động khác nhau của đối tượng về một cội nguồn. Kiểu cái chung này được gọi là cái phổ biến biểu thị sự giống nhau, sự đồng nhất sâu trong cơ sở, bản chất và các tính quy luật của lớp đối tượng hoặc của một đối tượng ở các giai đoạn phát triển khác nhau, vì thế V.I. Lênin đã cho rằng cái phổ biến mới là phạm trù cùng cấp độ với “bản chất”, “quy luật” và có thể dùng chúng thay thế lẫn nhau. Cả Hegel và C. Mác đều dùng cái phổ biến như phạm trù liên quan đến sự sinh thành và phát triển qua các giai đoạn khác nhau của cùng một đối tượng. Ở từng giai đoạn phát triển của đối tượng, cái phổ biến (bản chất, quy luật) đều biểu hiện như cái đặc thù. Trong nhận thức các hiện tượng xã hội, việc chỉ ra cái phổ biến tương đối dễ hơn so với việc nhận diện cái đặc thù chỉ biểu hiện ở từng giai đoạn phát triển xác định của đối tượng.\nNhư vậy, có thể khẳng định mọi cái phổ biến đều là cái chung theo nghĩa hình thức, tức là chúng đều bao gồm những cái như nhau ở mọi đối tượng, giai đoạn vận động của chúng. Nhưng không phải mọi cái chung đều là cái phổ biến, bởi cái chung chỉ những thuộc tính cùng có ở tất cả đối tượng, nhưng các thuộc tính đó mới chỉ là bề ngoài, hình thức, chưa phải là những yếu tố cấu thành bản chất, nội dung và quy luật của các đối tượng, mà cái phổ biến phải là cái chung trong bản chất, quy luật của đối tượng.\nNếu nhìn vào biện chứng của cái phổ biến và cái đặc thù từ sự vận động thấp đến cao của vật chất thì sẽ thấy rằng, ở đây chúng gắn bó đã không đơn giản với các mặt khác nhau của đối tượng, mà với các hình thức vận động khác nhau của vật chất đang diễn ra trong nó và tương quan với nhau như là các bậc thấp và cao. Mỗi bậc vận động cao của vật chất bao hàm trong mình bậc thấp hơn và do vậy có nhiều cái chung với nó. Nhưng tính chung đó là khác so với tính chung trong phạm vi một hình thức vận động của vật chất, trong khuôn khổ của cùng một giai đoạn phát triển. Tính chung đó bị khúc xạ thông qua đặc thù của các bậc vận động cao và chỉ có thể được hiểu như là mắt khâu gắn kết cái thấp với cái cao, như là thời đoạn đã được cải biến trong nội dung của cái cao nhất. Như vậy, ở giai đoạn phát triển thấp, cái phổ biến chỉ bao quát những yếu tố nội dung mà cách này hay cách khác được bảo tồn và có mặt trong nội dung của đối tượng ở bậc phát triển cao hơn dưới dạng được cải biến. Còn ở bậc phát triển cao, thì cái phổ biến đó chỉ bao quát cái làm cho đối tượng giống với những đối tượng ở những bậc phát triển thấp hơn.\nKhác hơn một chút là mối liên hệ giữa cái chung và cái đặc thù trong những đối tượng ở cùng một giai đoạn phát triển. Ở đây cái chung đúng là bản chất, là cơ sở để cùng chuyển sang giai đoạn phát triển mới. Do vậy ở trường hợp này dùng thuật ngữ “cái phổ biến” thích hợp và đúng hơn “cái chung”. Còn liên quan đến cái đặc thù thuộc về cùng một giai đoạn phát triển, thì ở đây nó không đụng chạm đến bản chất, mà chỉ là hình thức biểu hiện, phương thức tồn tại riêng.\n* Nguyên nhân và kết quả\nNhận thức về sự tác động, tương tác giữa các mặt, các yếu tố hoặc giữa các sự vật, hiện tượng với nhau như là nguyên nhân cuối cùng dẫn đến sự xuất hiện của các mặt, các yếu tố, các sự vật, hiện tượng mới về chất, chính là khâu quyết định dẫn đến việc phát hiện ra tính nhân quả như là yếu tố quan trọng của mối liên hệ phổ biến.\nNguyên nhân là phạm trù chỉ sự tương tác lẫn nhau giữa các mặt trong một sự vật, hiện tượng hoặc giữa các sự vật, hiện tượng với nhau gây nên những biến đổi nhất định. Kết quả là phạm trù chỉ những biến đổi xuất hiện do sự tương tác giữa các yếu tố mang tính nguyên nhân gây nên.\nNhận thức về nguyên nhân, kết quả như trên vừa giúp khắc phục được hạn chế coi nguyên nhân của mỗi sự vật, hiện tượng, trong những điều kiện nhất định, nằm bên ngoài sự vật, hiện tượng đó; vừa khắc phục được thiếu sót coi nguyên nhân cuối cùng của sự vận động, chuyển hóa của toàn bộ thế giới vật chất nằm ngoài nó, trong lực lượng phi vật chất nào đó.\nMối liên hệ nhân quả có tính khách quan, phổ biến và tất yếu. Phê phán quan niệm sai lầm của triết học duy tâm về tính chất của mối liên hệ nhân quả, Ph. Ăngghen nhấn mạnh: “hoạt động của con người là hòn đá thử vàng của tính nhân quả”. Trên thực tế, con người không chỉ quan sát thấy hiện tượng này sau hiện tượng kia, mà còn có thể tự mình gây ra hiện tượng, quá trình nhất định trong thực nghiệm khoa học, giống như hiện tượng, quá trình ấy xảy ra trong tự nhiên. Từ quan niệm cho rằng, mọi sự vật, hiện tượng trong tự nhiên, xã hội và tư duy đều được gây nên bởi những nguyên nhân nhất định, trong đó có cả những nguyên nhân chưa được nhận thức, phép biện chứng duy vật rút ra nguyên tắc quyết định luận hết sức quan trọng của nhận thức khoa học. Từ quan niệm kết quả do nguyên nhân sinh ra còn phụ thuộc vào những điều kiện, hoàn cảnh nhất định, phép biện chứng duy vật cho rằng, một nguyên nhân nhất định trong hoàn cảnh nhất định chỉ có thể gây ra một kết quả nhất định; bởi vậy, nếu các nguyên nhân càng ít khác nhau bao nhiêu, thì các kết quả do chúng gây ra cũng ít khác nhau bấy nhiêu.\nQuan niệm duy vật biện chứng về mối quan hệ nhân quả không cứng nhắc, tĩnh tại. Trong quá trình vận động, phát triển, nguyên nhân có thể chuyển hóa thành kết quả. Cái mà ở thời điểm hoặc trong mối quan hệ này là nguyên nhân thì ở thời điểm hoặc trong mối quan hệ khác lại là kết quả; còn kết quả lại trở thành nguyên nhân, nhưng đã ở trong các quan hệ khác, thành nguyên nhân loại khác: nguyên nhân sinh ra kết quả, kết quả cũng tác động lại nguyên nhân - chúng cũng nằm trong sự tương tác biện chứng. Trong khi là hiện tượng tích cực, nguyên nhân tác động lên hiện tượng khác thụ động và gây ra trong nó những biến đổi - tức là kết quả, nhưng kết quả cũng thể hiện sự phản tác động và từ hiện tượng thụ động chuyển thành tích cực. Kết quả không thể là nguyên nhân của chính nguyên nhân gây ra nó. Nhưng nếu bất cứ sự vật, hiện tượng nào cũng có nguyên nhân của nó thì cũng không có nghĩa là mỗi sự vật, hiện tượng chỉ do một nguyên nhân sinh ra. Trên thực tế, một kết quả có thể do nhiều nguyên nhân sinh ra, do vậy sự phân loại nguyên nhân thành nguyên nhân chủ yếu, nguyên nhân thứ yếu, nguyên nhân bên trong, nguyên nhân bên ngoài... đối với một kết quả vừa mang ý nghĩa lý luận, vừa mang ý nghĩa thực tiễn sâu sắc.\nÝ nghĩa phương pháp luận\nThứ nhất, nếu bất kỳ sự vật, hiện tượng nào cũng có nguyên nhân và do nguyên nhân quyết định, thì để nhận thức được sự vật, hiện tượng ấy nhất thiết phải tìm ra nguyên nhân xuất hiện; muốn loại bỏ một sự vật, hiện tượng nào đó không cần thiết, thì phải loại bỏ nguyên nhân sinh ra nó.\nThứ hai, xét về mặt thời gian, nguyên nhân có trước kết quả nên khi tìm nguyên nhân của một sự vật, hiện tượng cần tìm ở các sự vật, hiện tượng mối liên hệ đã xảy ra trước khi sự vật, hiện tượng xuất hiện. Trong thời gian hoặc trong mối quan hệ nào đó, vì nguyên nhân và kết quả có thể đổi chỗ cho nhau, chuyển hóa lẫn nhau nên để nhận thức được tác dụng của một sự vật, hiện tượng và để xác định phương hướng đúng cho hoạt động thực tiễn cần nghiên cứu sự vật, hiện tượng đó trong mối quan hệ mà nó giữ vai trò là kết quả, cũng như trong mối quan hệ mà nó giữ vai trò là nguyên nhân, sản sinh ra những kết quả nhất định.\nThứ ba, một sự vật, hiện tượng có thể do nhiều nguyên nhân sinh ra và quyết định, nên khi nghiên cứu sự vật, hiện tượng đó không vội kết luận về nguyên nhân nào đã sinh ra nó; khi muốn gây ra một sự vật, hiện tượng có ích trong thực tiễn cần phải lựa chọn phương pháp thích hợp nhất với điều kiện, hoàn cảnh cụ thể chứ không nên rập khuôn theo phương pháp cũ. Trong số các nguyên nhân sinh ra một sự vật, hiện tượng có nguyên nhân chủ yếu và nguyên nhân thứ yếu, nguyên nhân bên trong và nguyên nhân bên ngoài, nên trong nhận thức và hành động cần dựa vào nguyên nhân chủ yếu và nguyên nhân bên trong.\n* Tất nhiên và ngẫu nhiên\nCác mối liên hệ giữa các sự vật, hiện tượng hay giữa các bộ phận trong chúng xuất hiện không giống nhau. Có mối liên hệ do bản chất của sự vật, hiện tượng quy định, từ đó sinh ra phạm trù tất nhiên. Có mối liên hệ do sự gặp nhau của những điều kiện, hoàn cảnh bên ngoài quyết định, vì vậy chúng có thể xuất hiện mà cũng có thể không xuất hiện, từ đó sinh ra phạm trù ngẫu nhiên. Do đó, khi phản ánh hiện thực khách quan, con người nhận thức được tính không một nghĩa, không ngang giá trị của các mối liên hệ khác nhau vốn có ở sự vật, hiện tượng nên phân loại chúng thành nhóm các mối liên hệ nhất định phải xảy ra như thế (tất nhiên) và nhóm các mối liên hệ có thể xảy ra, có thể không xảy ra, xảy ra thế này hay xảy ra thế khác (ngẫu nhiên).\nTất nhiên là phạm trù chỉ mối liên hệ bản chất, do nguyên nhân cơ bản bên trong sự vật, hiện tượng quy định và trong điều kiện nhất định phải xảy ra đúng như thế chứ không thể khác. Ngẫu nhiên là phạm trù chỉ mối liên hệ không bản chất, do nguyên nhân, hoàn cảnh bên ngoài quy định nên có thể xuất hiện, có thể không xuất hiện; có thể xuất hiện thế này hoặc có thể xuất hiện thế khác.\nTất nhiên và ngẫu nhiên đều tồn tại khách quan trong sự thống nhất hữu cơ thể hiện ở chỗ, tất nhiên bao giờ cũng vạch đường đi cho mình thông qua vô số ngẫu nhiên; còn ngẫu nhiên là hình thức biểu hiện của tất nhiên, bổ sung cho tất nhiên. Tất nhiên và ngẫu nhiên đều có vai trò nhất định trong quá trình phát triển của sự vật, hiện tượng; nhưng tất nhiên đóng vai trò chi phối sự phát triển, còn ngẫu nhiên có thể làm cho sự phát triển ấy diễn ra nhanh hay chậm. Tuy mỗi sự vật, hiện tượng đều có tất nhiên và ngẫu nhiên, nhưng trong quá trình vận động và phát triển, thông qua mối liên hệ này thì đó là ngẫu nhiên, còn thông qua những mối liên hệ khác thì đó là tất nhiên và trong những điều kiện nhất định, chúng chuyển hóa lẫn nhau. Ph. Ăngghen viết: “cái mà người ta quả quyết cho là tất yếu lại hoàn toàn do những ngẫu nhiên thuần túy cấu thành, và cái được coi là ngẫu nhiên, lại là hình thức, dưới đó ẩn nấp cái tất yếu”, do vậy ranh giới giữa tất nhiên và ngẫu nhiên chỉ có tính tương đối, từ đó cần tránh quan niệm cứng nhắc về tất nhiên, ngẫu nhiên khi nghiên cứu sự vật, hiện tượng. Tất nhiên có mối liên hệ với cái chung, nhưng cái chung không phải lúc nào cũng là tất nhiên, bởi cái chung có thể thể hiện vừa trong hình thức của tất nhiên vừa trong hình thức của ngẫu nhiên.\nÝ nghĩa phương pháp luận\nThứ nhất, tất nhiên nhất định phải xảy ra đúng như thế nên trong hoạt động thực tiễn cần dựa vào tất nhiên chứ không thể dựa vào ngẫu nhiên và như vậy, nhiệm vụ của khoa học là tìm cho được mối liên hệ tất nhiên của hiện thực khách quan.\nThứ hai, tất nhiên không tồn tại dưới dạng thuần túy nên trong hoạt động nhận thức chỉ có thể chỉ ra được tất nhiên bằng cách nghiên cứu những ngẫu nhiên mà tất nhiên phải đi qua.\nThứ ba, ngẫu nhiên có ảnh hưởng đến nhịp độ phát triển, thậm chí còn có thể làm cho tiến trình phát triển của sự vật, hiện tượng đột ngột biến đổi; do vậy, không nên bỏ qua ngẫu nhiên mà phải có những phương án dự phòng trường hợp các sự cố ngẫu nhiên xuất hiện bất ngờ.\nThứ tư, ranh giới giữa tất nhiên với ngẫu nhiên chỉ là tương đối nên sau khi nhận thức được các điều kiện có thể tạo ra sự chuyển hóa trên, có thể tạo ra điều kiện thuận lợi để “biến” ngẫu nhiên phù hợp với thực tiễn thành tất nhiên và tất nhiên không phù hợp thực tiễn thành ngẫu nhiên.\n* Nội dung và hình thức\nViệc nhận thức nội dung và hình thức sự vật, hiện tượng và sự hình thành các khái niệm về chúng được thực hiện trong quá trình nhận thức từ những mối liên hệ nhân quả này sang mối liên hệ nhân quả khác, từ những đặc tính này sang những đặc tính khác của sự vật, hiện tượng ấy.\nNội dung là phạm trù chỉ tổng thể tất cả các mặt, yếu tố tạo nên sự vật, hiện tượng. Hình thức là phạm trù chỉ phương thức tồn tại, biểu hiện và phát triển của sự vật, hiện tượng ấy; là hệ thống các mối liên hệ tương đối bền vững giữa các yếu tố cấu thành nội dung của sự vật, hiện tượng và không chỉ là cái biểu hiện ra bên ngoài, mà còn là cái thể hiện cấu trúc bên trong của sự vật, hiện tượng. Nhiều khi con người rất khó khăn trong việc nhận thức rành mạch nội dung của một đối tượng nào đó (nhất là đối tượng tinh thần), mà thường lẫn với cấu trúc của nó. Trong trường hợp này rõ ràng có sự giao thoa, thâm nhập lẫn nhau giữa nội dung và hình thức, và hình thức khi đó được gọi là hình thức nội dung (hình thức bên trong), “... gắn liền chặt chẽ với nội dung”. Kiểu hình thức này thường thuộc về cái riêng xác định, không lặp lại ở cái riêng khác, nên nó là cái đơn nhất. Nhưng cũng có những hình thức chung cho nhiều cái riêng của cùng một lớp, chúng được gọi là hình thức hình thức (hình thức bên ngoài, hình thức chung), nên nó cũng gọi là cái chung. Mặt khác khi xác định nội dung của đối tượng, nhận thức trả lời cho câu hỏi “đối tượng là gì”, nhưng khi trả lời cho câu hỏi “đối tượng là như thế nào”, tức là phải xác định hình thức tồn tại hay hình thức biểu hiện của nó.\nNội dung và hình thức của sự vật, hiện tượng tồn tại thống nhất chặt chẽ trong mối liên hệ phụ thuộc lẫn nhau, nhưng nội dung giữ vai trò quyết định. Hình thức xuất hiện trong sự quy định của nội dung và sau khi xuất hiện, hình thức tồn tại tương đối độc lập và có ảnh hưởng tới nội dung, gây ra các hệ quả nhất định. Khi hình thức phù hợp với nội dung, nó là động cơ thúc đẩy nội dung phát triển, còn khi không phù hợp, hình thức cản trở sự phát triển đó của nội dung. Cùng một nội dung, trong quá trình phát triển, có thể thể hiện dưới nhiều hình thức và ngược lại, cùng một hình thức có thể biểu hiện cho một số nội dung khác nhau. Sự vật, hiện tượng phát triển thông qua sự đổi mới không ngừng của nội dung và sự thay đổi theo chu kỳ của hình thức. Lúc đầu, sự biến đổi diễn ra trong nội dung chưa ảnh hưởng đến hình thức, nhưng khi sự biến đổi đó tiếp tục diễn ra tới giới hạn nhất định, nội dung mới xuất hiện thì hình thức ban đầu trở nên chật hẹp, kìm hãm sự phát triển của nội dung. Nội dung mới phá bỏ hình thức cũ và trong vỏ bao bọc của hình thức mới đó, thì nội dung mới sẽ tiếp tục phát triển. Ở đây có sự tác động của quy luật phổ biến (theo nghĩa tác động ở mọi đối tượng, mọi lĩnh vực vật chất và tinh thần) về sự phù hợp (tương thích) của hình thức với nội dung. Ngoài ba quy luật biện chứng sẽ được phân tích riêng dưới đây, thì quy luật phù hợp của hình thức với nội dung này là quy luật được phát biểu riêng cho một trong các cặp phạm trù của phép biện chứng.\nÝ nghĩa phương pháp luận\nThứ nhất, hình thức của sự vật, hiện tượng do nội dung của nó quyết định, là kết quả những thay đổi của nội dung và để đáp ứng những thay đổi đó thì sự thay đổi hình thức phải dựa vào những thay đổi thích hợp của nội dung quyết định nó; do vậy, muốn biến đổi sự vật, hiện tượng thì trước hết phải tác động, làm thay đổi nội dung của nó.\nThứ hai, hình thức chỉ thúc đẩy nội dung phát triển khi nó phù hợp với nội dung nên để thúc đẩy sự vật, hiện tượng phát triển nhanh, cần chú ý theo dõi mối quan hệ giữa nội dung đang phát triển với hình thức ít thay đổi, và khi giữa nội dung với hình thức xuất hiện sự không phù hợp thì trong những điều kiện nhất định phải can thiệp vào tiến trình khách quan, đem lại sự thay đổi cần thiết về hình thức để nó trở nên phù hợp với nội dung đã phát triển và bảo đảm cho nội dung phát triển hơn nữa, không bị hình thức cũ kìm hãm.\nThứ ba, một nội dung có thể có nhiều hình thức thể hiện và ngược lại nên cần sử dụng mọi hình thức có thể có, mới cũng như cũ, kể cả việc phải cải biến các hình thức vốn có, lấy hình thức này bổ sung, thay thế cho hình thức kia để làm cho bất kỳ hình thức nào cũng trở thành công cụ phục vụ nội dung mới. V.I. Lênin kịch liệt phê phán thái độ chỉ thừa nhận các hình thức cũ, bảo thủ, trì trệ, chỉ muốn làm theo hình thức cũ; đồng thời cũng phê phán thái độ phủ nhận vai trò của hình thức cũ trong hoàn cảnh mới, chủ quan, nóng vội, thay đổi hình thức cũ một cách tùy tiện, vô căn cứ.\n* Bản chất và hiện tượng\nKhi đã có được nhận thức khá nhiều về các mặt, mối liên hệ tất yếu và các đặc tính riêng lẻ của sự vật, hiện tượng, thì nhận thức vẫn chưa vươn tới sự phản ánh đầy đủ về bản chất của nó. Vì vậy, cùng với sự tích lũy tri thức, xuất hiện nhu cầu nhận thức các mối liên hệ phụ thuộc, qua lại lẫn nhau giữa các mặt, giữa chính các mối liên hệ đó và đặt chúng trong sự thống nhất biện chứng, coi chúng là các yếu tố của một thể thống nhất hữu cơ. Giải quyết thành công nhiệm vụ này dẫn nhận thức đạt tới sự phản ánh đầy đủ bản chất của sự vật, hiện tượng tương ứng.\nBản chất là phạm trù chỉ tổng thể các mối liên hệ khách quan, tất nhiên, tương đối ổn định bên trong, quy định sự vận động, phát triển của đối tượng và thể hiện mình qua các hiện tượng tương ứng của đối tượng. Hiện tượng là phạm trù chỉ những biểu hiện của các mặt, mối liên hệ tất nhiên tương đối ổn định ở bên ngoài; là mặt dễ biến đổi hơn và là hình thức thể hiện của bản chất đối tượng.\nBản chất và hiện tượng đều tồn tại khách quan trong mối liên hệ hữu cơ, cái này không thể tồn tại thiếu cái kia. Về cơ bản, bản chất và hiện tượng có xu hướng phù hợp với nhau, bởi mỗi đối tượng đều là sự thống nhất giữa bản chất với hiện tượng và sự thống nhất đó được thể hiện ở chỗ, bản chất tồn tại thông qua hiện tượng còn hiện tượng phải là sự thể hiện của bản chất. Theo Hegel, bản chất “được ánh lên” nhờ hiện tượng. Tuy vậy, “nếu hình thái biểu hiện và bản chất của sự vật trực tiếp đồng nhất với nhau, thì mọi khoa học sẽ trở nên thừa”. Trong những điều kiện nhất định, bản chất thể hiện dưới hình thức đã bị cải biến, xuyên tạc những yếu tố thực sự của bản chất bằng cách bổ sung vào hay bớt đi từ bản chất một vài tính chất, yếu tố do hoàn cảnh cụ thể và các mối liên hệ ngẫu nhiên quy định, làm hiện tượng phong phú hay nghèo nàn hơn bản chất. Nhưng bản chất luôn là cái tương đối ổn định, ít biến đổi hơn, còn hiện tượng “động” hơn, thường xuyên biến đổi. V.I. Lênin viết: “không phải chỉ riêng hiện tượng là tạm thời, chuyển động, lưu động, bị tách rời bởi những giới hạn chỉ có tính chất ước lệ, mà bản chất của sự vật cũng như thế”. Bản chất gắn bó chặt chẽ với cái phổ biến, là một trong số những mối liên hệ cơ bản nhất tạo thành cơ sở cho sự thống nhất về một hệ thống chỉnh thể tất cả các cái riêng, là sợi chỉ đỏ xuyên suốt, xâu chuỗi tất cả chúng về một mối, phản ánh cái chung tất yếu, cái chung quyết định sự tồn tại và phát triển của sự vật, hiện tượng; còn hiện tượng phản ánh cái cá biệt, cái đơn nhất. Bản chất cũng là tính quy luật, bởi nói đến bản chất là nói đến tổng số các quy luật quyết định sự vận động và phát triển của sự vật, hiện tượng. Từ đây, có thể hiểu không phải ngẫu nhiên mà V.I. Lênin nhấn mạnh về tính cùng cấp độ, có thể dùng lẫn cho nhau của các phạm trù “quy luật”, “bản chất” và “cái phổ biến”.\nÝ nghĩa phương pháp luận\nThứ nhất, bản chất chỉ thể hiện mình thông qua hiện tượng và hiện tượng lại thường biểu hiện bản chất dưới hình thức đã bị cải biến nên trong mọi hoạt động, không thể chỉ nhận biết sự biểu hiện bên ngoài (hiện tượng), mà cần đi sâu vào bên trong để tìm hiểu và làm sáng tỏ bản chất thường ẩn giấu mình sau hiện tượng; dựa vào các quy luật khách quan quy định sự vận động, phát triển của sự vật, hiện tượng.\nThứ hai, bản chất là sự thống nhất giữa các mặt, các mối liên hệ tất nhiên vốn có của sự vật, hiện tượng; bản chất là địa bàn thống lĩnh của các mâu thuẫn biện chứng và chúng được giải quyết trong quá trình phát triển dẫn đến sự biến đổi của bản chất, tạo ra sự chuyển hóa của đối tượng từ dạng này sang dạng khác nên các phương pháp đã được áp dụng vào hoạt động cũ trước đây cũng phải thay đổi bằng các phương pháp khác, phù hợp với bản chất đã thay đổi của đối tượng.\n* Khả năng và hiện thực\nKhi đã nhận thức được bản chất và các mâu thuẫn vốn có của sự vật, hiện tượng, chủ thể nhận thức đã có thể phán đoán được sự vật, hiện tượng đó, do sự phát triển của những mâu thuẫn bên trong nó quy định sẽ biến đổi theo hướng nào, nghĩa là đã có thể nhận thức được đồng thời cả hiện thực và khả năng biến đổi của sự vật, hiện tượng đó. Biện chứng của sự liên hệ lẫn nhau giữa quá khứ, hiện tại và tương lai được phản ánh trong các phạm trù “hiện thực” và “khả năng”. Khả năng là phạm trù phản ánh thời kỳ hình thành đối tượng, khi nó mới chỉ tồn tại dưới dạng tiền đề hay với tư cách là xu hướng. Vì thế khả năng là tổng thể các tiền đề của sự biến đổi, sự hình thành của hiện thực mới, là cái có thể có, nhưng ngay lúc này còn chưa có; hiện thực là phạm trù phản ánh kết quả sự sinh thành, là sự thực hiện khả năng, và là cơ sở để định hình những khả năng mới.\nMột cách đơn giản hơn, khả năng là cái hiện chưa xảy ra, nhưng nhất định sẽ xảy ra khi có điều kiện thích hợp. Hiện thực là cái đang có, đang tồn tại, gồm tất cả các sự vật, hiện tượng vật chất đang tồn tại khách quan trong thực tế và các hiện tượng chủ quan đang tồn tại trong ý thức, là sự thống nhất biện chứng của bản chất và các hiện tượng thể hiện bản chất đó. Theo nghĩa này, hiện thực khách quan và hiện thực chủ quan được dùng để phân biệt các hiện tượng vật chất với các hiện tượng tinh thần. Về thực chất, hiện thực là sự thống nhất giữa bản chất của đối tượng với vô vàn các hiện tượng của nó, tạo nên tính xác định động cho đối tượng trong một không gian, thời gian cụ thể.\nMối liên hệ giữa khả năng và hiện thực\nLà những mặt đối lập, khả năng và hiện thực thống nhất biện chứng với nhau: Chúng loại trừ nhau theo những dấu hiệu căn bản nhất, nhưng không cô lập hoàn toàn với nhau. Sinh ra từ trong lòng hiện thực và đại diện cho tương lai ở thời hiện tại, khả năng làm bộc lộ hết tính tương đối của hiện thực. Thông qua tính tương đối đó mà hiện thực hóa sự liên tục của các quá trình biến đổi. Mọi đối tượng đều bắt đầu phát triển từ sự chín muồi các tiền đề sinh thành của nó. Hiện thực bao hàm trong mình số lớn các khả năng, nhưng không phải tất cả đều được hiện thực hóa. Sự hiện thực hóa từng khả năng đòi hỏi phải có các điều kiện tương ứng. Trong xã hội, sự hiện thực hóa một khả năng nào đó không tách rời hoạt động thực tiễn, mà hoạt động đó chỉ có thể thành công khi con người tính đến các khả năng vốn có ở hiện thực, ở các xu hướng biến đổi khách quan của nó. Mục đích, phương tiện và các phương thức của hoạt động đó xét đến cùng cũng gắn với các hoàn cảnh khách quan tương ứng. Đồng thời chính hoạt động thực tiễn như là quá trình chuyển hóa mục đích (khả năng) thành sản phẩm của hoạt động (hiện thực) là sự thống nhất khả năng và hiện thực. Dĩ nhiên, mức độ tự do và hiệu quả của hoạt động đó không phải là vô hạn, mà cũng bị các quy luật khách quan quy định.\nCác dạng khả năng\nHiện thực thường có nhiều mặt, nhiều xu hướng vận động, nhiều khả năng biến đổi. Chúng giữ vai trò không ngang nhau trong sự vận hành và phát triển hiện thực. Chẳng hạn, sự hiện thực hóa một số khả năng này quy định sự chuyển hóa đối tượng từ trạng thái này sang trạng thái khác vẫn trong khuôn khổ chính bản chất đó, sự hiện thực hóa những khả năng khác lại đòi hỏi sự biến đổi bản chất của đối tượng, biến nó thành khác. Trong quá trình thực hiện, một số khả năng đối tượng chuyển từ thấp đến cao, nhưng ở những khả năng khác thì lại hạ từ cao xuống thấp. Có khả năng liên quan đến sự biến đổi về chất, số khác lại liên quan đến sự biến đổi về lượng của đối tượng. Một số khả năng gắn với cái tất nhiên trong đối tượng, số khác lại gắn với cái ngẫu nhiên. Có khả năng được hiện thực hóa trong các điều kiện được tạo lập ở hiện tại, nhưng một số khác lại chờ các điều kiện đó được tạo ra ở tương lai xa;... Hoạt động thực tiễn của con người làm thay đổi hiện thực khách quan chính là thực hiện các khả năng nhất định bằng cách tạo ra những điều kiện tương ứng.\nCó nhiều cơ sở phân loại khả năng. Có thể chia các khả năng thành hai nhóm phụ thuộc vào việc cái gì quy định chúng: các thuộc tính và mối liên hệ tất nhiên hay ngẫu nhiên. Những khả năng bị quy định bởi những thuộc tính và mối liên hệ tất nhiên của đối tượng được gọi là khả năng thực; còn những khả năng bị quy định bởi các thuộc tính và mối liên hệ ngẫu nhiên là khả năng hình thức. Trong những điều kiện thích hợp khả năng thực tất yếu được thực hiện, còn khả năng hình thức có thể được thực hiện cũng có thể không. Sự phân biệt khả năng thực và khả năng hình thức có ý nghĩa to lớn đối với hoạt động thực tiễn: Khi đặt ra mục đích, xây dựng chương trình, thực hiện hành vi, con người cần phải xuất phát từ những khả năng thực. Những khả năng hình thức không thể làm cơ sở cho hoạt động có kế hoạch.\nCác khả năng chỉ được hiện thực hóa khi có các điều kiện thích hợp. Căn cứ vào mối liên hệ với những điều kiện này như thế nào, khả năng được chia ra thành khả năng cụ thể và khả năng trừu tượng. Loại thứ nhất là những khả năng mà để thực hiện chúng hiện đã có đủ điều kiện, loại thứ hai là những khả năng mà ở thời hiện tại còn chưa có những điều kiện thực hiện, nhưng điều kiện có thể xuất hiện khi đối tượng đạt tới một trình độ phát triển nhất định. Để lập những kế hoạch trước mắt, xác định cách thức giải quyết các nhiệm vụ thực tiễn đã chín muồi thì cần phải xuất phát từ khả năng cụ thể, không thể căn cứ vào các khả năng trừu tượng.\nCó hai khả năng là: khả năng bản chất và khả năng chức năng. Khả năng bản chất là những khả năng mà việc thực hiện chúng làm biến đổi bản chất của đối tượng; còn khả năng chức năng là những khả năng gây ra sự biến đổi thuộc tính, trạng thái của đối tượng, mà vẫn không làm thay đổi bản chất. Nếu tính đến kết quả thực hiện khả năng dẫn đến việc chuyển từ thấp đến cao hay ngược lại, hoặc từ trạng thái này sang trạng thái khác ở cùng một trình độ phát triển thì có thể chia các khả năng ra thành khả năng tiến bộ, khả năng thoái bộ và khả năng đứng yên.\nCăn cứ vào tính xác định chất hay lượng của đối tượng bị biến đổi do thực hiện khả năng gây ra mà chia ra thành khả năng chất hay khả năng lượng.\nViệc khảo sát các khả năng thông qua quan hệ mâu thuẫn là cơ sở để chia các khả năng thành khả năng loại trừ và khả năng tương hợp. Loại thứ nhất là khả năng mà việc thực hiện nó khiến khả năng khác bị triệt tiêu, trở thành mất khả năng; loại thứ hai là khả năng mà việc chuyển hóa nó thành hiện thực không thủ tiêu khả năng khác. Vật chất chứa đựng vô hạn các khả năng, chứng tỏ tính vô cùng và sự phát triển không giới hạn của nó.\nTrong tư duy về phát triển xã hội, khả năng bao giờ cũng là khả năng khách quan, nó không tự động trở thành hiện thực. Hiện thực xã hội tốt đẹp chỉ có thể sinh thành và trưởng thành nhờ hoạt động thực tiễn. Con người quyết định sự kết hợp tốt nhất cái khách quan với những nỗ lực chủ quan.\nÝ nghĩa phương pháp luận:\nThứ nhất, khả năng và hiện thực tồn tại trong mối liên hệ không tách rời nhau và luôn chuyển hóa cho nhau; do hiện thực được chuẩn bị bằng khả năng còn khả năng hướng tới sự chuyển hóa thành hiện thực, nên trong hoạt động nhận thức và hoạt động thực tiễn cần dựa vào hiện thực chứ không thể dựa vào khả năng. Tuy nhiên, vì khả năng biểu hiện khuynh hướng phát triển của sự vật, hiện tượng trong tương lai nên khi đề ra kế hoạch, phải tính đến mọi khả năng để kế hoạch đó sát với thực tiễn. Nhiệm vụ của hoạt động nhận thức là phải xác định được khả năng phát triển của sự vật, hiện tượng và tìm ra khả năng ấy trong chính bản thân nó, bởi khả năng nảy sinh vừa do sự tác động qua lại giữa các mặt bên trong, vừa do sự tác động qua lại giữa sự vật, hiện tượng với hoàn cảnh bên ngoài.\nThứ hai, phát triển là quá trình trong đó khả năng chuyển hóa thành hiện thực; còn hiện thực này trong quá trình phát triển của mình lại sinh ra các khả năng mới, trong điều kiện thích hợp các khả năng mới ấy lại chuyển hóa thành hiện thực, tạo thành quá trình vô tận; do vậy, sau khi đã xác định được các khả năng phát triển của sự vật, hiện tượng thì mới tiến hành lựa chọn và thực hiện khả năng.\nThứ ba, trong quá trình thực hiện khả năng đã lựa chọn, cần chú ý trong một sự vật, hiện tượng có thể chứa nhiều khả năng khác nhau, do vậy cần tính đến mọi khả năng để dự kiến các phương án thích hợp cho từng trường hợp có thể xảy ra.\nThứ tư, cùng trong những điều kiện nhất định, ở cùng một sự vật, hiện tượng có thể tồn tại một số khả năng và ngoài một số khả năng vốn có, thì khi có điều kiện mới bổ sung, ở sự vật, hiện tượng sẽ xuất hiện thêm một số khả năng mới dẫn đến sự xuất hiện một sự vật, hiện tượng mới, phức tạp hơn. Vì vậy, trong hoạt động nhận thức và hoạt động thực tiễn phải lựa chọn khả năng trong số hiện có, trước hết phải chú ý đến khả năng gần, khả năng tất nhiên vì chúng dễ chuyển hóa thành hiện thực hơn.\nThứ năm, khả năng chỉ chuyển hóa thành hiện thực khi có đầy đủ các điều kiện cần thiết nên cần tạo ra các điều kiện đó để nó chuyển hóa thành hiện thực. Cần tránh sai lầm, hoặc tuyệt đối hóa vai trò của nhân tố chủ quan, hoặc xem thường vai trò ấy trong quá trình biến đổi khả năng thành hiện thực."
  },
  {
    "title": "c) Các quy luật cơ bản của phép biện chứng duy vật",
    "level": 3,
    "body": "Quy luật là mối liên hệ phổ biến, khách quan, bản chất, bền vững, tất yếu giữa các đối tượng và nhất định tác động khi có các điều kiện phù hợp. “Quy luật khách quan” vốn thuộc biện chứng của sự tồn tại khách quan khác với “quy luật khoa học” vốn là sự khái quát những liên hệ và quy luật khách quan được trình bày trong các lý thuyết khoa học bằng những phán đoán phổ biến. Do đó, về nguyên tắc, các quy luật khoa học chỉ gần đúng với các quy luật khách quan. Sự thừa nhận tính khách quan của các quy luật tự nhiên và xã hội là nguyên tắc phương pháp luận quan trọng đối với sự phát triển tri thức khoa học. Khi nhận thức được các quy luật tự nhiên và xã hội, con người tích cực vận dụng chúng vào hoạt động thực tiễn, tức là nếu không thể “làm thay đổi” chúng, thì lại dựa trên chúng để làm thay đổi tự nhiên và xã hội. V.I. Lênin viết: “chừng nào chúng ta chưa biết được một quy luật của giới tự nhiên thì quy luật đó, trong khi tồn tại và tác động độc lập và ở ngoài nhận thức của ta, biến ta thành những nô lệ của “tính tất yếu mù quáng”. Khi chúng ta đã biết được quy luật đó, quy luật tác động (như Mác đã nhắc lại hàng ngàn lần) không lệ thuộc vào ý chí của chúng ta và vào ý thức của chúng ta thì chúng ta trở thành người chủ của giới tự nhiên”. Con người có thể nhờ một số quy luật để kiềm chế sự tác động của những quy luật khác. Chẳng hạn quy luật vạn vật hấp dẫn (do Newton phát hiện ra) đã tác động từ lâu trước khi có con người, trong quá trình hoạt động, con người vẫn tự phát dựa theo nó, nhưng khi đã biết, con người sẽ tổ chức hoạt động của mình phù hợp với sự tác động và có khi còn vô hiệu hóa sự tác động của nó... Do vậy, “khái niệm quy luật là một trong những giai đoạn của sự nhận thức của con người về tính thống nhất và về liên hệ, về sự phụ thuộc lẫn nhau và tính chỉnh thể của quá trình thế giới”.\nMọi quy luật đều thể hiện cái phổ biến vốn có ở các giai đoạn vận động, thể hiện sự thống nhất các đối tượng đa dạng. Do vậy, những mối liên hệ được phản ánh trong các quy luật cũng không mang tính chất đơn nhất. Mặt khác, điều đó không có nghĩa là những mối liên hệ phổ biến được phản ánh trong quy luật đã thâu tóm hết mọi đối tượng khách quan. Mức độ chung của các đối tượng là khác nhau, do vậy các quy luật cũng có mức độ phổ biến khác nhau và một cách tương đối có thể chia tất cả các quy luật thành ba nhóm: quy luật riêng, quy luật chung và quy luật phổ biến.\nNhững quy luật của phép biện chứng mang tính phổ biến, phản ánh những mối liên hệ phổ biến của tất cả các đối tượng hiện thực, đồng thời cũng phản ánh cả nội dung chung, thống nhất vốn có ở các quy luật nhóm thứ nhất và thứ hai. Chẳng hạn, trong thế giới khách quan có nhiều quy luật riêng phản ánh quan hệ giữa các thuộc tính đối lập nhau của đối tượng: quy luật tương tác các điện tích trái dấu, các hạt và phản hạt, hút và đẩy; đấu tranh sinh tồn trong cùng một loài và giữa các loài sinh vật; đấu tranh giai cấp trong xã hội... Nội dung của tất cả các quy luật đó bao gồm cái chung, lặp lại và được bao quát bởi quy luật biện chứng thống nhất và đấu tranh của các mặt đối lập có ý nghĩa phổ biến. Tương tự như vậy là quy luật phủ định của phủ định và quy luật những thay đổi về lượng dẫn đến những thay đổi về chất và ngược lại.\nViệc nhận thức các quy luật khách quan, nhất là các quy luật phổ biến, có ý nghĩa thực tiễn to lớn, tạo điều kiện cho con người làm chủ tốt hơn tự nhiên và xã hội. Những quy luật phổ biến của phép biện chứng duy vật khái quát cách thức, nguyên nhân và khuynh hướng vận động, phát triển của sự vật, hiện tượng, phản ánh bản chất biện chứng của thế giới khách quan vốn được con người rút ra từ trong lịch sử của giới tự nhiên và lịch sử của xã hội loài người. Các quy luật này định hướng việc nghiên cứu các quy luật đặc thù, mối liên hệ giữa chúng, từ đó tạo ra cơ sở khách quan cho mối liên hệ giữa triết học duy vật biện chứng với khoa học chuyên ngành.\n* Quy luật chuyển hóa từ những thay đổi về lượng dẫn đến những thay đổi về chất và ngược lại\nQuy luật này chỉ ra cách thức chung nhất của sự vận động và phát triển, khi cho thấy sự thay đổi về chất chỉ xảy ra khi sự vật, hiện tượng đã tích lũy những thay đổi về lượng đạt đến ngưỡng nhất định. Quy luật cũng chỉ ra tính chất của sự vận động và phát triển, khi cho thấy sự thay đổi về lượng của sự vật, hiện tượng diễn ra từ từ kết hợp với sự thay đổi nhảy vọt về chất làm cho sự vật, hiện tượng vừa tiến bước tuần tự, vừa có những bước đột phá vượt bậc. Ph. Ăngghen viết: “... trong giới tự nhiên, thì những sự biến đổi về chất - xảy ra một cách xác định chặt chẽ đối với từng trường hợp cá biệt - chỉ có thể có được do thêm vào hay bớt đi một số lượng vật chất hay vận động”.\nNội dung quy luật được vạch ra thông qua việc làm rõ các khái niệm, phạm trù có liên quan.\nChất là khái niệm dùng để chỉ tính quy định khách quan vốn có của sự vật, hiện tượng; là sự thống nhất hữu cơ của các thuộc tính, yếu tố tạo nên sự vật, hiện tượng làm cho sự vật, hiện tượng là nó mà không phải là sự vật, hiện tượng khác (trả lời cho câu hỏi sự vật, hiện tượng đó là gì? Giúp phân biệt nó với sự vật, hiện tượng khác). Đặc điểm cơ bản của chất là nó thể hiện tính ổn định tương đối của sự vật, hiện tượng; nghĩa là khi nó chưa chuyển hóa thành sự vật, hiện tượng khác thì chất của nó vẫn chưa thay đổi. Mỗi sự vật, hiện tượng đều có quá trình tồn tại và phát triển qua nhiều giai đoạn, trong mỗi giai đoạn ấy nó lại có chất riêng. Như vậy, mỗi sự vật, hiện tượng không phải chỉ có một chất mà có thể có nhiều chất.\nChất và sự vật có mối quan hệ chặt chẽ, không tách rời nhau. Trong hiện thực khách quan không thể tồn tại sự vật không có chất và không thể có chất nằm ngoài sự vật. Chất của sự vật được biểu hiện qua những thuộc tính của nó, nhưng không phải bất kỳ thuộc tính nào cũng biểu hiện chất của sự vật. Thuộc tính của sự vật có thuộc tính cơ bản và thuộc tính không cơ bản. Những thuộc tính cơ bản được tổng hợp lại tạo thành chất của sự vật; quy định sự tồn tại, vận động và phát triển của sự vật, chỉ khi nào chúng thay đổi hay mất đi thì sự vật mới thay đổi hay mất đi. Nhưng thuộc tính của sự vật chỉ bộc lộ qua các mối liên hệ cụ thể với các sự vật khác. Bởi vậy, sự phân chia thuộc tính thành thuộc tính cơ bản và thuộc tính không cơ bản cũng chỉ mang tính tương đối. Trong mối liên hệ cụ thể này, thuộc tính này là thuộc tính cơ bản thể hiện chất của sự vật, trong mối liên hệ cụ thể khác sẽ có thêm thuộc tính khác hay thuộc tính khác là thuộc tính cơ bản. Ví dụ: Trong mối quan hệ với động vật thì các thuộc tính có khả năng chế tạo, sử dụng công cụ, có tư duy là thuộc tính cơ bản của con người còn những thuộc tính khác không là thuộc tính cơ bản. Song trong quan hệ giữa những con người cụ thể với nhau thì những thuộc tính của con người về nhân dạng, về dấu vân tay,... lại trở thành thuộc tính cơ bản.\nChất của sự vật không những được quy định bởi chất của những yếu tố tạo thành mà còn bởi phương thức liên kết giữa các yếu tố tạo thành, nghĩa là bởi kết cấu của sự vật. Trong hiện thực các sự vật được tạo thành bởi các yếu tố như nhau, song chất của chúng lại khác. Ví dụ: Kim cương và than chì đều có cùng thành phần hóa học do các nguyên tố cácbon tạo nên nhưng do phương thức liên kết giữa các nguyên tử cácbon là khác nhau, vì thế chất của chúng hoàn toàn khác nhau. Kim cương rất cứng, còn than chì lại mềm. Trong một tập thể nhất định nếu phương thức liên kết giữa các cá nhân biến đổi thì tập thể đó có thể trở nên vững mạnh, hoặc sẽ trở thành yếu kém, nghĩa là chất của tập thể biến đổi.\nTừ đó có thể thấy sự thay đổi về chất của sự vật vừa phụ thuộc vào sự thay đổi các yếu tố cấu thành sự vật, vừa phụ thuộc vào sự thay đổi phương thức liên kết giữa các yếu tố ấy.\nLượng là khái niệm dùng để chỉ tính quy định vốn có của sự vật, hiện tượng về mặt quy mô, trình độ phát triển, các yếu tố biểu hiện ở số lượng các thuộc tính, ở tổng số các bộ phận, ở đại lượng, ở tốc độ và nhịp điệu vận động và phát triển của sự vật, hiện tượng. Lượng còn biểu hiện ở kích thước dài hay ngắn, số lượng lớn hay nhỏ, tổng số ít hay nhiều, trình độ cao hay thấp, tốc độ vận động nhanh hay chậm, màu sắc đậm hay nhạt... Đặc điểm cơ bản của lượng là tính khách quan vì nó là một dạng biểu hiện của vật chất, chiếm một vị trí nhất định trong không gian và tồn tại trong thời gian nhất định. Trong sự vật, hiện tượng có nhiều loại lượng khác nhau; có lượng là yếu tố quy định bên trong, có lượng chỉ thể hiện yếu tố bên ngoài của sự vật, hiện tượng; sự vật, hiện tượng càng phức tạp thì lượng của chúng cũng phức tạp theo. Trong tự nhiên và phần nhiều trong xã hội, lượng có thể đo, đếm được nhưng trong một số trường hợp của xã hội và nhất là trong tư duy, lượng khó đo được bằng số liệu cụ thể mà chỉ có thể nhận biết được bằng năng lực trừu tượng hóa. Sự phân biệt giữa chất và lượng chỉ có ý nghĩa tương đối, tùy theo từng mối quan hệ mà xác định đâu là lượng và đâu là chất; cái là lượng trong mối quan hệ này, lại có thể là chất trong mối quan hệ khác.\nMối quan hệ giữa các khái niệm cấu thành quy luật chỉ ra rằng, mỗi sự vật, hiện tượng là một thể thống nhất giữa hai mặt chất và lượng, chúng tác động biện chứng lẫn nhau theo cơ chế khi sự vật, hiện tượng đang tồn tại, chất và lượng thống nhất với nhau ở một độ; nhưng cũng trong phạm vi độ đó, chất và lượng đã tác động lẫn nhau làm cho sự vật, hiện tượng dần biến đổi bắt đầu từ lượng. Quá trình thay đổi của lượng diễn ra theo xu hướng hoặc tăng hoặc giảm nhưng không lập tức dẫn đến sự thay đổi về chất của sự vật, hiện tượng; chỉ khi nào lượng thay đổi đến giới hạn nhất định (đến độ) mới dẫn đến sự thay đổi về chất. Như vậy, sự thay đổi về lượng tạo điều kiện cho chất đổi và kết quả là sự vật, hiện tượng cũ mất đi, sự vật, hiện tượng mới ra đời.\nCác khái niệm độ, điểm nút, bước nhảy, xuất hiện trong quá trình tác động lẫn nhau giữa chất và lượng. Độ là khái niệm dùng để chỉ mối liên hệ thống nhất và quy định lẫn nhau giữa chất với lượng; là giới hạn tồn tại của sự vật, hiện tượng mà trong đó sự thay đổi về lượng chưa dẫn đến sự thay đổi về chất; sự vật, hiện tượng vẫn là nó, chưa chuyển hóa thành sự vật, hiện tượng khác. Điểm giới hạn mà tại đó sự thay đổi về lượng đạt tới chỗ phá vỡ độ cũ, làm cho chất của sự vật, hiện tượng thay đổi, chuyển thành chất mới, thời điểm mà tại đó bắt đầu xảy ra bước nhảy, gọi là điểm nút. Độ được giới hạn bởi hai điểm nút và sự thay đổi về lượng đạt tới điểm nút trên sẽ dẫn đến sự ra đời của chất mới. Sự thống nhất giữa lượng mới với chất mới tạo ra độ mới và điểm nút mới. Bước nhảy là khái niệm dùng để chỉ giai đoạn chuyển hóa cơ bản về chất của sự vật, hiện tượng do những thay đổi về lượng trước đó gây ra, là bước ngoặt cơ bản trong sự biến đổi về lượng. Bước nhảy kết thúc một giai đoạn biến đổi về lượng, là sự gián đoạn trong quá trình vận động liên tục của sự vật, hiện tượng.\nSự vật, hiện tượng mới xuất hiện là do bước nhảy được thực hiện; trong sự vật, hiện tượng đó lượng lại biến đổi, đến điểm nút mới, lại xảy ra bước nhảy mới. Cứ như thế, sự vận động của sự vật, hiện tượng diễn ra, lúc thì biến đổi tuần tự về lượng, lúc thì nhảy vọt về chất, tạo nên một đường dài thay thế nhau vô tận sự vật, hiện tượng cũ bằng sự vật, hiện tượng mới. Quy luật lượng đổi - chất đổi còn nói lên chiều ngược lại, nghĩa là khi chất mới đã khẳng định mình, nó tạo ra lượng mới phù hợp để có sự thống nhất mới giữa chất với lượng.\nNhư vậy, quy luật chỉ ra rằng quan hệ lượng - chất là quan hệ biện chứng. Những thay đổi về lượng dẫn đến những thay đổi về chất và ngược lại; chất là mặt tương đối ổn định, lượng là mặt dễ biến đổi hơn. Lượng biến đổi, mâu thuẫn với chất cũ, phá vỡ độ cũ, chất mới hình thành với lượng mới; lượng mới lại tiếp tục biến đổi, đến độ nào đó lại phá vỡ chất cũ đang kìm hãm nó. Quá trình tác động qua lại lẫn nhau giữa lượng và chất tạo nên sự vận động liên tục. Tùy vào sự vật, hiện tượng, tùy vào mâu thuẫn vốn có của chúng và vào điều kiện, trong đó diễn ra sự thay đổi về chất của sự vật, hiện tượng mà có nhiều hình thức bước nhảy.\nCăn cứ vào quy mô và nhịp độ của bước nhảy, có bước nhảy toàn bộ và bước nhảy cục bộ. Bước nhảy toàn bộ làm cho tất cả các mặt, các bộ phận, các yếu tố... của sự vật, hiện tượng thay đổi. Bước nhảy cục bộ chỉ làm thay đổi một số mặt, một số yếu tố, một số bộ phận... của chúng. Sự phân biệt bước nhảy toàn bộ hay cục bộ chỉ có ý nghĩa tương đối, bởi chúng đều là kết quả của quá trình thay đổi về lượng.\nCăn cứ vào thời gian của sự thay đổi về chất và dựa trên cơ chế của sự thay đổi đó, có bước nhảy tức thời và bước nhảy dần dần. Bước nhảy tức thời làm chất của sự vật, hiện tượng biến đổi mau chóng ở tất cả các bộ phận. Bước nhảy dần dần là quá trình thay đổi về chất diễn ra bằng cách tích lũy dần những yếu tố của chất mới và loại bỏ dần các yếu tố của chất cũ, trong trường hợp này sự vật, hiện tượng biến đổi chậm hơn.\nCó thể khái quát lại nội dung cơ bản của quy luật chuyển hóa những thay đổi về lượng dẫn đến những thay đổi về chất và ngược lại như sau: Mọi đối tượng đều là sự thống nhất của hai mặt đối lập chất và lượng, những sự thay đổi dần dần về lượng vượt quá giới hạn của độ sẽ dẫn đến sự thay đổi căn bản về chất thông qua bước nhảy, chất mới ra đời tiếp tục tác động trở lại duy trì sự thay đổi của lượng.\nÝ nghĩa phương pháp luận:\nThứ nhất, trong hoạt động nhận thức và hoạt động thực tiễn phải biết tích lũy về lượng để có biến đổi về chất; không được nôn nóng cũng như không được bảo thủ. Bước nhảy làm cho chất mới ra đời, thay thế chất cũ là hình thức tất yếu của sự vận động, phát triển của mọi sự vật, hiện tượng; nhưng sự thay đổi về chất do thực hiện bước nhảy gây nên chỉ xảy ra khi lượng đã thay đổi đến giới hạn, tức là đến điểm nút, đến độ nên muốn tạo ra bước nhảy thì phải thực hiện quá trình tích lũy về lượng.\nThứ hai, khi lượng đã đạt đến điểm nút thì thực hiện bước nhảy là yêu cầu khách quan của sự vận động của sự vật, hiện tượng; tư tưởng nôn nóng thường biểu hiện ở chỗ không chú ý thỏa đáng đến sự tích lũy về lượng mà cho rằng sự phát triển của sự vật, hiện tượng chỉ là những bước nhảy liên tục; ngược lại, tư tưởng bảo thủ thường biểu hiện ở chỗ không dám thực hiện bước nhảy, coi sự phát triển chỉ là những thay đổi về lượng. Do vậy, cần khắc phục cả hai biểu hiện trên.\nThứ ba, sự tác động của quy luật này đòi hỏi phải có thái độ khách quan, khoa học và quyết tâm thực hiện bước nhảy; tuy đều có tính khách quan, nhưng quy luật xã hội chỉ diễn ra thông qua hoạt động có ý thức của con người; do vậy, khi thực hiện bước nhảy trong lĩnh vực xã hội, tuy vẫn phải tuân theo điều kiện khách quan, nhưng cũng phải chú ý đến điều kiện chủ quan. Nói cách khác, trong hoạt động thực tiễn, không những cần xác định quy mô và nhịp điệu bước nhảy một cách khách quan, khoa học, chống giáo điều, rập khuôn, mà còn phải có quyết tâm và nghị lực để thực hiện bước nhảy khi điều kiện đã chín muồi, chủ động nắm bắt thời cơ thực hiện kịp thời bước nhảy khi điều kiện cho phép, chuyển thay đổi mang tính tiến hóa sang thay đổi mang tính cách mạng.\nThứ tư, quy luật yêu cầu phải nhận thức được sự thay đổi về chất còn phụ thuộc vào phương thức liên kết giữa các yếu tố tạo thành sự vật, hiện tượng; do đó, phải biết lựa chọn phương pháp phù hợp để tác động vào phương thức liên kết đó trên cơ sở hiểu rõ bản chất, quy luật của chúng.\n* Quy luật thống nhất và đấu tranh của các mặt đối lập\nQuy luật thống nhất và đấu tranh của các mặt đối lập thể hiện bản chất, là hạt nhân của phép biện chứng duy vật, bởi quy luật đề cập tới vấn đề cơ bản và quan trọng nhất của phép biện chứng duy vật - vấn đề nguyên nhân, động lực của sự vận động, phát triển. Theo V.I. Lênin, “có thể định nghĩa vắn tắt phép biện chứng là học thuyết về sự thống nhất của các mặt đối lập. Như thế là nắm được hạt nhân của phép biện chứng,...”.\nNội dung của quy luật này cũng được làm sáng tỏ thông qua việc làm rõ các khái niệm, phạm trù liên quan.\nTrong phép biện chứng duy vật, mâu thuẫn biện chứng là khái niệm dùng để chỉ sự liên hệ, tác động theo cách vừa thống nhất, vừa đấu tranh; vừa đòi hỏi, vừa loại trừ, vừa chuyển hóa lẫn nhau giữa các mặt đối lập. Yếu tố tạo thành mâu thuẫn biện chứng là các mặt đối lập, các bộ phận, các thuộc tính... có khuynh hướng biến đổi trái ngược nhau, nhưng cùng tồn tại khách quan trong mỗi sự vật, hiện tượng của tự nhiên, xã hội và tư duy. Trong mỗi mâu thuẫn, các mặt đối lập vừa thống nhất với nhau, vừa đấu tranh lẫn nhau tạo nên trạng thái ổn định tương đối của sự vật, hiện tượng. Thống nhất giữa các mặt đối lập là khái niệm dùng để chỉ sự liên hệ giữa chúng và được thể hiện ở việc: Thứ nhất, các mặt đối lập cần đến nhau, nương tựa vào nhau, làm tiền đề cho nhau tồn tại, không có mặt này thì không có mặt kia; Thứ hai, các mặt đối lập tác động ngang nhau, cân bằng nhau thể hiện sự đấu tranh giữa cái mới đang hình thành với cái cũ chưa mất hẳn; thứ ba, giữa các mặt đối lập có sự tương đồng, đồng nhất do trong các mặt đối lập còn tồn tại những yếu tố giống nhau. Do sự đồng nhất này mà trong nhiều trường hợp, khi mâu thuẫn xuất hiện và tác động ở điều kiện phù hợp, các mặt đối lập chuyển hóa vào nhau. Đồng nhất không tách rời với sự khác nhau, với sự đối lập, bởi mỗi sự vật, hiện tượng vừa là bản thân nó, vừa là sự vật, hiện tượng đối lập với nó nên trong đồng nhất đã bao hàm sự khác nhau, đối lập.\nĐấu tranh giữa các mặt đối lập là khái niệm dùng để chỉ sự tác động qua lại theo hướng bài trừ, phủ định lẫn nhau giữa chúng và sự tác động đó cũng không tách rời sự khác nhau, thống nhất, đồng nhất giữa chúng trong một mâu thuẫn. So với đấu tranh giữa các mặt đối lập thì thống nhất giữa chúng có tính tạm thời, tương đối, có điều kiện, nghĩa là sự thống nhất đó chỉ tồn tại trong trạng thái đứng im tương đối của sự vật, hiện tượng; còn đấu tranh có tính tuyệt đối, nghĩa là đấu tranh phá vỡ sự ổn định tương đối của chúng dẫn đến sự chuyển hóa về chất của chúng. Tính tuyệt đối của đấu tranh gắn với sự tự thân vận động, phát triển diễn ra không ngừng của sự vật, hiện tượng. Về vấn đề này, khi chú ý nhiều hơn đến tính tuyệt đối của “đấu tranh”, V.I. Lênin đã viết: “Sự phát triển là một cuộc “đấu tranh” giữa các mặt đối lập”.\nMâu thuẫn tồn tại khách quan trong mọi lĩnh vực của thế giới và vô cùng đa dạng. Sự đa dạng đó phụ thuộc vào đặc điểm của các mặt đối lập, vào điều kiện mà trong đó sự tác động qua lại giữa các mặt đối lập triển khai, vào trình độ tổ chức của sự vật, hiện tượng mà trong đó mâu thuẫn tồn tại. Mỗi loại mâu thuẫn có đặc điểm riêng và có vai trò khác nhau đối với sự tồn tại và phát triển của sự vật, hiện tượng.\nCăn cứ vào sự tồn tại và phát triển của toàn bộ sự vật, hiện tượng, có mâu thuẫn cơ bản và mâu thuẫn không cơ bản. Mâu thuẫn cơ bản tác động trong suốt quá trình tồn tại của sự vật, hiện tượng; quy định bản chất, sự phát triển của chúng từ khi hình thành đến lúc tiêu vong. Mâu thuẫn không cơ bản đặc trưng cho một phương diện nào đó, chỉ quy định sự vận động, phát triển của một hay một số mặt của sự vật, hiện tượng và chịu sự chi phối của mâu thuẫn cơ bản.\nCăn cứ vào vai trò của mâu thuẫn đối với sự tồn tại và phát triển của sự vật, hiện tượng trong mỗi giai đoạn nhất định, có thể phân chia thành mâu thuẫn chủ yếu và mâu thuẫn thứ yếu. Mâu thuẫn chủ yếu luôn nổi lên hàng đầu ở mỗi giai đoạn phát triển của sự vật, hiện tượng, có tác dụng quy định đối với các mâu thuẫn khác trong cùng giai đoạn đó của quá trình phát triển. Giải quyết mâu thuẫn chủ yếu sẽ tạo điều kiện để giải quyết các mâu thuẫn khác ở cùng giai đoạn, còn sự phát triển, chuyển hóa của sự vật, hiện tượng từ hình thức này sang hình thức khác phụ thuộc vào việc giải quyết mâu thuẫn chủ yếu. Mâu thuẫn thứ yếu là mâu thuẫn không đóng vai trò quyết định trong sự vận động, phát triển của sự vật, hiện tượng. Tuy vậy, ranh giới giữa mâu thuẫn chủ yếu và mâu thuẫn thứ yếu chỉ là tương đối, tùy theo từng hoàn cảnh cụ thể, có mâu thuẫn trong điều kiện này là chủ yếu, song trong điều kiện khác lại là thứ yếu và ngược lại.\nCăn cứ vào quan hệ giữa các mặt đối lập với một sự vật, hiện tượng, có mâu thuẫn bên trong và mâu thuẫn bên ngoài. Mâu thuẫn bên trong là sự tác động qua lại giữa các mặt, các khuynh hướng... đối lập nằm trong chính mỗi sự vật, hiện tượng; có vai trò quy định trực tiếp quá trình vận động và phát triển của sự vật, hiện tượng. Mâu thuẫn bên ngoài xuất hiện trong mối liên hệ giữa các sự vật, hiện tượng với nhau; tuy cũng ảnh hưởng đến sự tồn tại và phát triển của chúng, nhưng phải thông qua mâu thuẫn bên trong mới phát huy tác dụng. Các mâu thuẫn cơ bản và chủ yếu đều là những mâu thuẫn giữa các mặt, các bộ phận, yếu tố bên trong cấu thành sự vật, hiện tượng nên có thể gọi chúng là mâu thuẫn bên trong. Song các đối tượng còn có những mối liên hệ và quan hệ với các đối tượng khác thuộc môi trường tồn tại của nó, những mâu thuẫn loại này được gọi là các mâu thuẫn bên ngoài. Tuy nhiên, sự phân chia này cũng chỉ mang tính tương đối, bởi trong quan hệ này hoặc so với một số đối tượng này, nó là bên trong; nhưng trong quan hệ khác, so với một số đối tượng khác, nó lại là bên ngoài.\nCăn cứ vào tính chất của lợi ích cơ bản là đối lập nhau trong mối quan hệ giữa các giai cấp ở một giai đoạn lịch sử nhất định, trong xã hội có mâu thuẫn đối kháng và mâu thuẫn không đối kháng. Mâu thuẫn đối kháng là mâu thuẫn giữa các giai cấp, tập đoàn người, lực lượng, xu hướng xã hội... có lợi ích cơ bản đối lập nhau và không thể điều hòa được. Đó là mâu thuẫn giữa các giai cấp bóc lột và bị bóc lột, giữa giai cấp thống trị và giai cấp bị trị... Mâu thuẫn không đối kháng là mâu thuẫn giữa các giai cấp, tập đoàn người, lực lượng, xu hướng xã hội... có lợi ích cơ bản không đối lập nhau nên là mâu thuẫn cục bộ, tạm thời.\nNói về vai trò của mâu thuẫn đối với sự vận động và phát triển, Ph. Ăngghen nhấn mạnh, nguyên nhân chính cũng là nguyên nhân cuối cùng tạo nên nguồn gốc của sự vận động, phát triển của sự vật, hiện tượng là sự tác động (theo hướng phủ định, thống nhất) lẫn nhau giữa chúng và giữa các mặt đối lập trong chúng. Có hai loại tác động dẫn đến vận động là tác động lẫn nhau giữa các sự vật, hiện tượng (bên ngoài) và sự tác động lẫn nhau giữa các mặt đối lập của cùng một sự vật, hiện tượng (bên trong); nhưng chỉ có sự tác động lẫn nhau giữa các mặt đối lập (bên trong) mới làm cho sự vật, hiện tượng phát triển.\nMối quan hệ giữa các khái niệm của quy luật chỉ ra rằng, mâu thuẫn giữa các mặt đối lập trong sự vật, hiện tượng là nguyên nhân, giải quyết mâu thuẫn đó là động lực của sự vận động, phát triển. Vì vậy, sự vận động, phát triển của sự vật, hiện tượng là tự thân. Khái quát lại, nội dung của quy luật thống nhất và đấu tranh của các mặt đối lập là: Mọi đối tượng đều bao gồm những mặt, những khuynh hướng, lực lượng... đối lập nhau tạo thành những mâu thuẫn trong chính nó; sự thống nhất và đấu tranh giữa các mặt đối lập này là nguyên nhân, động lực bên trong của sự vận động và phát triển, làm cho cái cũ mất đi và cái mới ra đời.\nÝ nghĩa phương pháp luận:\nThứ nhất, thừa nhận tính khách quan của mâu thuẫn trong sự vật, hiện tượng; từ đó giải quyết mâu thuẫn phải tuân theo quy luật, điều kiện khách quan. Muốn phát hiện mâu thuẫn cần tìm ra thể thống nhất của các mặt đối lập trong sự vật, hiện tượng; từ đó tìm ra phương hướng, giải pháp đúng cho hoạt động nhận thức và thực tiễn.\nThứ hai, phân tích mâu thuẫn cần bắt đầu từ việc xem xét quá trình phát sinh, phát triển của từng loại mâu thuẫn; xem xét vai trò, vị trí và mối quan hệ giữa các mâu thuẫn và điều kiện chuyển hóa giữa chúng. Phải biết phân tích cụ thể một mâu thuẫn cụ thể và đề ra được phương pháp giải quyết mâu thuẫn đó.\nThứ ba, phải nắm vững nguyên tắc giải quyết mâu thuẫn bằng đấu tranh giữa các mặt đối lập, không điều hòa mâu thuẫn cũng không nóng vội hay bảo thủ, bởi giải quyết mâu thuẫn còn phụ thuộc vào điều kiện đã đủ và chín muồi hay chưa.\n* Quy luật phủ định của phủ định\nLà một trong ba quy luật của phép biện chứng duy vật, quy luật phủ định của phủ định chỉ ra khuynh hướng (đi lên), hình thức (xoáy ốc), kết quả (sự vật, hiện tượng mới ra đời từ sự vật, hiện tượng cũ) của sự phát triển của chúng thông qua sự thống nhất giữa tính thay đổi với tính kế thừa trong sự phát triển; nghĩa là sự vật, hiện tượng mới ra đời từ sự vật, hiện tượng cũ, phát triển từ thấp đến cao, từ đơn giản đến phức tạp, từ kém hoàn thiện đến hoàn thiện hơn.\nPhủ định biện chứng là khái niệm dùng để chỉ sự phủ định làm tiền đề, tạo điều kiện cho sự phát triển. Phủ định biện chứng làm cho sự vật, hiện tượng mới ra đời thay thế sự vật, hiện tượng cũ và là yếu tố liên hệ giữa sự vật, hiện tượng cũ với sự vật, hiện tượng mới. Phủ định biện chứng là tự phủ định, tự phát triển của sự vật, hiện tượng; là “mắt xích” trong “sợi dây chuyền” dẫn đến sự ra đời của sự vật, hiện tượng mới, tiến bộ hơn so với sự vật, hiện tượng cũ.\nPhủ định biện chứng có tính khách quan (sự vật, hiện tượng tự phủ định mình do mâu thuẫn bên trong nó gây ra), tính kế thừa (loại bỏ các yếu tố không phù hợp và cải tạo các yếu tố của sự vật, hiện tượng cũ còn phù hợp để đưa vào sự vật, hiện tượng mới). Phủ định biện chứng còn có tính phổ biến (diễn ra trong mọi lĩnh vực tự nhiên, xã hội và tư duy); tính đa dạng, phong phú của phủ định biện chứng thể hiện ở nội dung, hình thức của nó. Đặc điểm cơ bản của phủ định biện chứng là sau một số (ít nhất là hai) lần phủ định, sự vật, hiện tượng phát triển có tính chu kỳ theo đường xoáy ốc mà thực chất của sự phát triển đó là sự biến đổi, trong đó giai đoạn sau vẫn bảo tồn những gì tích cực đã được tạo ra ở giai đoạn trước. Với đặc điểm này, phủ định biện chứng không chỉ khắc phục hạn chế của sự vật, hiện tượng cũ; mà còn gắn chúng với sự vật, hiện tượng mới; gắn sự vật, hiện tượng được khẳng định với sự vật, hiện tượng bị phủ định. Vì vậy, phủ định biện chứng là vòng khâu tất yếu của sự liên hệ và sự phát triển.\nKế thừa biện chứng là khái niệm dùng để chỉ sự vật, hiện tượng mới ra đời vẫn giữ lại có chọn lọc và cải tạo yếu tố còn thích hợp để chuyển sang chúng; loại bỏ các yếu tố không còn thích hợp của sự vật, hiện tượng cũ đang gây cản trở cho sự phát triển của sự vật, hiện tượng mới. Đặc điểm của kế thừa biện chứng là duy trì các yếu tố tích cực của sự vật, hiện tượng bị phủ định dưới dạng vượt bỏ, các yếu tố chọn giữ lại sẽ được cải tạo, biến đổi để phù hợp với sự vật, hiện tượng mới. Giá trị của sự kế thừa biện chứng chịu sự quy định bởi vai trò của yếu tố phù hợp được kế thừa; do vậy, việc giữ lại yếu tố tích cực của sự vật, hiện tượng bị phủ định làm cho sự vật, hiện tượng mới có chất giàu có hơn, phát triển cao hơn, tiến bộ hơn. Kế thừa biện chứng đối lập với kế thừa siêu hình, là việc đối tượng giữ lại nguyên si những gì bản thân nó đã có ở giai đoạn phát triển trước, không tự mình rũ bỏ những yếu tố đã tỏ ra lạc hậu hết thời, không còn phù hợp, thậm chí còn ngáng đường, ngăn cản sự phát triển tiếp theo của chính nó, của đối tượng mới.\nKế thừa biện chứng đảm bảo mối dây liên hệ thông suốt, bền chặt giữa đối tượng mới với đối tượng cũ, giữa nó với quá khứ của chính nó. Trong trường hợp này những yếu tố còn tỏ ra phù hợp với đối tượng mới từ đối tượng cũ nhưng vẫn cần phải chịu sự cải tạo mạnh mẽ cho phù hợp với bản chất mà đối tượng mới đang tạo lập và những yếu tố mới mà đối tượng mới đang ra sức xây dựng, bổ sung, là nội dung của khâu trung gian, của cái trung giới (Hegel), của bước chuyển, của sự quá độ từ cũ sang mới. Trong cái trung giới chứa đựng cả những yếu tố cũ, lỗi thời đang dần mất đi, và những yếu tố mới đang xuất hiện, đang trưởng thành và sẽ dần được khẳng định.\nDo vậy, đường xoáy ốc là khái niệm dùng để chỉ sự vận động của những nội dung mang tính kế thừa có trong sự vật, hiện tượng mới nên không thể đi theo đường thẳng, mà diễn ra theo đường tròn không nằm trên một mặt phẳng tựa như đường xoáy ốc. Đường xoáy ốc là hình thức diễn đạt rõ nhất đặc trưng của quá trình phát triển biện chứng ở tính kế thừa qua khâu trung gian, tính lặp lại, nhưng không quay lại và tính tiến lên của sự phát triển. V.I. Lênin khẳng định: “Sự phát triển hình như diễn lại những giai đoạn đã qua, nhưng dưới một hình thức khác, ở một trình độ cao hơn (“phủ định của phủ định”); sự phát triển có thể nói là theo đường trôn ốc chứ không theo đường thẳng”. Như vậy, sự phát triển dường như lặp lại, nhưng trên cơ sở mới cao hơn là đặc điểm quan trọng nhất của quy luật phủ định của phủ định. Mỗi vòng mới của đường xoáy ốc thể hiện trình độ phát triển cao hơn và sự nối tiếp nhau các vòng của đường xoáy ốc thể hiện tính vô tận của sự phát triển từ thấp đến cao.\nQuy luật phủ định của phủ định coi sự phát triển của sự vật, hiện tượng là do mâu thuẫn bên trong của chúng quy định. Mỗi lần phủ định là kết quả của sự đấu tranh và chuyển hóa giữa những mặt đối lập trong sự vật, hiện tượng. Phủ định lần thứ nhất làm cho sự vật, hiện tượng cũ chuyển thành sự vật, hiện tượng đối lập với nó; phủ định lần thứ hai dẫn đến sự ra đời của sự vật, hiện tượng mới mang nhiều nội dung tích cực của sự vật, hiện tượng cũ, nhưng cũng đã mang không ít nội dung đối lập với sự vật, hiện tượng đó. Kết quả là, về hình thức, sự vật, hiện tượng mới (ra đời do phủ định của phủ định) sẽ lại trở về sự vật, hiện tượng xuất phát (chưa bị phủ định lần nào), nhưng về nội dung, không phải trở lại chúng giống y như cũ, mà chỉ dường như lặp lại chúng, bởi đã trên cơ sở cao hơn. Phủ định biện chứng chỉ là một giai đoạn trong quá trình phát triển vì chỉ thông qua phủ định của phủ định mới dẫn đến sự ra đời của sự vật, hiện tượng mới, và như vậy, phủ định của phủ định mới hoàn thành được một chu kỳ phát triển, đồng thời lại tạo ra điểm xuất phát của chu kỳ phát triển tiếp theo. Số lượng các lần phủ định trong một chu kỳ phát triển có thể nhiều hơn hai, tùy theo tính chất của quá trình phát triển cụ thể, nhưng ít nhất cũng phải qua hai lần mới dẫn đến sự ra đời của sự vật, hiện tượng mới, hoàn thành được một chu kỳ phát triển. Mỗi lần phủ định biện chứng thực hiện xong sẽ mang thêm những yếu tố tích cực mới; do vậy, sự phát triển thông qua những lần phủ định biện chứng sẽ tạo ra xu hướng phát triển không ngừng của sự vật, hiện tượng. Do có sự kế thừa nên phủ định biện chứng không phải phủ định sạch trơn, không loại bỏ tất cả các yếu tố của sự vật, hiện tượng cũ, mà là điều kiện cho sự phát triển, duy trì và gìn giữ, lặp lại một số yếu tố tích cực của sự vật, hiện tượng mới sau khi đã được chọn lọc, cải tạo cho phù hợp và do vậy, sự phát triển của các sự vật, hiện tượng có quỹ đạo tiến lên như đường xoáy ốc.\nTóm lại, quy luật phủ định của phủ định phản ánh mối liên hệ, sự kế thừa thông qua khâu trung gian giữa cái bị phủ định và cái phủ định; do có kế thừa nên phủ định biện chứng không phải là sự phủ định sạch trơn mà là điều kiện cho sự phát triển, nó lưu giữ nội dung tích cực của các giai đoạn trước, lặp lại một số đặc điểm chủ yếu của cái ban đầu trên cơ sở mới cao hơn; do vậy, sự phát triển có tính chất tiến lên không hẳn theo đường thẳng, mà theo đường xoáy ốc.\nÝ nghĩa phương pháp luận:\nThứ nhất, quy luật này chỉ ra khuynh hướng tiến lên của sự vận động của sự vật, hiện tượng; sự thống nhất giữa tính tiến bộ và tính kế thừa của sự phát triển; sau khi đã trải qua các mắt xích chuyển hóa, có thể xác định được kết quả cuối cùng của sự phát triển.\nThứ hai, quy luật này giúp nhận thức đúng về xu hướng của sự phát triển, đó là quá trình diễn ra quanh co, phức tạp, không hề đều đặn thẳng tắp, không va vấp, không có những bước thụt lùi. Trái lại là không biện chứng, không khoa học, không đúng về mặt lý luận (V.I. Lênin).\nThứ ba, quy luật này giúp nhận thức đầy đủ hơn về sự vật, hiện tượng mới ra đời phù hợp với quy luật phát triển, biểu hiện giai đoạn cao về chất trong sự phát triển. Trong tự nhiên, sự xuất hiện của sự vật, hiện tượng mới diễn ra tự phát; nhưng trong xã hội, sự xuất hiện mới gắn với nhận thức và hành động có ý thức của con người.\nThứ tư, tuy sự vật, hiện tượng mới thắng sự vật, hiện tượng cũ, nhưng trong thời gian nào đó, sự vật, hiện tượng cũ còn mạnh hơn; vì vậy, cần ủng hộ sự vật, hiện tượng mới, tạo điều kiện cho nó phát triển hợp quy luật; biết kế thừa có chọn lọc những yếu tố tích cực và hợp lý của sự vật, hiện tượng cũ làm cho nó phù hợp với xu thế vận động và phát triển của sự vật, hiện tượng mới."
  }
]