[
  {
    "title": "IV- Ý THỨC XÃ HỘI",
    "level": 1,
    "body": "Đời sống xã hội có hai lĩnh vực quan trọng là lĩnh vực vật chất và lĩnh vực tinh thần, đó cũng chính là hai lĩnh vực tồn tại xã hội và ý thức xã hội. Vì vậy, cùng với việc phân tích các quy luật của sự phát triển xã hội, các quan hệ kinh tế và các quan hệ chính trị - xã hội thì không thể không chú trọng đến mặt quan trọng khác của đời sống xã hội là ý thức xã hội. Trong triết học Mác - Lênin, khái niệm ý thức xã hội gắn liền với khái niệm tồn tại xã hội."
  },
  {
    "title": "1. Khái niệm tồn tại xã hội và các yếu tố cơ bản của tồn tại xã hội",
    "level": 2,
    "body": ""
  },
  {
    "title": "a) Khái niệm tồn tại xã hội",
    "level": 3,
    "body": "Tồn tại xã hội là toàn bộ sinh hoạt vật chất và những điều kiện sinh hoạt vật chất của xã hội. Tồn tại xã hội của con người là thực tại xã hội khách quan, là một kiểu vật chất xã hội, là các quan hệ xã hội vật chất được ý thức xã hội phản ánh. Trong các quan hệ xã hội vật chất ấy thì quan hệ giữa con người với giới tự nhiên và quan hệ giữa con người với con người là những quan hệ cơ bản nhất."
  },
  {
    "title": "b) Các yếu tố cơ bản của tồn tại xã hội",
    "level": 3,
    "body": "Tồn tại xã hội bao gồm các yếu tố cơ bản là phương thức sản xuất vật chất, điều kiện tự nhiên, hoàn cảnh địa lý, dân số và mật độ dân số, v.v.; trong đó phương thức sản xuất vật chất là yếu tố cơ bản nhất. Trong Lời tựa của tác phẩm Góp phần phê phán khoa kinh tế chính trị, C. Mác viết: “Phương thức sản xuất đời sống vật chất quyết định các quá trình sinh hoạt xã hội, chính trị và tinh thần nói chung. Không phải ý thức của con người quyết định tồn tại của họ; trái lại, tồn tại xã hội của họ quyết định ý thức của họ”. Với khẳng định này, C. Mác đã khắc phục triệt để chủ nghĩa duy tâm, xây dựng quan điểm duy vật lịch sử về mối quan hệ giữa tồn tại xã hội và ý thức xã hội, về vai trò quyết định của tồn tại xã hội đối với ý thức xã hội. Tương tự như vậy, trước đó trong Hệ tư tưởng Đức, C. Mác và Ph. Ăngghen đã đi đến kết luận rằng, toàn bộ gốc rễ của sự phát triển xã hội loài người, kể cả ý thức của con người, đều nằm trong và bị quy định bởi sự phát triển của các điều kiện kinh tế - xã hội, nghĩa là “không phải ý thức quyết định đời sống mà chính đời sống quyết định ý thức”, “do đó ngay từ đầu, ý thức đã là một sản phẩm xã hội, và vẫn là như vậy chừng nào con người còn tồn tại”3. Đây chính là điểm cốt lõi của nguyên lý tồn tại xã hội quyết định ý thức xã hội.\nTồn tại xã hội không chỉ quyết định sự hình thành của ý thức xã hội mà còn quyết định cả nội dung và hình thức biểu hiện của nó. Mỗi yếu tố của tồn tại xã hội có thể được các hình thái ý thức xã hội khác nhau phản ánh từ các góc độ khác nhau theo những cách thức khác nhau. Tuy nhiên, đến lượt mình, các hình thái ý thức này cũng sẽ tác động, ảnh hưởng ngược trở lại tồn tại xã hội. Đó chính là tính độc lập tương đối của ý thức xã hội."
  },
  {
    "title": "2. Khái niệm, kết cấu, tính giai cấp, các hình thái của ý thức xã hội",
    "level": 2,
    "body": ""
  },
  {
    "title": "a) Khái niệm ý thức xã hội",
    "level": 3,
    "body": "Cùng với phạm trù tồn tại xã hội, ý thức xã hội là phạm trù của chủ nghĩa duy vật lịch sử được vận dụng để giải quyết vấn đề cơ bản của triết học trong lĩnh vực xã hội. Nếu “ý thức... không bao giờ có thể là cái gì khác hơn là sự tồn tại được ý thức” thì ý thức xã hội chính là xã hội tự nhận thức về mình, về sự tồn tại xã hội của mình và về hiện thực xung quanh mình. Nói cách khác, ý thức xã hội là mặt tinh thần của đời sống xã hội, là bộ phận hợp thành của văn hóa tinh thần của xã hội. Văn hóa tinh thần của xã hội mang nặng dấu ấn đặc trưng của hình thái kinh tế - xã hội, của các giai cấp đã tạo ra nó."
  },
  {
    "title": "b) Kết cấu của ý thức xã hội",
    "level": 3,
    "body": "Ý thức xã hội bao gồm tâm lý xã hội và hệ tư tưởng xã hội. Trong hệ tư tưởng xã hội, quan trọng nhất là các quan điểm, các học thuyết và các tư tưởng. Trong tâm lý xã hội có tình cảm, tâm trạng, truyền thống,... nảy sinh từ tồn tại xã hội và phản ánh tồn tại xã hội ở những giai đoạn phát triển nhất định. V.I. Lênin viết: “Ý thức xã hội phản ánh tồn tại xã hội, đó là học thuyết của Mác”. Tuy nhiên, sự phản ánh này không phải là sự phản ánh thụ động, bất động mà là một quá trình biện chứng phức tạp, là kết quả của mối quan hệ hoạt động, tích cực của con người đối với hiện thực.\nÝ thức xã hội mặc dù có mối quan hệ hữu cơ, biện chứng với ý thức cá nhân, cùng phản ánh tồn tại xã hội, song giữa ý thức xã hội và ý thức cá nhân vẫn có sự khác nhau tương đối vì chúng thuộc hai trình độ khác nhau.\nÝ thức cá nhân chính là thế giới tinh thần của các cá nhân riêng lẻ và cụ thể. Ý thức của các cá nhân khác nhau được quy định bởi những đặc điểm của cuộc sống riêng, của việc giáo dục và điều kiện hình thành nhân cách riêng của cá nhân. Dù ít dù nhiều, ý thức của các cá nhân khác nhau đều phản ánh tồn tại xã hội ở các mức độ khác nhau, song không phải bao giờ nó cũng đại diện cho quan điểm chung, phổ biến của một cộng đồng người, của một tập đoàn xã hội hay của một thời đại xã hội nhất định nào đó.\nVề mặt hình thức, ý thức xã hội phản ánh tồn tại xã hội dưới nhiều hình thức khác nhau. Sự đa dạng các hình thái ý thức xã hội là do tính nhiều mặt, nhiều vẻ và đa dạng của đời sống xã hội quy định; chúng phản ánh xã hội theo những cách thức khác nhau. Tùy thuộc vào góc độ xem xét, người ta thường chia ý thức xã hội thành ý thức xã hội thông thường, ý thức lý luận, tâm lý xã hội và hệ tư tưởng xã hội.\nÝ thức xã hội thông thường hay ý thức thường ngày là những tri thức, những quan niệm của con người hình thành một cách trực tiếp trong các hoạt động trực tiếp hằng ngày nhưng chưa được hệ thống hóa, chưa được tổng hợp và khái quát hóa.\nÝ thức lý luận hay ý thức khoa học là những tư tưởng, những quan điểm được tổng hợp, được hệ thống hóa và khái quát hóa thành các học thuyết xã hội dưới dạng các khái niệm, các phạm trù và các quy luật.\nÝ thức xã hội thông thường phản ánh một cách sinh động và trực tiếp các mặt khác nhau của cuộc sống hằng ngày của con người. Ý thức xã hội thông thường tuy ở trình độ thấp hơn ý thức lý luận nhưng lại phong phú hơn ý thức lý luận. Chính những tri thức kinh nghiệm phong phú của ý thức thông thường là chất liệu, là cơ sở và tiền đề quan trọng cho sự hình thành ý thức lý luận.\nÝ thức lý luận hay là ý thức khoa học có khả năng phản ánh hiện thực khách quan một cách sâu sắc, chính xác, bao quát và vạch ra được những mối liên hệ khách quan, bản chất, tất yếu mang tính quy luật của các sự vật và các quá trình xã hội. Đồng thời, ý thức khoa học có khả năng phản ánh vượt trước hiện thực.\nTâm lý xã hội là ý thức xã hội thể hiện trong ý thức cá nhân. Tâm lý xã hội bao gồm toàn bộ tư tưởng, tình cảm, tâm trạng, thói quen, nếp sống, nếp nghĩ, phong tục, tập quán, ước muốn, v.v. của một người, một tập đoàn người, một bộ phận xã hội hay của toàn thể xã hội hình thành dưới tác động trực tiếp của cuộc sống hằng ngày của họ và phản ánh cuộc sống đó.\nTâm lý xã hội cũng phản ánh một cách trực tiếp và tự phát những điều kiện sinh hoạt hằng ngày của con người, cho nên nó chỉ ghi lại những gì dễ thấy, những gì nằm trên bề mặt của tồn tại xã hội. Do vậy, khác với ý thức lý luận, tâm lý xã hội chưa đủ khả năng để vạch ra những mối liên hệ khách quan, bản chất, tất yếu mang tính quy luật của các sự vật và các quá trình xã hội. Mặc dù vậy, cần coi trọng vai trò của tâm lý xã hội trong việc phát triển ý thức xã hội, nhất là việc sớm nắm bắt những dư luận xã hội thể hiện trạng thái tâm lý và nhu cầu xã hội đa dạng của nhân dân trong những hoàn cảnh, điều kiện khác nhau.\nHệ tư tưởng là giai đoạn phát triển cao hơn của ý thức xã hội, là sự nhận thức lý luận về tồn tại xã hội. Hệ tư tưởng có khả năng đi sâu vào bản chất của mọi mối quan hệ xã hội; là kết quả của sự tổng kết, sự khái quát hóa các kinh nghiệm xã hội để hình thành nên những quan điểm, những tư tưởng về chính trị, pháp luật, triết học, đạo đức, nghệ thuật, tôn giáo, v.v..\nTrong lịch sử nhân loại đã và đang tồn tại cả hệ tư tưởng khoa học và hệ tư tưởng không khoa học. Nếu hệ tư tưởng không khoa học phản ánh các quan hệ vật chất một cách hư ảo, sai lầm hoặc xuyên tạc thì ngược lại, hệ tư tưởng khoa học phản ánh các quan hệ, các quá trình và hiện tượng xã hội một cách khách quan, chính xác. Cả hai loại hệ tư tưởng này đều có ảnh hưởng đối với sự phát triển của khoa học. Chẳng hạn, hệ tư tưởng không khoa học, nhất là triết học, đã từng kìm hãm sự phát triển của khoa học tự nhiên trong suốt hàng chục thế kỷ thời trung cổ ở châu Âu.\nMặc dù tâm lý xã hội và hệ tư tưởng thuộc hai trình độ khác nhau của ý thức xã hội nhưng chúng có mối liên hệ qua lại và tác động qua lại lẫn nhau. Nếu tâm lý xã hội có thể thúc đẩy hoặc cản trở sự hình thành và sự tiếp nhận một hệ tư tưởng nào đó; có thể giảm bớt sự xơ cứng hoặc công thức cứng nhắc của hệ tư tưởng, thì trái lại, hệ tư tưởng khoa học có thể bổ sung, làm gia tăng hàm lượng trí tuệ cho tâm lý xã hội, góp phần thúc đẩy tâm lý xã hội phát triển theo chiều hướng tích cực."
  },
  {
    "title": "c) Tính giai cấp của ý thức xã hội",
    "level": 3,
    "body": "Trong những xã hội có giai cấp, các giai cấp khác nhau có điều kiện vật chất khác nhau, có lợi ích và địa vị xã hội khác nhau thì ý thức xã hội của các giai cấp đó cũng khác nhau.\nTính giai cấp của ý thức xã hội biểu hiện cả ở tâm lý xã hội lẫn ở hệ tư tưởng. Nếu ở trình độ tâm lý xã hội, mỗi giai cấp xã hội đều có tình cảm, tâm trạng, thói quen, thiện cảm hay ác cảm riêng thì ở trình độ hệ tư tưởng tính giai cấp thể hiện rõ rệt và sâu sắc hơn nhiều. Ở trình độ này sự đối lập giữa các hệ tư tưởng của những giai cấp khác nhau thường không dung hòa nhau. Và khi đó, hệ tư tưởng thống trị trong xã hội là hệ tư tưởng của giai cấp thống trị. Về điều này C. Mác và Ph. Ăngghen viết: “Trong mọi thời đại, những tư tưởng của giai cấp thống trị là những tư tưởng thống trị. Điều đó có nghĩa là giai cấp nào là lực lượng vật chất thống trị trong xã hội thì cũng là lực lượng tinh thần thống trị trong xã hội. Giai cấp nào chi phối những tư liệu sản xuất vật chất thì cũng chi phối luôn cả những tư liệu sản xuất tinh thần”.\nHệ tư tưởng của giai cấp thống trị trong các xã hội có giai cấp đối kháng bao giờ cũng bảo vệ địa vị và lợi ích của giai cấp thống trị, của chế độ người bóc lột người. Trái lại, hệ tư tưởng của giai cấp bị trị bao giờ cũng bảo vệ quyền lợi của những người bị bóc lột, của đông đảo quần chúng nhân dân bị áp bức nhằm lật đổ chế độ người bóc lột người đó.\nTuy nhiên, khi khẳng định tính giai cấp của ý thức xã hội thì quan niệm duy vật về lịch sử cũng cho rằng, ý thức của các giai cấp trong xã hội có sự tác động qua lại với nhau. Không chỉ giai cấp bị thống trị chịu ảnh hưởng tư tưởng của giai cấp thống trị mà giai cấp thống trị cũng chịu ảnh hưởng tư tưởng của giai cấp bị thống trị. Điều này thường xảy ra trong giai đoạn phong trào cách mạng của giai cấp bị thống trị lên cao. Khi đó những người tiến bộ trong giai cấp thống trị, nhất là những trí thức, sẽ từ bỏ giai cấp xuất thân để chuyển sang hàng ngũ của giai cấp cách mạng. Lịch sử cho thấy, không ít những người trong số trí thức đó đã trở thành nhà tư tưởng của giai cấp cách mạng."
  },
  {
    "title": "d) Các hình thái ý thức xã hội",
    "level": 3,
    "body": "Các hình thái ý thức xã hội thể hiện các phương thức nắm bắt khác nhau về mặt tinh thần đối với hiện thực xã hội, bởi vậy, ý thức xã hội tồn tại dưới nhiều hình thái khác nhau. Những hình thái chủ yếu của ý thức xã hội bao gồm: ý thức chính trị, ý thức pháp quyền, ý thức đạo đức, ý thức thẩm mỹ (hay ý thức nghệ thuật), ý thức tôn giáo, ý thức lý luận (hay ý thức khoa học), ý thức triết học. Sự phong phú của các hình thái ý thức xã hội phản ánh sự phong phú của đời sống xã hội.\n* Ý thức chính trị\nHình thái ý thức chính trị phản ánh các mối quan hệ kinh tế của xã hội bằng ngôn ngữ chính trị cũng như mối quan hệ giữa các giai cấp, các dân tộc, các quốc gia và thái độ của các giai cấp đối với quyền lực nhà nước. Hình thái ý thức chính trị xuất hiện trong những xã hội có giai cấp và có nhà nước, vì vậy nó thể hiện trực tiếp và rõ nhất lợi ích giai cấp.\nÝ thức chính trị, nhất là hệ tư tưởng chính trị, có vai trò rất quan trọng đối với sự phát triển của xã hội, bởi vì, hệ tư tưởng chính trị thể hiện trong cương lĩnh chính trị, trong đường lối và các chính sách của đảng chính trị, pháp luật của nhà nước, đồng thời cũng là công cụ thống trị xã hội của giai cấp thống trị. Hệ tư tưởng chính trị tiến bộ sẽ thúc đẩy mạnh mẽ sự phát triển các mặt của đời sống xã hội; ngược lại, hệ tư tưởng chính trị lạc hậu, phản động sẽ kìm hãm, thậm chí kéo lùi sự phát triển đó.\nHệ tư tưởng chính trị giữ vai trò chủ đạo trong đời sống tinh thần của xã hội và xâm nhập vào tất cả các hình thái ý thức xã hội khác.\nTrong thời đại hiện nay, hệ tư tưởng của giai cấp công nhân là hệ tư tưởng tiến bộ, cách mạng và khoa học đang dẫn dắt giai cấp công nhân và nhân dân lao động đấu tranh nhằm xóa bỏ chế độ người bóc lột người, tiến tới xây dựng xã hội mới tốt đẹp hơn chế độ tư bản chủ nghĩa.\n* Ý thức pháp quyền\nÝ thức pháp quyền có mối liên hệ chặt chẽ với ý thức chính trị. Hình thái ý thức pháp quyền cũng phản ánh các mối quan hệ kinh tế của xã hội bằng ngôn ngữ pháp luật. Ph. Ăngghen viết rằng, ý thức “pháp quyền của người ta bắt nguồn từ những điều kiện sinh hoạt kinh tế của người ta”. Giống như ý thức chính trị, ý thức pháp quyền gần gũi với cơ sở kinh tế của xã hội hơn các hình thái ý thức xã hội khác. Cũng giống như ý thức chính trị, ý thức pháp quyền ra đời trong xã hội có giai cấp và có nhà nước, vì vậy nó cũng mang tính giai cấp. Do pháp luật là ý chí của giai cấp thống trị thể hiện thành luật lệ cho nên trong xã hội có giai cấp đối kháng thì thái độ và quan điểm của các giai cấp khác nhau đối với pháp luật cũng khác nhau.\nTrong xã hội có giai cấp, ý thức pháp quyền là toàn bộ những tư tưởng, quan điểm của một giai cấp về bản chất và vai trò của pháp luật, về quyền, trách nhiệm và nghĩa vụ của nhà nước, của các tổ chức xã hội và của công dân, về tính hợp pháp và không hợp pháp của hành vi con người trong xã hội.\nHệ tư tưởng pháp quyền tư sản coi pháp luật tư sản là biểu hiện cao nhất về quyền tự nhiên của con người. Song, sự thật là việc ra đời của các luật lệ tư sản cốt là để bảo vệ chế độ tư bản và trật tự của xã hội tư bản. Pháp luật và hệ tư tưởng pháp quyền xã hội chủ nghĩa dựa trên nền tảng tư tưởng của giai cấp công nhân là chủ nghĩa Mác - Lênin, phản ánh lợi ích của toàn thể nhân dân, bảo vệ nhà nước của dân, do dân và vì dân, bảo vệ chế độ xã hội chủ nghĩa. Vì vậy, việc đẩy mạnh và tăng cường công tác giáo dục ý thức pháp luật cho toàn dân là nhiệm vụ quan trọng, thường xuyên và lâu dài của cả hệ thống chính trị.\n* Ý thức đạo đức\nÝ thức đạo đức là toàn bộ những quan niệm về thiện, ác, tốt, xấu, lương tâm, trách nhiệm, nghĩa vụ, công bằng, hạnh phúc, v.v. và về những quy tắc đánh giá, những chuẩn mực điều chỉnh hành vi cùng cách ứng xử giữa các cá nhân với nhau và giữa các cá nhân với xã hội.\nLần đầu tiên chủ nghĩa Mác chỉ ra nguồn gốc hiện thực của sự ra đời các tư tưởng và nguyên tắc, tính lịch sử, tính giai cấp, vị trí và vai trò của đạo đức và ý thức đạo đức trong sự phát triển xã hội. Ph. Ăngghen viết: “Con người dù tự giác hay không tự giác, rút cuộc đều rút ra những quan niệm đạo đức của mình từ những quan hệ thực tiễn đang làm cơ sở cho vị trí giai cấp của mình, tức là từ những quan hệ kinh tế trong đó người ta sản xuất và trao đổi”. Khi xã hội xuất hiện giai cấp thì ý thức đạo đức hình thành và phát triển như một hình thái ý thức xã hội riêng.\nSự phát triển của hình thái ý thức đạo đức không tách rời sự phát triển của xã hội, phản ánh tồn tại xã hội dưới dạng các quy tắc điều chỉnh hành vi của con người. Sự tự ý thức của con người về lương tâm, trách nhiệm, nghĩa vụ, danh dự, v.v. nói lên sức mạnh của đạo đức, đồng thời cũng là biểu hiện bản chất xã hội của con người. Với ý nghĩa đó, sự phát triển của ý thức đạo đức là nhân tố biểu hiện sự tiến bộ của xã hội.\nÝ thức đạo đức bao gồm hệ thống những tri thức về giá trị và định hướng giá trị đạo đức; những tình cảm và lý tưởng đạo đức, trong đó tình cảm đạo đức là yếu tố quan trọng nhất, bởi vì, nếu không có tình cảm đạo đức thì tất cả những khái niệm, những phạm trù và tri thức đạo đức thu nhận được bằng con đường lý tính không thể chuyển hóa thành hành vi đạo đức.\nTrong các xã hội có giai cấp, những nội dung chủ yếu của đạo đức mang tính giai cấp. Ph. Ăngghen viết: “Xét cho đến cùng, mọi học thuyết về đạo đức đã có từ trước đến nay đều là sản phẩm của tình hình kinh tế của xã hội lúc bấy giờ. Và vì cho tới nay xã hội đã vận động trong những sự đối lập giai cấp, cho nên đạo đức cũng luôn luôn là đạo đức của giai cấp: hoặc là nó biện hộ cho sự thống trị và lợi ích của giai cấp thống trị, hoặc là, khi giai cấp bị trị trở nên khá mạnh thì nó tiêu biểu cho sự nổi dậy chống lại sự thống trị nói trên và tiêu biểu cho lợi ích tương lai của những người bị áp bức”. Giai cấp nào trong xã hội đang đi lên thì giai cấp đó sẽ đại diện cho xu hướng đạo đức tiến bộ trong xã hội. Ngược lại, giai cấp đang đi xuống, lụi tàn hoặc phản động đại diện cho xu hướng đạo đức suy thoái.\nTuy nhiên, từ xưa đến nay, trong tiến trình phát triển của lịch sử nhân loại, ở các hệ thống đạo đức khác nhau, vẫn có những yếu tố chung mang tính toàn nhân loại. Đó là những quy tắc ứng xử nhằm điều chỉnh hành vi của con người, nhằm duy trì trật tự xã hội hiện hành và các sinh hoạt thường ngày của con người trong cộng đồng xã hội. Những quy tắc chung mang tính toàn nhân loại này đã từng tồn tại từ rất lâu, và chắc chắn sẽ còn tồn tại lâu dài cùng với sự tồn tại của con người suốt trong lịch sử nhân loại.\nHiện nay, chúng ta đang sống trong điều kiện kinh tế thị trường, hội nhập quốc tế ngày càng sâu rộng và toàn cầu hóa, cho nên con người chịu sự tác động và ảnh hưởng không nhỏ của nhiều loại đạo đức khác nhau. Bên cạnh việc kế thừa và duy trì các giá trị tốt đẹp của đạo đức truyền thống của dân tộc, chúng ta cũng đang phải đối mặt với không ít những yếu tố tiêu cực, đối lập với các giá trị đạo đức truyền thống của dân tộc, đó là thói ích kỷ, tính thực dụng, lòng tham lam, tất cả vì đồng tiền, không trung thực, thiếu lý tưởng, sống gấp,... Vì vậy, trong giai đoạn hiện nay, nhiệm vụ giáo dục các giá trị đạo đức lành mạnh, tiến bộ là nhiệm vụ hết sức quan trọng, nhất là đối với thế hệ trẻ.\n* Ý thức nghệ thuật hay ý thức thẩm mỹ\nÝ thức nghệ thuật hay ý thức thẩm mỹ hình thành rất sớm, từ trước khi xã hội có sự phân chia giai cấp, cùng với sự ra đời của các hình thái nghệ thuật.\nGiống như các hình thái ý thức xã hội khác, ý thức thẩm mỹ phản ánh tồn tại xã hội. Tuy nhiên, nếu khoa học và triết học phản ánh thế giới bằng khái niệm, bằng phạm trù và quy luật, thì nghệ thuật phản ánh thế giới bằng hình tượng nghệ thuật. Hình tượng nghệ thuật là sự nhận thức, sự lĩnh hội cái chung trong cái riêng; là sự nhận thức cái bản chất trong các hiện tượng, cái phổ biến trong cái cá biệt nhưng mang tính điển hình.\nNghệ thuật không phải bao giờ cũng phản ánh hiện thực xã hội một cách trực tiếp, về điều này C. Mác viết: “Đối với nghệ thuật, người ta biết rằng những thời kỳ hưng thịnh nhất định của nó hoàn toàn không tương ứng với sự phát triển chung của xã hội, do đó cũng không tương ứng với sự phát triển của cơ sở vật chất của xã hội, cơ sở này dường như cấu thành cái xương sống của tổ chức xã hội”.\nNghệ thuật chân chính gắn với cuộc sống của nhân dân và các hình tượng nghệ thuật có giá trị thẩm mỹ cao đáp ứng những nhu cầu thẩm mỹ lành mạnh, đa dạng của nhiều thế hệ. Chúng có tác động tích cực đến sự trải nghiệm, xúc cảm, tình cảm, lý trí, là nhân tố kích thích mạnh mẽ hoạt động của con người và qua đó thúc đẩy sự tiến bộ xã hội. Nghệ thuật và những giá trị nghệ thuật cao đó còn có tác dụng giáo dục các thế hệ tương lai, góp phần hình thành ở họ thế giới quan và vốn văn hóa tiên tiến.\nTrong xã hội có phân chia giai cấp thì nghệ thuật mang tính giai cấp và chịu sự chi phối của các quan điểm chính trị, của các quan hệ kinh tế. Tuy nhiên, cũng như hình thái ý thức đạo đức, nghệ thuật và ý thức thẩm mỹ vẫn có những yếu tố mang tính toàn nhân loại, do vậy nhiều nền nghệ thuật, nhiều tác phẩm nghệ thuật, nhiều giá trị văn hóa vật thể và phi vật thể ở các giai đoạn lịch sử khác nhau, của các tác giả thuộc các giai cấp và các dân tộc khác nhau đã trở thành những giá trị văn hóa chung tiêu biểu, trường tồn và vô giá của nhân loại. Nghệ thuật tiến bộ đồng thời vừa phục vụ cho dân tộc mình, vừa phục vụ cho cả nhân loại; vừa phục vụ cho thế hệ hiện tại lẫn cho cả các thế hệ tương lai.\n* Ý thức tôn giáo\nCác nhà duy vật trước C. Mác mặc dù đã tìm nhiều cách khác nhau để giải thích nguồn gốc ra đời và bản chất của tôn giáo nhưng tất cả đều sai lầm. Đối với C. Mác và Ph. Ăngghen, tôn giáo có trước triết học; nó là một hình thái ý thức xã hội trực tiếp thể hiện thế giới quan của con người. Khác với tất cả các hình thái ý thức xã hội khác, tôn giáo là sự phản ánh hư ảo sức mạnh của giới tự nhiên bên ngoài lẫn các quan hệ xã hội vào đầu óc con người."
  },
  {
    "title": "C. Mác viết: “Trình độ phát triển thấp kém của những sức sản xuất của lao động và tính chất hạn chế tương ứng của các quan hệ của con người trong khuôn khổ quá trình sản xuất ra đời sống vật chất, tức là tính chất hạn chế của tất cả các mối quan hệ giữa người ta với nhau và với thiên nhiên... đã phản ánh vào trong những tôn giáo cổ đại, thần thánh hóa thiên nhiên, và vào trong tín ngưỡng của nhân dân”. Tương tự như vậy, Ph. Ăngghen chỉ rõ: “Tất cả mọi tôn giáo chẳng qua chỉ là sự phản ánh hư ảo - vào trong đầu óc của con người - của những lực lượng ở bên ngoài chi phối cuộc sống hằng ngày của họ; chỉ là sự phản ánh trong đó những lực lượng ở trần thế đã mang hình thức những lực lượng siêu trần thế”.",
    "level": 1,
    "body": "Theo C. Mác và Ph. Ăngghen, cần phải tìm nguồn gốc của tôn giáo cả trong quan hệ của con người với tự nhiên lẫn trong các quan hệ xã hội của con người. Như vậy, những sức mạnh của tự nhiên và các lực lượng xã hội hiện thực được thần bí hóa chính là nguồn gốc thật sự của tôn giáo. Sự sợ hãi trước sức mạnh của tự nhiên, sự bất lực trước các thế lực xã hội đã tạo ra thần linh."
  },
  {
    "title": "C. Mác và Ph. Ăngghen, V.I. Lênin nhấn mạnh nguồn gốc xã hội của tôn giáo: “Trong các nước tư bản chủ nghĩa hiện nay, những nguồn gốc ấy của tôn giáo chủ yếu là những nguồn gốc xã hội... “Sự sợ hãi đã tạo ra thần linh”. Sợ hãi trước thế lực mù quáng của tư bản, - mù quáng vì quần chúng nhân dân không thể đoán trước được nó, - là thế lực bất cứ lúc nào trong đời sống của người vô sản và người tiểu chủ, cũng đe dọa đem lại cho họ và đang đem lại cho họ sự phá sản “đột ngột”, “bất ngờ”, “ngẫu nhiên”, làm cho họ phải diệt vong, biến họ thành một người ăn xin, một kẻ bần cùng, một gái điếm, và dồn họ vào cảnh chết đói, đó chính là nguồn gốc sâu xa của tôn giáo hiện đại mà người duy vật phải chú ý đến trước hết và trên hết, nếu người ấy không muốn cứ mãi mãi là một người duy vật sơ đẳng”.",
    "level": 1,
    "body": "Khi quần chúng lao động bị áp bức, bị bóc lột, bị dồn đến bước đường cùng, không tìm ra lối thoát dưới trần gian thì họ đi tìm lối thoát đó ở thế giới bên kia, V.I. Lênin viết: “Sự bất lực của giai cấp bị bóc lột trong cuộc đấu tranh chống bọn bóc lột tất nhiên đẻ ra lòng tin vào một cuộc đời tốt đẹp hơn ở thế giới bên kia, cũng giống y như sự bất lực của người dã man trong cuộc đấu tranh chống thiên nhiên đẻ ra lòng tin vào thần thánh, ma quỷ, vào những phép mầu, v.v..”.\nTôn giáo với tư cách là một hình thái ý thức xã hội gồm có tâm lý tôn giáo và hệ tư tưởng tôn giáo. Tâm lý tôn giáo là toàn bộ những biểu tượng, tình cảm, tâm trạng của quần chúng về tín ngưỡng tôn giáo. Hệ tư tưởng tôn giáo là hệ thống giáo lý được các nhà thần học và các chức sắc giáo sĩ tôn giáo tạo dựng và truyền bá trong xã hội. Tâm lý tôn giáo và hệ tư tưởng tôn giáo có quan hệ chặt chẽ với nhau. Tâm lý tôn giáo tạo cơ sở cho hệ tư tưởng tôn giáo dễ dàng xâm nhập vào quần chúng.\nChức năng chủ yếu của ý thức tôn giáo là chức năng đền bù hư ảo. Chức năng này làm cho tôn giáo có sức sống lâu dài trong xã hội, gây ra ảo tưởng về sự đền bù ở thế giới bên kia những gì mà con người không thể đạt được trong cuộc sống hiện thực mà con người đang sống. Vì vậy, hình thái ý thức xã hội này mang tính chất tiêu cực, cản trở sự nhận thức đúng đắn của con người về thế giới, về xã hội, về bản thân mình để rồi luôn luôn bị các giai cấp thống trị lợi dụng. Theo quan điểm của chủ nghĩa Mác, muốn xóa bỏ tôn giáo thì phải xóa bỏ nguồn gốc xã hội của nó; đồng thời phải nâng cao năng lực nhận thức, trình độ học vấn của con người.\n* Ý thức lý luận hay ý thức khoa học\nKhoa học hình thành và phát triển ở một giai đoạn nhất định của sự phát triển xã hội, của nhu cầu sản xuất xã hội và sự phát triển năng lực tư duy của con người. Khoa học là sự khái quát cao nhất của thực tiễn, là phương thức nắm bắt tất cả các hiện tượng của hiện thực, cung cấp những tri thức chân thực về bản chất các hiện tượng, các quá trình, các quy luật của tự nhiên và của xã hội. Vì vậy, khoa học và tôn giáo là những hiện tượng đối lập với nhau về bản chất. Tôn giáo thù địch với lý trí con người, trong khi đó khoa học lại là sản phẩm cao nhất của lý trí và là sức mạnh của con người. Nếu ý thức tôn giáo là sự phản ánh hư ảo sức mạnh của giới tự nhiên bên ngoài lẫn các quan hệ xã hội vào đầu óc con người thì ý thức khoa học phản ánh hiện thực một cách chân thực và chính xác dựa vào sự thật và lý trí của con người. Khác với tất cả các hình thái ý thức xã hội khác, ý thức khoa học phản ánh sự vận động và sự phát triển của giới tự nhiên, của xã hội loài người và của tư duy con người bằng tư duy lôgích, thông qua hệ thống các khái niệm, các phạm trù, các quy luật và các lý thuyết.\nNếu ý thức tôn giáo hướng con người vào thế giới những ảo tưởng, siêu tự nhiên thì, trái lại, ý thức khoa học có nhiệm vụ cao cả là hướng con người vào việc biến đổi hiện thực, cải tạo thế giới nhằm phục vụ cho nhu cầu cuộc sống nhiều mặt và ngày càng tốt hơn, cao hơn của con người. Cùng với sự phát triển của lịch sử nhân loại, vai trò của khoa học ngày càng tăng lên, đặc biệt là trong giai đọan hiện nay khi tri thức khoa học, cả tri thức về tự nhiên lẫn tri thức về xã hội và về con người, đang trở thành lực lượng sản xuất trực tiếp, khi nhân loại bước vào thời đại phát triển mạnh mẽ của công nghệ kỹ thuật số và trí tuệ nhân tạo. Cùng với đó, khoa học đang góp phần quan trọng vào việc giải quyết các vấn đề toàn cầu của thời đại, ngăn chặn những tác động xấu do sự vô ý thức và sự tham lam của con người trong quá trình phát triển kinh tế.\n* Ý thức triết học\nHình thức đặc biệt và cao nhất của tri thức cũng như của ý thức xã hội là triết học. Nếu như các ngành khoa học riêng lẻ nghiên cứu thế giới từ các khía cạnh, từ những mặt nhất định của thế giới đó thì triết học, nhất là triết học Mác - Lênin, cung cấp cho con người tri thức về thế giới như một chỉnh thể thông qua việc tổng kết toàn bộ lịch sử phát triển của khoa học và của chính bản thân triết học. Vì vậy, khi đánh giá mối liên hệ của tinh thần với triết học, Hegel khẳng định rằng, “xét từ góc độ của tinh thần chúng ta có thể gọi triết học chính là cái cần thiết nhất”.\nĐặc biệt, với C. Mác thì “vì mọi triết học chân chính đều là tinh hoa về mặt tinh thần của thời đại mình (T.G nhấn mạnh), nên nhất định sẽ có thời kỳ mà triết học, không chỉ về bên trong, theo nội dung của nó, mà cả về bên ngoài, theo sự biểu hiện của nó, sẽ tiếp xúc và tác động qua lại tới thế giới hiện thực của thời đại của mình. Lúc đó, triết học sẽ không còn là một hệ thống nhất định đối với các hệ thống nhất định khác, nó trở thành triết học nói chung đối với thế giới, trở thành triết học của thế giới hiện đại. Những biểu hiện bên ngoài chứng minh rằng triết học đã có ý nghĩa khiến cho nó trở thành linh hồn sống của văn hóa... (T.G nhấn mạnh)”.\nĐồng thời, với tư cách là một hình thái ý thức xã hội, triết học nói chung và nhất là triết học duy vật biện chứng nói riêng có sứ mệnh trở thành thế giới quan, mà cơ sở và hạt nhân của thế giới quan chính là tri thức. Chính thế giới quan đó giúp con người trả lời cho các câu hỏi được nhân loại từ xưa đến nay thường xuyên đặt ra cho mình. Chẳng hạn, thế giới xung quanh ta là gì? Thế giới ấy có điểm bắt đầu và điểm kết thúc hay không? Sức mạnh nào chi phối sự tồn tại và biến đổi đó? Con người là gì, sinh ra từ đâu và có quan hệ như thế nào với thế giới ấy? Cuộc sống của con người có ý nghĩa gì? Con người có vị trí nào trong thế giới đó?, v.v.. Như vậy, thế giới quan triết học bao hàm trong nó cả nhân sinh quan. Trong thời đại hiện nay, thế giới quan khoa học chân chính nhất chính là thế giới quan triết học duy vật biện chứng. Triết học duy vật biện chứng có vai trò to lớn để nhận thức đúng đắn ý nghĩa và vai trò của các hình thái ý thức xã hội khác; để xác định đúng vị trí của những hình thái ấy trong cuộc sống của xã hội, để nhận thức tính quy luật cùng những đặc điểm, sự phát triển của chúng."
  },
  {
    "title": "3. Quan hệ biện chứng giữa tồn tại xã hội và ý thức xã hội, tính độc lập tương đối của ý thức xã hội",
    "level": 2,
    "body": "Quan điểm duy vật lịch sử khẳng định rằng, ý thức xã hội và tồn tại xã hội có mối quan hệ biện chứng; rằng, các hình thái ý thức xã hội không phải là những yếu tố thụ động; trái lại, mỗi hình thái ý thức xã hội đều có sự tác động ngược trở lại tồn tại xã hội, trước hết là tác động trở lại cơ sở kinh tế. Đồng thời, các hình thái ý thức xã hội cũng tác động lẫn nhau theo những cách thức khác nhau. Tồn tại xã hội nào thì có ý thức xã hội ấy. Tồn tại xã hội quyết định nội dung, tính chất, đặc điểm, xu hướng vận động, sự biến đổi và sự phát triển của các hình thái ý thức xã hội. Nếu xã hội còn tồn tại sự phân chia giai cấp thì ý thức xã hội nhất định cũng mang tính giai cấp. Khi tồn tại xã hội, nhất là phương thức sản xuất thay đổi thì những tư tưởng, quan điểm về chính trị, pháp luật, triết học và cả quan điểm thẩm mỹ lẫn đạo đức dù sớm hay muộn cũng sẽ có những sự thay đổi nhất định. Tuy nhiên, ý thức xã hội không phải là yếu tố hoàn toàn thụ động hoặc tiêu cực. Mặc dù chịu sự quy định và chi phối của tồn tại xã hội nhưng ý thức xã hội không những có tính độc lập tương đối, có thể tác động trở lại mạnh mẽ đối với tồn tại xã hội, mà đặc biệt ý thức xã hội còn có thể vượt trước tồn tại xã hội, thậm chí có thể vượt trước rất xa tồn tại xã hội.\nCác hình thái ý thức xã hội có đặc điểm chung là mặc dù bị tồn tại xã hội quy định, song đều có tính độc lập tương đối.\nTính độc lập tương đối của ý thức xã hội thể hiện ở những điểm sau đây:\n* Ý thức xã hội thường lạc hậu hơn tồn tại xã hội\nLịch sử xã hội loài người cho thấy, nhiều khi xã hội cũ đã mất đi rất lâu, song ý thức xã hội do xã hội đó sản sinh ra vẫn tiếp tục tồn tại. Điều này biểu hiện rõ nhất ở các khía cạnh khác nhau của tâm lý xã hội như truyền thống, thói quen và nhất là tập quán. V.I. Lênin cho rằng: “sức mạnh của tập quán ở hàng triệu và hàng chục triệu người là một sức mạnh ghê gớm nhất”. Còn Ph. Ăngghen khi nói rằng, “chúng ta đau khổ không những vì những người đang sống mà còn vì những người đã chết nữa. Người chết nắm lấy người sống” cũng là theo nghĩa này.\nNhững nguyên nhân làm cho ý thức xã hội thường lạc hậu hơn tồn tại xã hội là do:\nTrước hết, do tác động mạnh mẽ và nhiều mặt trong hoạt động thực tiễn của con người nên tồn tại xã hội diễn ra với tốc độ nhanh hơn khả năng phản ánh của ý thức xã hội.\nThứ hai, do sức mạnh của thói quen, tập quán, truyền thống và do cả tính bảo thủ của hình thái ý thức xã hội. Hơn nữa, những điều kiện tồn tại xã hội mới cũng chưa đủ để làm cho những thói quen, tập quán và truyền thống cũ hoàn toàn mất đi.\nThứ ba, ý thức xã hội gắn liền với lợi ích của những tập đoàn người, của các giai cấp nào đó trong xã hội. Các tập đoàn hay giai cấp lạc hậu thường níu kéo, bám chặt vào những tư tưởng lạc hậu để bảo vệ và duy trì quyền lợi ích kỷ của họ, để chống lại các lực lượng tiến bộ trong xã hội.\nVì vậy, muốn xây dựng xã hội mới nhất định phải từng bước xóa bỏ được những tàn dư, những tư tưởng và ý thức xã hội cũ song song với việc bồi đắp, xây dựng và phát triển ý thức xã hội mới. Tuy nhiên, khi thực hiện những nhiệm vụ này thì không được nóng vội, không được dùng các biện pháp hành chính như đã từng xảy ra ở các nước xã hội chủ nghĩa.\n* Ý thức xã hội có thể vượt trước tồn tại xã hội\nTriết học Mác - Lênin thừa nhận rằng, ý thức xã hội thường lạc hậu hơn tồn tại xã hội nhưng cũng có thể vượt trước tồn tại xã hội. Thực tế, trong những điều kiện nhất định, nhiều tư tưởng khoa học và triết học có thể vượt trước tồn tại xã hội của thời đại rất xa. Sở dĩ ý thức xã hội có khả năng đó là do nó phản ánh đúng những mối liên hệ lôgích, khách quan, tất yếu, bản chất của tồn tại xã hội. Lịch sử đã cho thấy nhiều dự báo của các nhà tư tưởng lớn phải sau một thời gian, có thể ngắn hoặc rất dài, mới được thực tiễn xác nhận. Nhiều dự báo của C. Mác đang trở thành sự thật trong thời đại chúng ta đã hoàn toàn khẳng định điều đó. Chẳng hạn, dự báo tri thức trở thành lực lượng sản xuất trực tiếp đang được thực tiễn của cuộc cách mạng chuyển đổi công nghệ số, thời đại trí tuệ nhân tạo hay cách mạng khoa học và công nghệ hiện đại, thời đại kinh tế tri thức xác nhận. Đặc biệt, khi đánh giá rằng, xã hội tư bản “hoàn toàn không phải là một khối kết tinh vững chắc, mà là một cơ thể có khả năng biến đổi và luôn luôn ở trong quá trình biến đổi” thì chính C. Mác đã chỉ ra các quy luật vận động tất yếu của xã hội và cũng đã dự báo về sự thay thế không thể tránh khỏi của phương thức sản xuất tư bản chủ nghĩa bằng phương thức sản xuất cao hơn - phương thức sản xuất cộng sản chủ nghĩa.\nVì vậy, trong thời đại chúng ta, chủ nghĩa Mác - Lênin vẫn đang là thế giới quan và phương pháp luận chung nhất cho sự nhận thức, cho công cuộc cải tạo hiện thực.\n* Ý thức xã hội có tính kế thừa\nTiến trình phát triển đời sống tinh thần của xã hội loài người cho thấy rằng, các quan điểm lý luận, các tư tưởng lớn của thời đại sau bao giờ cũng dựa vào những tiền đề đã có từ các giai đoạn lịch sử trước đó. Chính C. Mác và Ph. Ăngghen cũng đã thừa nhận rằng: “ngay cả chủ nghĩa cộng sản phát triển cũng trực tiếp bắt nguồn từ chủ nghĩa duy vật Pháp”. Và, “nếu trước đó không có triết học Đức, đặc biệt là triết học Hêghen, thì sẽ không bao giờ có chủ nghĩa xã hội khoa học Đức, chủ nghĩa xã hội duy nhất khoa học tồn tại từ trước đến nay”. Vì vậy, hoàn toàn hợp quy luật rằng, chủ nghĩa Mác không chỉ đã tiếp thu tất cả những gì là tinh hoa trong lịch sử văn minh nhân loại mà còn kế thừa trực tiếp từ nền triết học cổ điển Đức, kinh tế chính trị học Anh và chủ nghĩa xã hội không tưởng Pháp.\nTrong sự phát triển của mình, ý thức xã hội có tính kế thừa nên không thể giải thích một tư tưởng nào đó nếu chỉ dựa vào trình độ, hiện trạng phát triển kinh tế và các quan hệ kinh tế - xã hội. Chẳng hạn, trình độ phát triển kinh tế của nước Pháp vào thế kỷ XVIII kém xa nước Anh nhưng tư tưởng lý luận của nước Pháp tiên tiến hơn nước Anh nhiều. Tương tự như vậy, kinh tế nước Đức vào đầu thế kỷ XIX kém xa nước Anh và nước Pháp, nhưng nền triết học của nước Đức thì vượt xa hai nước kia. Điều đó chứng tỏ rằng, sự phát triển của ý thức xã hội không phải bao giờ cũng song hành với sự phát triển kinh tế và các quan hệ kinh tế.\nTuy nhiên, cần lưu ý rằng, trong các xã hội có giai cấp thì các giai cấp khác nhau sẽ kế thừa những di sản khác nhau của những giai đoạn trước. Giai cấp tiến bộ đang lên sẽ chọn kế thừa những tư tưởng tiến bộ của thời đại trước; trái lại, giai cấp lỗi thời, đi xuống bao giờ cũng chọn tiếp thu những tư tưởng và lý thuyết bảo thủ, phản tiến bộ để cố gắng tìm cách duy trì sự thống trị của mình. Điển hình về mặt này là giai cấp tư sản vào nửa sau thế kỷ XIX, đầu thế kỷ XX đã phục hồi và truyền bá chủ nghĩa Kant mới và chủ nghĩa Thomas mới để chống lại phong trào cách mạng đang lên của giai cấp vô sản, để chống lại chủ nghĩa Mác vốn là cơ sở của phong trào ấy.\nQuan điểm của triết học Mác - Lênin về tính kế thừa của ý thức xã hội có ý nghĩa to lớn đối với sự nghiệp xây dựng văn hóa tinh thần của dân tộc ta hiện nay.\n* Sự tác động qua lại giữa các hình thái ý thức xã hội\nCác hình thái ý thức xã hội phản ánh tồn tại xã hội theo những cách khác nhau, có vai trò khác nhau trong xã hội và trong đời sống của con người. Tuy nhiên, ở các thời đại lịch sử khác nhau, trong những hoàn cảnh khác nhau dù vai trò của các hình thái ý thức xã hội không giống nhau nhưng chúng vẫn có sự tác động qua lại với nhau.\nNếu ở thời Hy Lạp cổ đại, vào khoảng thế kỷ V trước Công nguyên, ý thức triết học và ý thức nghệ thuật có vai trò đặc biệt to lớn; ở các nước Tây Âu thời trung cổ, ý thức tôn giáo tác động rất mạnh và chi phối các hình thái ý thức khác như ý thức chính trị, ý thức pháp quyền, ý thức triết học, ý thức đạo đức, ý thức nghệ thuật thì ở nước Pháp nửa sau thế kỷ XVIII và ở nước Đức cuối thế kỷ XVIII đầu thế kỷ XIX, triết học và văn học đóng vai trò quan trọng nhất trong việc truyền bá các tư tưởng chính trị và pháp quyền, là vũ khí tư tưởng và lý luận trong cuộc đấu tranh chính trị chống lại các thế lực cầm quyền của các lực lượng xã hội tiến bộ. Trong các tác phẩm văn học, nghệ thuật nổi tiếng thời kỳ này thấm đượm sâu sắc các tư tưởng và suy tư triết học về thế giới và về con người. Tuy nhiên, từ sau thời kỳ trung cổ và phong kiến, nhất là trong thế giới đương đại, ý thức chính trị ngày càng đóng vai trò quan trọng và chi phối mạnh mẽ các hình thái ý thức khác.\n* Ý thức xã hội tác động trở lại tồn tại xã hội\nTồn tại xã hội chịu sự tác động trở lại của ý thức xã hội là một biểu hiện khác của tính độc lập tương đối của ý thức xã hội.\nPh. Ăngghen viết: “Sự phát triển của chính trị, pháp luật, triết học, tôn giáo, văn học, nghệ thuật, v.v. đều dựa trên cơ sở sự phát triển kinh tế. Nhưng tất cả chúng cũng có ảnh hưởng lẫn nhau và ảnh hưởng đến cơ sở kinh tế. Vấn đề hoàn toàn không phải là chỉ có hoàn cảnh kinh tế mới là nguyên nhân, chỉ có nó là tích cực, còn tất cả những cái còn lại đều chỉ là hậu quả thụ động”.\nQuan niệm duy vật về lịch sử thừa nhận biểu hiện này về tính độc lập tương đối của ý thức xã hội đối lập hoàn toàn cả với chủ nghĩa duy tâm tuyệt đối hóa vai trò của ý thức xã hội lẫn chủ nghĩa duy vật tầm thường chỉ coi trọng vai trò của kinh tế, còn phủ nhận hoàn toàn vai trò tích cực của ý thức xã hội. Ý thức xã hội cũng có vai trò nhất định. Về điều này Ph. Ăngghen viết: “Những tiền đề và điều kiện kinh tế, rốt cục giữ vai trò quyết định. Nhưng những điều kiện chính trị, v.v., ngay cả những truyền thống tồn tại trong đầu óc con người cũng đóng một vai trò nhất định, tuy không phải là vai trò quyết định”.\nSự tác động trở lại đối với tồn tại xã hội của các hình thái ý thức xã hội mạnh hay yếu còn phụ thuộc vào những điều kiện lịch sử cụ thể, vào các quan hệ kinh tế vốn là cơ sở hình thành các hình thái ý thức xã hội; vào trình độ phản ánh và sức lan tỏa của ý thức đối với các nhu cầu khác nhau của sự phát triển xã hội; đặc biệt là vào vai trò lịch sử của giai cấp đại diện cho ngọn cờ tư tưởng đó. Vì vậy, cần phân biệt ý thức xã hội tiến bộ với ý thức xã hội lạc hậu, cản trở sự tiến bộ xã hội."
  }
]