[
  {
    "title": "II- GIAI CẤP VÀ DÂN TỘC",
    "level": 1,
    "body": ""
  },
  {
    "title": "1. Giai cấp và đấu tranh giai cấp",
    "level": 2,
    "body": "Lý luận về giai cấp và đấu tranh giai cấp là một trong những nội dung căn bản nhất của chủ nghĩa Mác - Lênin, kết quả tất nhiên của sự vận dụng và mở rộng chủ nghĩa duy vật biện chứng vào xem xét lĩnh vực xã hội. Lần đầu tiên trong lịch sử, các nhà kinh điển của chủ nghĩa Mác đã luận giải một cách khoa học vấn đề giai cấp. Trong thư gửi G. Vâyđơmayơ ngày 5/3/1852, C. Mác đã khái quát lý luận về giai cấp của mình rất ngắn gọn, khoa học và đầy đủ như sau: “Cái mới mà tôi đã làm là chứng minh rằng: 1) sự tồn tại của các giai cấp chỉ gắn với những giai đoạn phát triển lịch sử nhất định của sản xuất, 2) đấu tranh giai cấp tất yếu dẫn đến chuyên chính vô sản, 3) bản thân nền chuyên chính này chỉ là bước quá độ tiến tới thủ tiêu mọi giai cấp và tiến tới xã hội không có giai cấp”.\nLý luận về giai cấp và đấu tranh giai cấp đã và đang là cơ sở lý luận, phương pháp luận khoa học để các đảng cộng sản và giai cấp công nhân trên thế giới xác định đường lối chiến lược, sách lược trong cuộc đấu tranh thực hiện thắng lợi sứ mệnh lịch sử của mình."
  },
  {
    "title": "a) Giai cấp",
    "level": 3,
    "body": "* Định nghĩa\nTrong lịch sử, phần lớn các nhà triết học, xã hội học trước C. Mác, đặc biệt là các nhà triết học và xã hội học tư sản đều thừa nhận sự tồn tại thực tế của các giai cấp. Song, do hạn chế về nhiều mặt, đặc biệt là hạn chế về nhận thức, về lập trường giai cấp, họ đã không thể lý giải một cách khoa học về hiện tượng phức tạp này của lịch sử. Theo họ, giai cấp là tập hợp những người có cùng một chức năng xã hội, cùng một lối sống hoặc mức sống, cùng một địa vị và uy tín xã hội, v.v.. Các lý thuyết đó dựa trên những tiêu chuẩn lựa chọn một cách chủ quan để thay thế cho những đặc trưng khách quan của giai cấp. Về thực chất, họ tránh đụng đến các vấn đề cơ bản, đặc biệt là vấn đề sở hữu tư liệu sản xuất chủ yếu của xã hội, mưu toan làm mờ sự khác biệt giai cấp và đối kháng giai cấp nhằm biện hộ cho sự tồn tại của các giai cấp thống trị, bóc lột."
  },
  {
    "title": "C. Mác nghiên cứu về giai cấp từ việc phân tích kết cấu phương thức sản xuất với cách tiếp cận khoa học: lấy lý luận về hình thái kinh tế - xã hội làm cơ sở nghiên cứu xã hội. C. Mác đã đi tìm cái gốc của cơ cấu xã hội, cơ cấu giai cấp đó là kinh tế. Theo C. Mác, sự phân chia xã hội thành giai cấp là kết quả tất nhiên của sự phát triển lịch sử xã hội. Quan hệ giai cấp chính là biểu hiện về mặt xã hội của những quan hệ sản xuất, trong đó tập đoàn người này có thể bóc lột lao động của tập đoàn người khác. Vì vậy, chỉ có thể hiểu đúng vấn đề giai cấp khi gắn nó với đời sống kinh tế, với nền sản xuất vật chất xã hội.",
    "level": 1,
    "body": "Kế thừa và phát triển tư tưởng của C. Mác và Ph. Ăngghen, trong tác phẩm Sáng kiến vĩ đại, V.I. Lênin đã đưa ra một định nghĩa khoa học về giai cấp: “Được gọi là giai cấp, là những tập đoàn người to lớn, khác nhau về địa vị của họ trong một hệ thống sản xuất xã hội nhất định trong lịch sử, về quan hệ của họ đối với những tư liệu sản xuất (thường thì những quan hệ này được pháp luật quy định và thừa nhận), về vai trò của họ trong tổ chức lao động xã hội, và do đó khác nhau về cách thức hưởng thụ phần của cải xã hội ít hay nhiều mà họ được hưởng. Giai cấp là những tập đoàn người, mà một tập đoàn có thể chiếm đoạt lao động của các tập đoàn khác, do địa vị khác nhau của họ trong một chế độ kinh tế xã hội nhất định”.\nĐịnh nghĩa của V.I. Lênin đã chỉ ra các đặc trưng cơ bản của giai cấp, sau đây:\nTrước hết, giai cấp là những tập đoàn người có địa vị kinh tế - xã hội khác nhau. Giai cấp là những tập đoàn người đông đảo, không phải là những cá nhân riêng lẻ, mà những tập đoàn này khác nhau về địa vị kinh tế - xã hội, tức là khác nhau về vị trí, vai trò trong một hệ thống sản xuất xã hội nhất định trong lịch sử. Địa vị kinh tế - xã hội của giai cấp do toàn bộ các điều kiện tồn tại kinh tế - vật chất của xã hội quy định, do vậy mang tính khách quan, mặc dù giai cấp đó hoặc mỗi thành viên của giai cấp có ý thức được hay không. Mỗi cá nhân khi sinh ra không tự lựa chọn cho mình địa vị kinh tế - xã hội được. Địa vị của các giai cấp là do phương thức sản xuất nhất định sinh ra và quy định. Địa vị của mỗi giai cấp trong một hệ thống sản xuất xã hội nhất định nói lên giai cấp đó là giai cấp thống trị hay giai cấp bị thống trị. Trong một hệ thống sản xuất xã hội nhất định thường tồn tại cả phương thức sản xuất thống trị, phương thức sản xuất tàn dư và phương thức sản xuất mầm mống. Địa vị kinh tế - xã hội của một giai cấp là do giai cấp ấy đại diện cho phương thức sản xuất nào trong hệ thống sản xuất xã hội đó quy định. Giai cấp thống trị và giai cấp bị trị trong xã hội chiếm hữu nô lệ là chủ nô và nô lệ; trong xã hội phong kiến là địa chủ và nông dân; trong xã hội tư bản chủ nghĩa là tư sản và vô sản. Đó là những giai cấp đại diện cho bản chất của phương thức sản xuất thống trị ở từng giai đoạn lịch sử. Sự vận động, phát triển của các phương thức sản xuất có thể làm cho địa vị kinh tế - xã hội của mỗi giai cấp cũng biến đổi theo sự biến đổi của vai trò các phương thức sản xuất trong xã hội. Ví dụ khi hệ thống sản xuất tư bản chủ nghĩa trong một xã hội đã phát triển thì giai cấp địa chủ đại diện cho phương thức sản xuất phong kiến (tàn dư) sẽ không còn là giai cấp thống trị nữa.\nPhương thức sản xuất xã hội là cơ sở hiện thực đưa tới sự ra đời của các giai cấp. Tuy nhiên, không phải bất cứ phương thức sản xuất nào trong lịch sử cũng sản sinh ra giai cấp, mà chỉ có những phương thức sản xuất chứa đựng những điều kiện vật chất tạo ra sự đối lập về lợi ích giữa các tập đoàn người mới sản sinh ra giai cấp. Trong lịch sử xã hội loài người, các phương thức sản xuất chứa đựng những điều kiện vật chất cho sự tồn tại các giai cấp đối kháng là phương thức sản xuất chiếm hữu nô lệ, phương thức sản xuất phong kiến, phương thức sản xuất tư bản chủ nghĩa.\nDấu hiệu chủ yếu quy định địa vị kinh tế - xã hội của các giai cấp là các mối quan hệ kinh tế - vật chất giữa các tập đoàn người trong phương thức sản xuất. Các mối quan hệ kinh tế - vật chất cơ bản giữa người với người trong phương thức sản xuất là quan hệ sở hữu đối với tư liệu sản xuất; quan hệ tổ chức quản lý sản xuất và quan hệ phân phối của cải xã hội. Các mối quan hệ chủ yếu này đã quy định địa vị kinh tế - xã hội khác nhau của các tập đoàn người. Đây chính là các dấu hiệu khách quan chủ yếu quyết định địa vị kinh tế - xã hội của các giai cấp trong xã hội, hình thành nên giai cấp thống trị và giai cấp bị trị.\nCác giai cấp khác nhau về vai trò của họ trong các mối quan hệ kinh tế - vật chất cơ bản. Quan hệ sở hữu quy định giai cấp nào nắm quyền sở hữu (định đoạt) và giai cấp nào không có quyền sở hữu tư liệu sản xuất chủ yếu. Quan hệ tổ chức, quản lý sản xuất quy định giai cấp nào có quyền quản lý (tổ chức, điều hành, phân công lao động...) và giai cấp nào không có quyền tổ chức, quản lý sản xuất. Quan hệ phân phối của cải xã hội quy định phương thức hưởng thụ (sản phẩm, địa tô, giá trị thặng dư...) và quy mô hưởng thụ (nhiều hoặc ít) của cải xã hội của các giai cấp. Trong những quan hệ trên, quan hệ đối với tư liệu sản xuất là quan hệ cơ bản và chủ yếu nhất quyết định trực tiếp đến địa vị kinh tế - xã hội của các giai cấp, bởi vì, giai cấp nào nắm giữ tư liệu sản xuất tức là nắm được phương tiện vật chất chủ yếu của nền sản xuất xã hội và theo đó sẽ nắm giữ luôn vai trò chi phối trong tổ chức quản lý sản xuất và phân phối sản phẩm lao động, giai cấp đó trở thành giai cấp thống trị, bóc lột. Các giai cấp khác do không có tư liệu sản xuất, buộc phải phụ thuộc vào giai cấp có tư liệu sản xuất và trở thành các giai cấp bị thống trị, bị bóc lột. Quan hệ sản xuất vật chất không chỉ quy định vai trò của các tập đoàn người trong lĩnh vực kinh tế, mà còn là cơ sở chủ yếu quy định vai trò của họ trong các lĩnh vực chính trị, văn hóa, xã hội của đời sống xã hội.\nThực chất của quan hệ giai cấp là tập đoàn người này chiếm đoạt lao động của tập đoàn người khác do đối lập về địa vị trong một chế độ kinh tế - xã hội nhất định. Trong xã hội, các quan hệ giữa các tập đoàn người trong sản xuất, đặc biệt là quan hệ sở hữu, thường được nhà nước của giai cấp thống trị thể chế hóa thành luật pháp, được ra sức bảo vệ bằng một hệ thống kiến trúc thượng tầng chính trị - pháp lý. Giai cấp nào thống trị về kinh tế, giai cấp đó cũng giữ luôn vai trò thống trị trên các lĩnh vực khác của đời sống xã hội và trở thành giai cấp thống trị xã hội. Thực chất của quan hệ giai cấp là tập đoàn người này chiếm đoạt lao động của tập đoàn người khác do đối lập về địa vị trong một chế độ kinh tế - xã hội nhất định, tức là quan hệ giữa bóc lột và bị bóc lột. Sự đối lập về lợi ích cơ bản giữa các giai cấp là nguyên nhân căn bản của mọi xung đột xã hội từ khi lịch sử xã hội loài người có sự phân chia thành các giai cấp cho đến ngày nay. Do vậy, các giai cấp từ chỗ khác nhau về vị trí, vai trò trong hệ thống sản xuất, dẫn đến khác nhau về vị trí, vai trò trong chế độ kinh tế - xã hội. Ví dụ, trong xã hội tư bản chủ nghĩa, giai cấp tư sản và giai cấp vô sản do khác nhau về vị trí, vai trò trong hệ thống sản xuất xã hội, dẫn đến đối lập nhau về địa vị trong chế độ kinh tế - xã hội, trở thành hai giai cấp thống trị - bị trị.\nĐịnh nghĩa giai cấp của V.I. Lênin cho thấy, giai cấp là một phạm trù kinh tế - xã hội có tính lịch sử, sự tồn tại của nó gắn với những hệ thống sản xuất xã hội dựa trên cơ sở của chế độ tư hữu về tư liệu sản xuất. Sự xuất hiện và tồn tại của giai cấp xét đến cùng là do nguyên nhân kinh tế. Tuy nhiên, không được biến định nghĩa giai cấp thành một phạm trù kinh tế đơn thuần. Chỉ có thể xem xét các giai cấp trong hệ thống những mối quan hệ xã hội đa dạng, phức tạp và không ngừng vận động, biến đổi mới có thể nhận thức một cách đầy đủ và sâu sắc sự khác biệt của các giai cấp về kinh tế, chính trị, tư tưởng, tâm lý, đạo đức, lối sống... Song cơ sở khoa học để xem xét các mối quan hệ đó, theo V.I. Lênin, không thể có gì khác hơn là phân tích chế độ kinh tế đã sản sinh ra các giai cấp đó và địa vị cụ thể của mỗi giai cấp trong một chế độ kinh tế - xã hội nhất định.\nĐịnh nghĩa giai cấp của V.I. Lênin mang bản chất cách mạng và khoa học, có giá trị to lớn về lý luận và thực tiễn. Đây là cơ sở để nhận thức đúng đắn vị trí, vai trò, bản chất của các giai cấp trong lịch sử; đồng thời trang bị cho giai cấp vô sản cơ sở lý luận khoa học để nhận thức được vai trò lịch sử của giai cấp vô sản trong cuộc đấu tranh xóa bỏ giai cấp và xây dựng xã hội mới.\n* Nguồn gốc của giai cấp\nGiai cấp là một hiện tượng xã hội xuất hiện lâu dài trong lịch sử gắn với những điều kiện sản xuất vật chất nhất định của xã hội. Các nhà kinh điển của chủ nghĩa Mác - Lênin đã chứng minh được rằng, nguồn gốc của sự xuất hiện và mất đi của những giai cấp cụ thể và của xã hội có giai cấp đều dựa trên tính tất yếu kinh tế, “gắn với những giai đoạn phát triển lịch sử nhất định của sản xuất”.\nTrong xã hội cộng sản nguyên thủy, do lực lượng sản xuất chưa phát triển, nên năng suất lao động còn rất thấp kém. Vì vậy, làm chung, hưởng chung trở thành phương thức chủ yếu để duy trì sự tồn tại và phát triển của xã hội cộng sản nguyên thủy. Điều kiện sản xuất lúc bấy giờ không cho phép và không thể có sự phân chia xã hội thành giai cấp được. Ph. Ăngghen chỉ rõ, trong xã hội cộng sản nguyên thủy tất cả đều bình đẳng và tự do, chưa có nô lệ và thường thường còn chưa có sự nô dịch những bộ lạc khác.\nCuối xã hội nguyên thủy, lực lượng sản xuất phát triển lên một trình độ mới do con người biết sử dụng công cụ sản xuất bằng kim loại và do thường xuyên cải tiến công cụ sản xuất, v.v.. Sự phát triển của lực lượng sản xuất dẫn đến năng suất lao động tăng lên và xuất hiện “của dư” trong xã hội. Sự xuất hiện “của dư” không chỉ tạo khả năng cho những người này chiếm đoạt lao động của những người khác, mà còn là nguyên nhân trực tiếp dẫn tới phân công lao động xã hội phát triển. Sự phát triển của phân công lao động xã hội làm cho hoạt động trao đổi sản phẩm trở thành tất yếu, thường xuyên và phổ biến. Đến lượt mình, sự phát triển của phân công lao động và trao đổi lại là những nhân tố kích thích mạnh mẽ sự phát triển của sản xuất vật chất xã hội. Tình trạng sản xuất lúc bấy giờ cho thấy, sản xuất cộng đồng nguyên thủy không còn phù hợp nữa, sản xuất gia đình cá thể trở thành hình thức sản xuất có hiệu quả hơn. Các gia đình có tài sản riêng ngày càng nhiều, trong công xã xuất hiện sự chênh lệch về tài sản. Chế độ tư hữu về tư liệu sản xuất dần dần được hình thành thay thế cho chế độ công hữu nguyên thủy về tư liệu sản xuất. Trong điều kiện ấy, những người có chức, có quyền trong thị tộc, bộ lạc lợi dụng địa vị của mình chiếm đoạt tài sản của công xã làm của riêng. Sự phát triển tiếp theo của sản xuất vật chất từng bước phân hóa xã hội thành những tập đoàn người có sự đối lập về địa vị kinh tế - xã hội và giai cấp xuất hiện. Sự xuất hiện xã hội có giai cấp cũng là một bước tiến của lịch sử gắn liền với sự phát triển của sản xuất vật chất.\nNghiên cứu sự tan rã của các thị tộc, bộ lạc trong xã hội cộng sản nguyên thủy, Ph. Ăngghen đi đến kết luận: “Trong những điều kiện lịch sử lúc đó, sự phân công xã hội lớn đầu tiên, do tăng năng suất lao động, tức là tăng của cải và do mở rộng lĩnh vực hoạt động sản xuất, nhất định phải đưa đến chế độ nô lệ. Từ sự phân công xã hội lớn lần đầu tiên, đã nảy sinh ra sự phân chia lớn đầu tiên trong xã hội thành hai giai cấp: chủ nô và nô lệ, kẻ bóc lột và người bị bóc lột”. Sự ra đời và mất đi của một hệ thống giai cấp này hay hệ thống giai cấp khác không phải do nguyên nhân chính trị hay tư tưởng mà là nguyên nhân kinh tế.\nNhư vậy, nguyên nhân sâu xa của sự xuất hiện giai cấp là sự phát triển của lực lượng sản xuất làm cho năng suất lao động tăng lên, xuất hiện “của dư”, tạo khả năng khách quan, tiền đề cho tập đoàn người này chiếm đoạt lao động của tập đoàn người khác. Nguyên nhân trực tiếp đưa tới sự ra đời của giai cấp là xã hội xuất hiện chế độ tư hữu về tư liệu sản xuất. Chế độ tư hữu về tư liệu sản xuất là cơ sở trực tiếp của sự hình thành các giai cấp. Và chừng nào, ở đâu còn tồn tại chế độ tư hữu về tư liệu sản xuất thì ở đó còn có sự tồn tại của các giai cấp và đấu tranh giai cấp. Giai cấp chỉ mất đi khi chế độ tư hữu về tư liệu sản xuất hoàn toàn bị xóa bỏ.\nTheo các nhà kinh điển mácxít, con đường hình thành giai cấp rất phức tạp: Những người có chức, có quyền lợi dụng quyền lực để chiếm đoạt tài sản công làm của riêng; tù binh bắt được trong chiến tranh được sử dụng làm nô lệ để sản xuất; các tầng lớp xã hội tự do trao đổi, bị phân hóa thành các giai cấp khác nhau... Từ xã hội cộng sản nguyên thủy sang chế độ chiếm hữu nô lệ là cả một bước quá độ lâu dài từ chế độ công hữu sang chế độ tư hữu về tư liệu sản xuất; từ chưa có giai cấp sang có giai cấp. Điều kiện góp phần đẩy nhanh quá trình phân hóa giai cấp là các cuộc chiến tranh, những thủ đoạn cướp bóc, những hành vi bạo lực trong xã hội... Xã hội cộng sản nguyên thủy tan rã, xã hội chiếm hữu nô lệ là xã hội có giai cấp đầu tiên trong lịch sử ra đời, xuất hiện khoảng 3 - 5 nghìn năm trước.\n* Kết cấu xã hội - giai cấp\nKết cấu xã hội - giai cấp là tổng thể các giai cấp và mối quan hệ giữa các giai cấp, tồn tại trong một giai đoạn lịch sử nhất định. Kết cấu xã hội - giai cấp trước hết do trình độ phát triển của phương thức sản xuất xã hội quy định. Trong xã hội có giai cấp, kết cấu xã hội - giai cấp thường rất đa dạng do tính đa dạng của chế độ kinh tế và cơ cấu kinh tế quy định.\nTrong một kết cấu xã hội - giai cấp bao giờ cũng gồm hai giai cấp cơ bản và những giai cấp không cơ bản, hoặc các tầng lớp xã hội trung gian. Giai cấp cơ bản là giai cấp gắn với phương thức sản xuất thống trị, là sản phẩm của những phương thức sản xuất thống trị nhất định. Đó là giai cấp chủ nô và nô lệ trong xã hội chiếm hữu nô lệ; giai cấp địa chủ và nông dân trong xã hội phong kiến; giai cấp tư sản và vô sản trong xã hội tư bản chủ nghĩa.\nNhững giai cấp không cơ bản là những giai cấp gắn với phương thức sản xuất tàn dư, hoặc mầm mống trong xã hội. Những giai cấp không cơ bản gắn với phương thức sản xuất tàn dư, như nô lệ trong buổi đầu xã hội phong kiến; địa chủ và nông nô trong buổi đầu xã hội tư bản... Những giai cấp không cơ bản gắn với phương thức sản xuất mầm mống, như tiểu chủ, tiểu thương, tư sản, vô sản trong giai đoạn cuối xã hội phong kiến... Thông thường các giai cấp do phương thức sản xuất tàn dư của xã hội sản sinh ra, sẽ tàn lụi dần cùng với sự phát triển của xã hội; các giai cấp do phương thức sản xuất mầm mống sản sinh ra chính là mặt phủ định xã hội cũ. Trong quá trình phát triển của lịch sử, các giai cấp cơ bản và không cơ bản có thể có sự chuyển hóa do sự phát triển và thay thế nhau của các phương thức sản xuất.\nTrong xã hội có giai cấp, ngoài những giai cấp cơ bản và không cơ bản còn có các tầng lớp và nhóm xã hội nhất định (như tầng lớp trí thức, nhân sĩ, giới tu hành...). Mặc dù các tầng lớp, nhóm xã hội không có địa vị kinh tế độc lập, song nó có vai trò quan trọng trong sự phát triển của xã hội nói chung và tùy thuộc vào điều kiện lịch sử cụ thể mà nó có thể phục vụ cho giai cấp này, hoặc giai cấp khác. Các tầng lớp xã hội này luôn bị phân hóa dưới tác động của sự vận động nền sản xuất vật chất xã hội.\nKết cấu xã hội - giai cấp luôn có sự vận động và biến đổi không ngừng. Sự vận động, biến đổi đó diễn ra không chỉ khi xã hội có sự chuyển biến các phương thức sản xuất, mà cả trong quá trình phát triển của mỗi phương thức sản xuất.\nPhân tích kết cấu xã hội - giai cấp và khuynh hướng vận động, phát triển của nó có ý nghĩa cực kỳ quan trọng cả về lý luận và thực tiễn trong điều kiện hiện nay. Phân tích khoa học kết cấu xã hội - giai cấp giúp cho chính đảng của giai cấp vô sản xác định đúng các mâu thuẫn cơ bản, mâu thuẫn chủ yếu của xã hội; nhận thức đúng địa vị, vai trò và thái độ chính trị của mỗi giai cấp. Trên cơ sở đó để xác định đối tượng và lực lượng cách mạng; nhiệm vụ và giai cấp lãnh đạo cách mạng, v.v.."
  },
  {
    "title": "b) Đấu tranh giai cấp",
    "level": 3,
    "body": "* Tính tất yếu và thực chất của đấu tranh giai cấp\nTổng kết thực tiễn lịch sử một cách sâu rộng, trên cơ sở quan điểm duy vật biện chứng về xã hội, C. Mác và Ph. Ăngghen khẳng định: “Lịch sử tất cả các xã hội tồn tại từ trước đến ngày nay chỉ là lịch sử đấu tranh giai cấp. Người tự do và người nô lệ, quý tộc và bình dân, chúa đất và nông nô, thợ cả phường hội và thợ bạn, nói tóm lại, những kẻ áp bức và những người bị áp bức, luôn luôn đối kháng với nhau, đã tiến hành một cuộc đấu tranh không ngừng, lúc công khai, lúc ngấm ngầm, một cuộc đấu tranh bao giờ cũng kết thúc hoặc bằng một cuộc cải tạo cách mạng toàn bộ xã hội, hoặc bằng sự diệt vong của hai giai cấp đấu tranh với nhau”. (Ph. Ăngghen chú thích cho lần xuất bản bằng tiếng Anh năm 1888 là toàn bộ lịch sử thành văn cho tới nay).\nKế thừa và phát triển tư tưởng của C. Mác và Ph. Ăngghen trong điều kiện mới của lịch sử, V.I. Lênin chỉ rõ: “Đấu tranh giai cấp là gì? Đấu tranh gia cấp là đấu tranh của bộ phận nhân dân này chống một bộ phận khác, cuộc đấu tranh của quần chúng bị tước hết quyền, bị áp bức và lao động, chống bọn có đặc quyền đặc lợi, bọn áp bức và bọn ăn bám, cuộc đấu tranh của những người công nhân làm thuê hay những người vô sản chống những người hữu sản hay giai cấp tư sản”.\nNhư vậy, các nhà kinh điển đã chỉ ra tính tất yếu và thực chất của đấu tranh giai cấp trong xã hội có đối kháng giai cấp.\nĐấu tranh giai cấp là tất yếu, do sự đối lập về lợi ích căn bản không thể điều hòa được giữa các giai cấp. Trong xã hội có giai cấp, đấu tranh giai cấp là quy luật tất yếu của xã hội. Tính tất yếu của đấu tranh giai cấp xuất phát từ tính tất yếu kinh tế, nguyên nhân là do sự đối kháng về lợi ích cơ bản giữa giai cấp bị trị và giai cấp thống trị. Đấu tranh giai cấp là một hiện tượng lịch sử khách quan, không phải do một lý thuyết xã hội nào tạo ra, cũng không phải do ý muốn chủ quan của một lực lượng xã hội hay một cá nhân nào nghĩ ra. Ở đâu và khi nào còn áp bức, bóc lột, thì ở đó và khi đó còn đấu tranh giai cấp chống lại áp bức, bóc lột. Thực tiễn lịch sử của xã hội loài người đã và đang chứng minh điều đó.\nĐấu tranh giai cấp là cuộc đấu tranh của các tập đoàn người to lớn có lợi ích căn bản đối lập nhau trong một phương thức sản xuất xã hội nhất định.\nTrong xã hội có giai cấp, đấu tranh giai cấp chủ yếu và trước hết là cuộc đấu tranh của hai giai cấp cơ bản đại diện cho phương thức sản xuất thống trị trong xã hội (nô lệ và chủ nô, nông dân và địa chủ, vô sản và tư sản). Đó là các giai cấp có lợi ích căn bản đối lập nhau. Cuộc đấu tranh giữa hai giai cấp cơ bản trong một xã hội là những cuộc đấu tranh giai cấp điển hình, đặc trưng cho chế độ xã hội đó. Về cơ bản các giai cấp, tầng lớp xã hội còn lại đều có lợi ích ít, nhiều gắn với việc đánh đổ giai cấp thống trị bóc lột. Song do lợi ích giữa các tập đoàn là hết sức khác nhau, nên thái độ của các giai cấp tham gia vào cuộc đấu tranh chung không giống nhau. Chỉ có giai cấp đại diện cho phương thức sản xuất mới và quần chúng cùng khổ là lực lượng tham gia đông đảo, tích cực nhất. Cuộc đấu tranh của các giai cấp cơ bản là trục chính thu hút các giai cấp không cơ bản và các tầng lớp trung gian trong xã hội tham gia.\nThực chất của đấu tranh giai cấp là cuộc đấu tranh của quần chúng lao động bị áp bức, bóc lột chống lại giai cấp áp bức, bóc lột nhằm lật đổ ách thống trị của chúng.\nTrong xã hội có đối kháng giai cấp, thực chất đấu tranh giai cấp là cuộc đấu tranh của quần chúng lao động bị áp bức, bóc lột chống lại giai cấp áp bức, bóc lột do sự đối lập về lợi ích không thể dung hòa trong một chế độ kinh tế - xã hội nhất định.\nCác giai cấp bị trị, bị bóc lột không chỉ bị chiếm đoạt kết quả lao động mà còn bị áp bức về chính trị, xã hội và tinh thần. Giai cấp thống trị, bóc lột bao giờ cũng ra sức bảo vệ địa vị giai cấp cùng với những đặc quyền, đặc lợi của mình bằng quyền lực chính trị và bộ máy nhà nước. Đấu tranh giai cấp để giải quyết mâu thuẫn không thể dung hòa giữa các giai cấp tất yếu dẫn đến cách mạng xã hội nhằm lật đổ ách thống trị của giai cấp áp bức, bóc lột. Đây là điểm khác nhau căn bản giữa quan điểm của những người cách mạng với những người cơ hội chủ nghĩa. Cách mạng xã hội là phương thức tất yếu để lật đổ ách thống trị của giai cấp thống trị bóc lột, xóa bỏ quan hệ sản xuất cũ, xây dựng quan hệ sản xuất mới và mở đường cho lực lượng sản xuất phát triển. Mục đích cao nhất mà một cuộc đấu tranh giai cấp cần đạt được không phải là đánh đổ một giai cấp cụ thể, mà là giải phóng lực lượng sản xuất khỏi sự kìm hãm của những quan hệ sản xuất đã lỗi thời, tạo điều kiện để đẩy nhanh sự phát triển của lực lượng sản xuất và phát triển xã hội.\nĐấu tranh giai cấp không phải là hiện tượng vĩnh viễn trong lịch sử. Cuộc đấu tranh giai cấp giữa các giai cấp trong lịch sử tất yếu phát triển đến cuộc đấu tranh giai cấp của giai cấp vô sản. Đây là cuộc đấu tranh giai cấp cuối cùng trong lịch sử. Trong cuộc đấu tranh này, giai cấp vô sản đứng lên giành chính quyền, thiết lập nền chuyên chính của mình và thông qua nền chuyên chính đó tiến hành cải tạo triệt để xã hội cũ, tiến tới xóa bỏ mọi đối kháng giai cấp, xây dựng thành công xã hội cộng sản chủ nghĩa.\nTrong đấu tranh giai cấp, liên minh giai cấp là tất yếu. Liên minh giai cấp là sự liên kết giữa những giai cấp này để chống lại những giai cấp khác. Liên minh giai cấp là vấn đề có ý nghĩa cực kỳ quan trọng để tập hợp và phát triển lực lượng trong các cuộc đấu tranh giai cấp. Cơ sở của liên minh giai cấp là sự thống nhất về lợi ích cơ bản. Liên minh giai cấp có tính chiến lược lâu dài khi các giai cấp có lợi ích căn bản thống nhất với nhau. Ngược lại, sẽ là sách lược tạm thời khi dựa trên cơ sở sự thống nhất về những lợi ích trước mắt không cơ bản. Đấu tranh giai cấp và liên minh giai cấp luôn gắn bó hữu cơ với nhau. Đó là hai mặt của một quá trình để tạo nên sức mạnh nhằm giành thắng lợi trong cuộc đấu tranh giai cấp.\n* Vai trò của đấu tranh giai cấp trong sự phát triển của xã hội có giai cấp\nTrong xã hội có giai cấp, đấu tranh giai cấp là động lực trực tiếp, quan trọng của lịch sử. C. Mác và Ph. Ăngghen luôn nhấn mạnh vai trò của đấu tranh giai cấp, đặc biệt là cuộc đấu tranh giai cấp giữa giai cấp tư sản và giai cấp vô sản. Hai ông khẳng định: “Trong gần 40 năm chúng ta đưa lên hàng đầu cuộc đấu tranh giai cấp, coi đó là động lực trực tiếp của lịch sử, và đặc biệt là cuộc đấu tranh giai cấp giữa giai cấp tư sản và giai cấp vô sản với tính cách là đòn bẩy mạnh mẽ của cuộc cách mạng xã hội ngày nay”.\nSự phát triển của xã hội là kết quả của sự tác động biện chứng giữa lực lượng sản xuất và quan hệ sản xuất. Khi lực lượng sản xuất có sự phát triển cả về tính chất và trình độ, mâu thuẫn với quan hệ sản xuất đã lỗi thời, lạc hậu, đòi hỏi phải phá bỏ quan hệ sản xuất cũ. Trong xã hội có giai cấp, mâu thuẫn này được biểu hiện về mặt xã hội thành mâu thuẫn giữa các giai cấp cơ bản có lợi ích đối lập nhau trong một phương thức sản xuất. Quan hệ sản xuất lỗi thời khi trở thành xiềng xích trói buộc sự phát triển của lực lượng sản xuất không tự động mất đi, nó được các giai cấp thống trị, phản động ra sức bảo vệ bằng bạo lực, bằng kiến trúc thượng tầng chính trị, bằng pháp luật và tư tưởng, v.v.. Trong các giai cấp bị bóc lột, bị thống trị tất yếu có một giai cấp đại biểu cho lực lượng sản xuất phát triển. Lợi ích căn bản của họ đòi hỏi phải xóa bỏ quan hệ sản xuất cũ, xây dựng quan hệ sản xuất mới, “tạo địa bàn phát triển” cho lực lượng sản xuất. Đấu tranh giai cấp đạt tới đỉnh cao thường dẫn đến cách mạng xã hội. Thông qua cách mạng xã hội mà quan hệ sản xuất cũ được xóa bỏ, quan hệ sản xuất mới phù hợp với trình độ phát triển của lực lượng sản xuất được xác lập. Khi cơ sở kinh tế mới đã hình thành, phát triển thì kiến trúc thượng tầng mới sớm hay muộn cũng ra đời, phát triển theo, xã hội thực hiện bước chuyển từ hình thái kinh tế - xã hội thấp lên hình thái kinh tế - xã hội cao hơn, tiến bộ hơn.\nVai trò là động lực của đấu tranh giai cấp còn được thể hiện trong những thời kỳ tiến hóa xã hội. Ngay trong phạm vi vận động của một hình thái kinh tế - xã hội, đấu tranh giai cấp thường xuyên tác động thúc đẩy sự phát triển mọi mặt của đời sống xã hội. Thực tiễn cho thấy, sự phát triển của kinh tế, chính trị, văn hóa và ngay cả tư tưởng, lý luận của xã hội, v.v. đều là sản phẩm ít hoặc nhiều mang dấu ấn của cuộc đấu tranh giai cấp. Đấu tranh giai cấp không những cải tạo xã hội, xóa bỏ các lực lượng xã hội phản động, mà còn cải tạo bản thân các giai cấp cách mạng. Thông qua thực tiễn đấu tranh giai cấp, giai cấp cách mạng có sự trưởng thành về mọi mặt, phải tự nâng mình lên đáp ứng được yêu cầu của lịch sử.\nĐấu tranh giai cấp là động lực phát triển của xã hội có giai cấp. Song vai trò là động lực của các cuộc đấu tranh giai cấp trong lịch sử không giống nhau. Vai trò của đấu tranh giai cấp đến mức độ nào đó phụ thuộc vào quy mô, tính chất của các nhiệm vụ kinh tế, chính trị, xã hội mà mỗi cuộc đấu tranh giai cấp phải giải quyết. Cuộc đấu tranh giai cấp của giai cấp vô sản chống giai cấp tư sản là cuộc đấu tranh giai cấp cuối cùng trong lịch sử. Do tính chất, quy mô rộng lớn và triệt để của các nhiệm vụ mà nó phải giải quyết, vì vậy đấu tranh giai cấp của giai cấp vô sản là “đòn bẩy vĩ đại nhất” trong lịch sử xã hội có giai cấp.\nĐấu tranh giai cấp là động lực phát triển của xã hội, nhưng không phải là động lực sâu xa và động lực duy nhất mà là một động lực trực tiếp và quan trọng. Vì vậy, trong đấu tranh cách mạng cần phải xác định hệ thống các động lực của xã hội, có nghệ thuật sử dụng những động lực đó để giải phóng giai cấp và thúc đẩy xã hội phát triển.\nThực tế lịch sử cho thấy, cuộc đấu tranh của giai cấp nô lệ chống lại giai cấp chủ nô đã dẫn tới sự sụp đổ của chế độ chiếm hữu nô lệ; cuộc đấu tranh của giai cấp tư sản liên minh với các giai cấp khác đã dẫn tới cách mạng tư sản, chấm dứt thời trung cổ kéo dài hàng nghìn năm; cuộc đấu tranh của giai cấp công nhân liên minh với giai cấp nông dân và các lực lượng tiến bộ chống lại giai cấp tư sản là “đòn bẩy vĩ đại của cuộc cách mạng xã hội hiện đại”. Thành quả chủ yếu mà cuộc đấu tranh đó đã đạt được là sự ra đời của xã hội cộng sản chủ nghĩa - xã hội tiến đến xóa bỏ hoàn toàn áp bức, bóc lột trong lịch sử.\nTrong thời đại ngày nay, những nguyên nhân của việc phân chia xã hội thành giai cấp và đấu tranh giai cấp vẫn còn tồn tại. Mặc dù chủ nghĩa xã hội hiện nay tạm thời lâm vào thoái trào, nhưng “các mâu thuẫn lớn của thời đại vẫn rất gay gắt”; trong đó mâu thuẫn cơ bản, có tính chất xuyên suốt là mâu thuẫn giữa chủ nghĩa xã hội và chủ nghĩa tư bản; mâu thuẫn giữa giai cấp vô sản với giai cấp tư sản. Vì vậy, đấu tranh giai cấp vẫn là quy luật tất yếu của thời đại hiện nay. Do sự biến động hết sức nhanh chóng và phức tạp của tình hình thế giới nên cuộc đấu tranh giai cấp trong thời đại ngày nay có những đặc điểm mới so với giai đoạn trước đây.\nCuộc đấu tranh của giai cấp vô sản trên thế giới hiện nay gắn bó chặt chẽ với các cuộc đấu tranh vì độc lập dân tộc, dân chủ và tiến bộ xã hội; trong đó, đấu tranh giai cấp của giai cấp vô sản vẫn là động lực trực tiếp và quan trọng nhất của thời đại hiện nay. Sự vận động tổng hợp của các mâu thuẫn khách quan và cuộc đấu tranh của giai cấp vô sản, cùng nhân dân lao động trên toàn thế giới sẽ quyết định số phận của chủ nghĩa tư bản. Mặc dù cuộc đấu tranh đó diễn ra hết sức gay go, quyết liệt, lâu dài, nhưng cuối cùng loài người nhất định sẽ đi đến chủ nghĩa xã hội và chủ nghĩa cộng sản."
  },
  {
    "title": "c) Đấu tranh giai cấp của giai cấp vô sản",
    "level": 3,
    "body": "* Đấu tranh giai cấp của giai cấp vô sản khi chưa có chính quyền\nĐấu tranh giai cấp trong lịch sử tất yếu dẫn đến cuộc đấu tranh của giai cấp vô sản chống lại giai cấp tư sản - cuộc đấu tranh giai cấp cuối cùng trong lịch sử. Cuộc đấu tranh giai cấp của giai cấp vô sản chia thành hai giai đoạn cơ bản: giai đoạn trước khi giành chính quyền và giai đoạn sau khi giành chính quyền. Tổng kết thực tiễn cuộc đấu tranh giai cấp của giai cấp vô sản khi chưa giành được chính quyền, C. Mác và Ph. Ăngghen đã khái quát và chỉ ra ba hình thức đấu tranh cơ bản, đó là đấu tranh kinh tế, đấu tranh chính trị và đấu tranh tư tưởng.\nĐấu tranh kinh tế là một trong những hình thức cơ bản trong đấu tranh giai cấp của giai cấp vô sản. Đấu tranh kinh tế có nhiệm vụ trước mắt là bảo vệ những lợi ích hằng ngày của công nhân như tăng lương, rút ngắn thời gian lao động, cải thiện điều kiện sống, v.v.. Đấu tranh kinh tế bao gồm nhiều hình thức đa dạng và có vai trò rất quan trọng nhằm bảo vệ lợi ích kinh tế của giai cấp vô sản. Nếu không có đấu tranh kinh tế thì không thể giành và bảo vệ được những quyền lợi hằng ngày của công nhân; không hạn chế được sự bóc lột của giai cấp tư sản và sẽ làm cho giai cấp vô sản nhanh chóng trở thành đám đông nghèo nàn, kiệt quệ. Ngoài ra, đấu tranh kinh tế còn có tác dụng tập hợp lực lượng, giác ngộ quần chúng trong cuộc đấu tranh giai cấp nói chung. Tuy nhiên, đấu tranh kinh tế chỉ hạn chế chứ không thể xóa bỏ được sự bóc lột của giai cấp tư sản, không thể đạt được mục đích cuối cùng là xóa bỏ chế độ tư bản chủ nghĩa.\nĐấu tranh chính trị là hình thức đấu tranh cao nhất của giai cấp vô sản. Mục tiêu của đấu tranh chính trị là đánh đổ ách thống trị của giai cấp tư sản, phản động, giành chính quyền về tay giai cấp vô sản. Đấu tranh chính trị có nhiều hình thức cụ thể và trình độ khác nhau. Thực tiễn cách mạng cho thấy, khi chưa có điều kiện tiến lên đánh đổ chính quyền của giai cấp tư sản, giai cấp vô sản sử dụng nhiều hình thức đấu tranh như: tham gia nghị viện tư sản và dùng nghị viện làm phương tiện để tố cáo chính sách của nhà nước tư sản; tổ chức các cuộc míttinh, biểu tình, bãi công chính trị, v.v.. Những hình thức đấu tranh này có ý nghĩa hết sức to lớn, nhằm nâng cao giác ngộ và bảo vệ lợi ích giai cấp, phát triển lực lượng cách mạng, v.v.. Tuy nhiên, muốn giải quyết được mâu thuẫn cơ bản của xã hội, theo quy luật chung, giai cấp vô sản phải sử dụng bạo lực cách mạng để đập tan nhà nước của giai cấp tư sản, thiết lập quyền lực chính trị của mình đối với toàn bộ xã hội. Trên cơ sở đó mà tổ chức cải tạo xã hội cũ và xây dựng thành công xã hội mới. Đây là hình thức đấu tranh cao nhất, quyết định nhất và có tính chất gay go, quyết liệt. Để giành thắng lợi trong cuộc đấu tranh, giai cấp vô sản tất yếu phải tổ chức ra chính đảng của mình. Đảng là đội tiền phong của giai cấp có nhiệm vụ đề ra đường lối chiến lược, sách lược, tổ chức lực lượng, nắm bắt tình thế, thời cơ, xác định các hình thức đấu tranh phù hợp để giành thắng lợi.\nĐấu tranh tư tưởng có mục đích đập tan hệ tư tưởng của giai cấp tư sản, khắc phục những ảnh hưởng của tư tưởng, tâm lý, tập quán lạc hậu trong phong trào cách mạng; vũ trang cho họ hệ tư tưởng cách mạng và khoa học của giai cấp công nhân, đó là chủ nghĩa Mác - Lênin. Ngoài ra, đấu tranh tư tưởng còn nhằm giáo dục quần chúng nhân dân lao động thấm nhuần đường lối chiến lược, sách lược cách mạng của đảng, biến đường lối cách mạng của đảng thành hành động cách mạng. Đấu tranh chống các trào lưu tư tưởng lệch lạc, hữu khuynh, tả khuynh trong phong trào cách mạng, bảo vệ của chủ nghĩa Mác - Lênin và đường lối, chủ trương, chính sách của đảng. Đấu tranh tư tưởng được diễn ra dưới nhiều hình thức đa dạng, phong phú, cả công khai, cả bí mật, như: tuyên truyền cổ động, đấu tranh trên lĩnh vực báo chí, đấu tranh trên lĩnh vực văn hóa nghệ thuật, v.v..\nBa hình thức đấu tranh cơ bản của giai cấp vô sản có quan hệ chặt chẽ với nhau, hỗ trợ lẫn nhau, nhưng có vai trò không ngang bằng nhau. Trong thực tế, các hình thức đấu tranh kinh tế, đấu tranh chính trị và đấu tranh tư tưởng được sử dụng đan xen nhau. Chúng vừa là tiền đề, vừa là cơ sở của nhau, thống nhất với nhau, bổ trợ lẫn nhau và đều dẫn tới mục tiêu cao nhất; trong đó, đấu tranh chính trị là hình thức đấu tranh cao nhất, có ý nghĩa quyết định đến thắng lợi của giai cấp vô sản. Nhưng việc sử dụng các hình thức đấu tranh nào, ở những giai đoạn cụ thể nào của cuộc đấu tranh là do điều kiện lịch sử cụ thể, do tương quan lực lượng giữa các giai cấp quy định. Vì vậy, để đảm bảo cho thắng lợi cuối cùng của cuộc đấu tranh, giai cấp vô sản phải xác định và sử dụng đúng các hình thức đấu tranh cho phù hợp với mỗi giai đoạn cụ thể của cuộc cách mạng.\n* Đấu tranh giai cấp trong thời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội\nDo đặc điểm kinh tế - xã hội của thời kỳ quá độ lên chủ nghĩa xã hội chi phối mà đấu tranh giai cấp là tất yếu. Sau khi giành được chính quyền, mục tiêu cuối cùng của giai cấp vô sản là xây dựng thành công chủ nghĩa xã hội vẫn chưa hoàn thành. Thời kỳ này, giai cấp tư sản tuy bị đánh đổ về mặt chính quyền, song chúng vẫn còn lực lượng, tiềm lực về kinh tế, chính trị và tư tưởng. Được sự giúp đỡ của chủ nghĩa tư bản và các thế lực thù địch quốc tế, chúng luôn tìm cách chống phá sự nghiệp cách mạng của giai cấp vô sản để khôi phục lại thiên đường đã mất. Trong thời kỳ quá độ, cơ sở kinh tế để nảy sinh giai cấp bóc lột vẫn tồn tại. Nền sản xuất nhỏ và kinh tế nhiều thành phần còn chứa đựng cơ sở khách quan để tồn tại và nảy sinh các giai cấp bóc lột. Mặt khác, những tư tưởng, tâm lý và tập quán của giai cấp bóc lột, của xã hội cũ chưa bị quét sạch. Những tàn dư đó không tự động mất đi, chúng chỉ có thể bị thủ tiêu thông qua cuộc đấu tranh giai cấp của giai cấp vô sản.\nCuộc đấu tranh giai cấp của giai cấp vô sản sau khi giành được chính quyền được diễn ra trong điều kiện mới với những thuận lợi rất cơ bản, song cũng có không ít các khó khăn, thách thức đặt ra. Trong thời kỳ quá độ, cơ cấu và địa vị các giai cấp có sự biến đổi căn bản, tạo ra so sánh lực lượng có lợi cho giai cấp vô sản. Giai cấp vô sản từ địa vị giai cấp bị thống trị, bị bóc lột, trở thành giai cấp lãnh đạo xã hội; trong tiến trình của cách mạng có sự phát triển mạnh mẽ cả về số lượng và chất lượng. Giai cấp nông dân được giải phóng khỏi ách áp bức, bóc lột, trở thành lực lượng lao động cơ bản xây dựng xã hội mới. Tầng lớp trí thức mới được hình thành và có sự phát triển nhanh chóng, ngày càng có những đóng góp to lớn vào công cuộc xây dựng chủ nghĩa xã hội. Khối liên minh công nhân - nông dân - trí thức được củng cố vững chắc, trở thành nền tảng của chế độ xã hội mới. Các lực lượng phản cách mạng ngày càng bị thu hẹp và phân hóa, tiến tới bị xóa bỏ hoàn toàn. Bên cạnh những điều kiện thuận lợi rất cơ bản trên, đấu tranh giai cấp của giai cấp vô sản trong thời kỳ quá độ còn diễn ra trong điều kiện có không ít các khó khăn. Các khó khăn nổi lên trong thời kỳ này là: kinh nghiệm quản lý xã hội về mọi mặt của giai cấp vô sản còn nhiều hạn chế; giai cấp tư sản và các thế lực thù địch bằng nhiều âm mưu và thủ đoạn chống phá sự nghiệp cách mạng; các tàn dư về tư tưởng, tập quán, tâm lý của xã hội cũ và của giai cấp thống trị, bóc lột còn nhiều, v.v.. Vì vậy, tính chất của cuộc đấu tranh giai cấp trong thời kỳ này là hết sức gay go, quyết liệt và phức tạp.\nKhác với cuộc đấu tranh giai cấp trước khi giành được chính quyền, cuộc đấu tranh giai cấp của giai cấp vô sản trong thời kỳ quá độ lên chủ nghĩa xã hội có nội dung mới. Mục tiêu của nó là xây dựng thành công chủ nghĩa xã hội trên tất cả các lĩnh vực kinh tế, chính trị, tư tưởng, văn hóa, v.v.. Về thực chất, đây là cuộc đấu tranh “ai thắng ai” giữa hai con đường xã hội chủ nghĩa và tư bản chủ nghĩa. Để thực hiện thắng lợi cuộc đấu tranh đó, giai cấp vô sản đồng thời phải thực hiện hai nhiệm vụ chiến lược là bảo vệ vững chắc thành quả cách mạng đã giành được và cải tạo xã hội cũ, xây dựng thành công xã hội mới trên tất cả các lĩnh vực. Hai nhiệm vụ này có quan hệ chặt chẽ với nhau, làm tiền đề cho nhau; trong đó, thực hiện nhiệm vụ thứ nhất là trọng yếu và không thể thiếu được, thực hiện thắng lợi nhiệm vụ này tạo ra điều kiện thuận lợi để thực hiện thắng lợi nhiệm vụ xây dựng thành công chủ nghĩa xã hội. Nhiệm vụ này có vai trò đặc biệt quan trọng trong thời kỳ đầu khi mới giành được chính quyền, hoặc trong tình huống đất nước bị đe dọa và có khả năng xảy ra chiến tranh. Xây dựng thành công chủ nghĩa xã hội là nhiệm vụ cơ bản và chủ yếu nhất, có ý nghĩa quyết định đến thắng lợi hoàn toàn của giai cấp vô sản đối với giai cấp tư sản, bởi vì, theo V.I. Lênin, phân tích đến cùng thì năng suất lao động là cái quan trọng nhất, căn bản nhất cho sự thắng lợi của trật tự xã hội mới. Mặt khác, có xây dựng thành công chủ nghĩa xã hội mới tạo ra sức mạnh hiện thực để bảo vệ vững chắc thành quả của sự nghiệp cách mạng. Đây cũng là nhiệm vụ phức tạp, khó khăn và lâu dài nhất trong cuộc đấu tranh giai cấp của giai cấp vô sản.\nCuộc đấu tranh giai cấp của vô sản giai cấp diễn ra trong những điều kiện mới, với nội dung mới, với những hình thức mới. Trong cuộc đấu tranh này, giai cấp vô sản phải sử dụng tổng hợp và kết hợp các hình thức đa dạng, phong phú, như “có đổ máu và không có đổ máu”; bằng bạo lực và hòa bình; bằng quân sự và kinh tế; bằng giáo dục và hành chính, v.v.. Sử dụng hình thức nào do tình hình kinh tế, chính trị - xã hội của mỗi nước, mỗi giai đoạn lịch sử cụ thể quy định.\nHình thức mới của đấu tranh giai cấp còn được biểu hiện ở việc thực hiện các nhiệm vụ cụ thể của sự nghiệp cách mạng. Về kinh tế, đó là xây dựng, phát triển nền kinh tế thị trường định hướng xã hội chủ nghĩa. Về chính trị, là xây dựng và phát huy nền dân chủ xã hội chủ nghĩa, hoàn thiện hệ thống chính trị và nhà nước pháp quyền xã hội chủ nghĩa. Về tư tưởng và văn hóa, là xác lập vai trò thống trị của hệ tư tưởng chủ nghĩa Mác - Lênin, xây dựng nền văn hóa xã hội chủ nghĩa. Bên cạnh đó, giai cấp vô sản còn phải đấu tranh làm thất bại các âm mưu “diễn biến hòa bình” của chủ nghĩa đế quốc và các thế lực thù địch; bảo vệ vững chắc hệ tư tưởng vô sản và đấu tranh kiên quyết với các quan điểm tư tưởng sai lầm, phản động của giai cấp tư sản và chủ nghĩa cơ hội.\n* Đặc điểm đấu tranh giai cấp trong thời kỳ quá độ lên chủ nghĩa xã hội ở Việt Nam hiện nay\nTrong thời kỳ quá độ lên chủ nghĩa xã hội ở Việt Nam hiện nay đấu tranh giai cấp là tất yếu, tính tất yếu của nó do chính các đặc điểm kinh tế - xã hội của thời kỳ quá độ quy định.\nTrong thời kỳ quá độ lên chủ nghĩa xã hội ở Việt Nam, mục tiêu cuối cùng của cuộc đấu tranh giai cấp của giai cấp vô sản là xây dựng thành công chủ nghĩa xã hội chưa hoàn thành. Quá độ lên chủ nghĩa xã hội ở Việt Nam là quá độ gián tiếp từ một xã hội thuộc địa, nửa phong kiến với trình độ phát triển của lực lượng sản xuất còn thấp, tiến lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa. Trong thời kỳ này còn cơ sở kinh tế để nảy sinh giai cấp bóc lột và mâu thuẫn giai cấp vẫn tồn tại. Với đặc điểm nền kinh tế sản xuất nhỏ là phổ biến và bản thân trong quá trình phát triển nền kinh tế hàng hóa nhiều thành phần vận động theo cơ chế thị trường đòi hỏi tất yếu phải đấu tranh chống lại khuynh hướng tự phát đi lên chủ nghĩa tư bản, giữ vững định hướng xã hội chủ nghĩa trên các lĩnh vực phát triển của đất nước.\nHiện nay, các thế lực phản động trong nước đang bằng nhiều âm mưu và thủ đoạn chống phá sự nghiệp cách mạng của đất nước. Chúng đang ra sức tập hợp lực lượng, lôi kéo các phần tử bất mãn với chế độ, lợi dụng chiêu bài dân chủ, nhân quyền, dân tộc, tôn giáo... để chống phá sự nghiệp cách mạng. Để thực hiện các mưu đồ phản động đó, chúng đang tìm mọi cách câu kết với chủ nghĩa đế quốc, ráo riết thực hiện âm mưu “diễn biến hòa bình” hòng xóa bỏ vai trò lãnh đạo của Đảng và chế độ xã hội chủ nghĩa ở Việt Nam.\nTrong thời kỳ quá độ lên chủ nghĩa xã hội ở Việt Nam hiện nay, những tàn dư về tư tưởng, tâm lý và tập quán lạc hậu của giai cấp phong kiến, tư sản, của chủ nghĩa thực dân cũ, chủ nghĩa thực dân mới, v.v. còn tồn tại. Mặt khác, còn có các tư tưởng, tâm lý lạc hậu nảy sinh chính trong điều kiện phát triển kinh tế thị trường, đó là những tiêu cực do mặt trái của kinh tế thị trường sinh ra. Tất cả những yếu tố và tàn dư lạc hậu đó không tự động mất đi, mà chỉ có thể thông qua cuộc đấu tranh giai cấp mới loại bỏ được nó. Cuộc đấu tranh giai cấp ở Việt Nam hiện nay đang diễn ra gay go, phức tạp trên tất cả các lĩnh vực của đời sống xã hội.\nCuộc đấu tranh giai cấp ở Việt Nam hiện nay được diễn ra trong điều kiện mới với những thuận lợi rất cơ bản song cũng có không ít các khó khăn. Cùng với những biến đổi to lớn về kinh tế - xã hội, cơ cấu xã hội - giai cấp, địa vị của các giai cấp trong xã hội có biến đổi căn bản, tạo ra so sánh lực lượng có lợi cho sự nghiệp cách mạng. Giai cấp công nhân Việt Nam trở thành giai cấp lãnh đạo sự nghiệp cách mạng và có sự phát triển mạnh mẽ cả về số lượng và chất lượng. Khối liên minh giai cấp mới công nhân - nông dân - trí thức dưới sự lãnh đạo của Đảng Cộng sản Việt Nam được củng cố vững chắc và trở thành nền tảng của chế độ xã hội mới. Dù bối cảnh quốc tế hiện nay hết sức phức tạp, song vai trò lãnh đạo của Đảng Cộng sản Việt Nam vẫn được giữ vững và tăng cường. Nhà nước pháp quyền xã hội chủ nghĩa Việt Nam tiếp tục được củng cố, hoàn thiện và trở thành công cụ chính trị mạnh mẽ trong cuộc đấu tranh giai cấp của giai cấp vô sản và nhân dân lao động. Sự nghiệp đổi mới đất nước trong 35 năm qua đã đạt được những thành tựu to lớn, có ý nghĩa lịch sử, tạo ra thế và lực mới cho đất nước tiếp tục phát triển. Những thành quả của sự nghiệp cách mạng và các tiền đề kinh tế - vật chất đã tạo dựng được là cơ sở để thực hiện thắng lợi mục tiêu của cuộc cách mạng xã hội chủ nghĩa. Cuộc cách mạng khoa học và công nghệ hiện đại; xu hướng toàn cầu hóa; hội nhập và hợp tác quốc tế, khu vực phát triển đang tạo ra cho cách mạng Việt Nam cả thời cơ, vận hội và cả các thách thức trên con đường phát triển của mình.\nBên cạnh những điều kiện thuận lợi cơ bản trên, trong thời kỳ quá độ lên chủ nghĩa xã hội, cách mạng Việt Nam còn gặp không ít khó khăn. Các thế lực thù địch vẫn tiếp tục thực hiện âm mưu “diễn biến hòa bình”, gây bạo loạn lật đổ, sử dụng các chiêu bài “dân chủ”, “nhân quyền” hòng làm thay đổi chế độ chính trị ở Việt Nam. Sự khủng hoảng của chủ nghĩa xã hội thế giới và sự điều chỉnh để thích nghi của chủ nghĩa tư bản hiện đại và sự điều chỉnh chiến lược của các nước lớn đã có tác động không nhỏ đến cuộc đấu tranh giai cấp. Vì vậy, xây dựng thành công chủ nghĩa xã hội ở Việt Nam là một nhiệm vụ trọng đại, nhưng cũng rất khó khăn, phức tạp và lâu dài.\nNội dung của cuộc đấu tranh giai cấp trong thời kỳ quá độ lên chủ nghĩa xã hội ở Việt Nam hiện nay là thực hiện thắng lợi mục tiêu độc lập dân tộc và chủ nghĩa xã hội, xây dựng một xã hội dân giàu, nước mạnh, dân chủ, công bằng, văn minh. Về thực chất đây là cuộc đấu tranh giữa các nhân tố thúc đẩy đất nước theo định hướng xã hội chủ nghĩa với các nhân tố tác động nhằm cản trở đất nước theo mục tiêu độc lập dân tộc và chủ nghĩa xã hội.\nĐể thực hiện thắng lợi mục tiêu trên nhân dân Việt Nam phải thực hiện thắng lợi hai nhiệm vụ chiến lược là xây dựng thành công chủ nghĩa xã hội và bảo vệ vững chắc Tổ quốc xã hội chủ nghĩa. Hai nhiệm vụ chiến lược trên của cách mạng Việt Nam có quan hệ thống nhất với nhau. Bảo vệ vững chắc Tổ quốc mới tạo ra được môi trường và điều kiện thuận lợi để xây dựng thành công chủ nghĩa xã hội. Mặt khác, có tạo lập đầy đủ cơ sở kinh tế - vật chất, xây dựng thành công chủ nghĩa xã hội mới có điều kiện để nâng cao sức mạnh bảo vệ Tổ quốc xã hội chủ nghĩa. Trong điều kiện hiện nay, bảo vệ Tổ quốc, bảo vệ chế độ xã hội chủ nghĩa, bảo vệ chính quyền nhân dân là nhiệm vụ trọng yếu của sự nghiệp cách mạng. Phát triển kinh tế, tạo lập cơ sở vật chất - kỹ thuật để xây dựng thành công chủ nghĩa xã hội là nhiệm vụ trung tâm, xuyên suốt của cả thời kỳ quá độ lên chủ nghĩa xã hội.\nNội dung chủ yếu của cuộc đấu tranh giai cấp ở Việt Nam hiện nay là thực hiện thắng lợi sự nghiệp công nghiệp hóa, hiện đại hóa theo định hướng xã hội chủ nghĩa, khắc phục tình trạng nước kém phát triển; thực hiện công bằng xã hội, chống áp bức, bất công; đấu tranh ngăn chặn và khắc phục những tư tưởng và hành động tiêu cực, sai trái; đấu tranh làm thất bại mọi âm mưu và hành động chống phá của các thế lực thù địch; bảo vệ độc lập dân tộc, xây dựng thành công chủ nghĩa xã hội.\nNhư vậy, đấu tranh giai cấp ở Việt Nam hiện nay đang diễn ra hằng ngày, hằng giờ trên tất cả các lĩnh vực của đời sống xã hội, với các nội dung cụ thể khác nhau, nhằm giải quyết nhiều mâu thuẫn của quá trình vận động đi lên chủ nghĩa xã hội.\nĐấu tranh giai cấp trong thời kỳ quá độ lên chủ nghĩa xã hội ở Việt Nam được diễn ra với nhiều hình thức đa dạng, phong phú, đòi hỏi phải sử dụng tổng hợp và kết hợp các hình thức, biện pháp linh hoạt; bằng hành chính và giáo dục; cải tạo và xây dựng; sử dụng các kinh tế trung gian, quá độ;... tùy theo hoàn cảnh lịch sử cụ thể.\nĐể thực hiện thắng lợi nội dung của cuộc đấu tranh giai cấp ở Việt Nam đặt ra đòi hỏi khách quan là phải giải quyết tốt các phương hướng và nhiệm vụ cụ thể của sự nghiệp cách mạng hiện nay, nâng cao năng lực và sức chiến đấu của Đảng; đẩy mạnh toàn diện công cuộc đổi mới và sự nghiệp công nghiệp hóa, hiện đại hóa đất nước; phát triển văn hóa, thực hiện tiến bộ và công bằng xã hội; tăng cường quốc phòng và an ninh, mở rộng quan hệ đối ngoại; chủ động và tích cực hội nhập quốc tế; giữ vững ổn định chính trị - xã hội đất nước.\nNhư vậy, cuộc đấu tranh giai cấp trong thời kỳ quá độ lên chủ nghĩa xã hội ở Việt Nam diễn ra trong điều kiện mới, có nội dung và hình thức mới với tính chất phức tạp, khó khăn và lâu dài. Đối với đội ngũ cán bộ và nhân dân, cần thấu triệt sâu sắc quan điểm của Đảng Cộng sản Việt Nam về đấu tranh giai cấp và đấu tranh dân tộc hiện nay; nhận thức rõ đặc điểm đấu tranh giai cấp ở Việt Nam và các âm mưu chống phá của kẻ thù. Trong tình hình mới, cần giáo dục nâng cao lập trường giai cấp và tinh thần cảnh giác cách mạng cho đội ngũ cán bộ và nhân dân."
  },
  {
    "title": "2. Dân tộc",
    "level": 2,
    "body": ""
  },
  {
    "title": "a) Các hình thức cộng đồng người trước khi hình thành dân tộc",
    "level": 3,
    "body": "Con người mang bản chất xã hội nên tồn tại và phát triển trong những hình thức cộng đồng người nhất định. Hình thức cộng đồng người là cách thức tổ chức xã hội của con người trong những thời kỳ lịch sử xã hội khác nhau. Lịch sử phát triển của xã hội loài người cho đến nay là lịch sử phát triển của các hình thức cộng đồng người từ thấp đến cao: thị tộc, bộ lạc, bộ tộc và dân tộc. Trong các hình thức đó, dân tộc là hình thức cộng đồng người cao nhất, và phổ biến nhất của xã hội loài người hiện nay.\n* Thị tộc\nNgay từ khi mới thoát khỏi giới động vật, con người đã sống thành tập đoàn, đó là những “bầy người nguyên thủy”. Khi tiến đến một trình độ cao hơn, những “bầy người” đó phát triển thành thị tộc. Ph. Ăngghen chỉ rõ: “thị tộc (trong chừng mực những tài liệu hiện có cho phép chúng ta phán đoán) là một thiết chế chung cho tất cả các dân dã man, cho tận đến khi họ bước vào thời đại văn minh, và thậm chí còn sau hơn nữa”. Thị tộc vừa là thiết chế xã hội đầu tiên, vừa là hình thức cộng đồng người sớm nhất của loài người.\nThị tộc có những đặc điểm cơ bản: Các thành viên trong thị tộc đều tiến hành lao động chung, vai trò của các thành viên phụ thuộc vào vị trí của họ trong nền sản xuất nguyên thủy. Các thành viên của thị tộc có cùng một tổ tiên và nói chung một thứ tiếng; có những thói quen và tín ngưỡng chung; có một số yếu tố chung của nền văn hóa nguyên thủy. Mỗi thị tộc có một tên gọi riêng. Về tổ chức xã hội, thị tộc bầu ra tù trưởng, tộc trưởng, lãnh tụ quân sự để điều hành công việc chung của thị tộc. Quyền lực của tù trưởng, tộc trưởng, lãnh tụ quân sự được thực hiện dựa trên cơ sở của uy tín, đạo đức cá nhân của họ. Tù trưởng, tộc trưởng, lãnh tụ quân sự là do các thành viên của thị tộc bầu ra và họ có thể bị bãi miễn nếu không thực hiện được vai trò của mình. Mọi thành viên trong thị tộc đều bình đẳng về quyền lợi và nghĩa vụ.\n* Bộ lạc\nBộ lạc là cộng đồng bao gồm những thị tộc có quan hệ cùng huyết thống hoặc các thị tộc có quan hệ hôn nhân liên kết với nhau. Bộ lạc là hình thức cộng đồng người phát triển từ thị tộc và do sự liên kết của nhiều thị tộc có cùng huyết thống tạo thành. Ph. Ăngghen viết: “một thị tộc đã được coi là một đơn vị cơ sở của xã hội, thì toàn bộ chế độ thị tộc, bào tộc và bộ lạc đều phát triển từ đơn vị ấy với một sự tất yếu hầu như không thể ngăn cản nổi - bởi vì đó là điều hoàn toàn tự nhiên”.\nBộ lạc có những đặc điểm cơ bản sau: Cơ sở kinh tế của bộ lạc là chế độ công hữu về đất đai và công cụ sản xuất. Các thành viên trong bộ lạc đều tiến hành lao động chung, quan hệ giữa các thành viên trong lĩnh vực sản xuất vật chất là bình đẳng. Cũng như thị tộc, mỗi bộ lạc có tên gọi riêng; các thành viên nói chung một thứ tiếng; có những tập quán và tín ngưỡng chung. Song lãnh thổ của bộ lạc có sự ổn định hơn so với thị tộc. Về tổ chức xã hội, đứng đầu bộ lạc là một hội đồng gồm những tù trưởng của các thị tộc tham gia bộ lạc và có một vị thủ lĩnh tối cao. Mọi vấn đề quan trọng trong bộ lạc đều được bàn bạc và thông qua trong hội đồng này. Trong quá trình phát triển, một bộ lạc có thể được tách ra thành các bộ lạc khác nhau, hoặc là có sự hợp nhất giữa nhiều bộ lạc thành liên minh các bộ lạc.\n* Bộ tộc\nBộ tộc là hình thức cộng đồng người hình thành khi xã hội có sự phân chia thành giai cấp. Các bộ tộc được hình thành từ sự liên kết của nhiều bộ lạc sống trên một lãnh thổ nhất định. Nếu như thị tộc và bộ lạc chỉ bao gồm hầu hết những người có cùng huyết thống thì bộ tộc là sự liên kết của nhiều bộ lạc không cùng huyết thống. Ph. Ăngghen chỉ rõ: “Do việc mua bán ruộng đất, do sự phát triển hơn nữa của phân công lao động giữa nông nghiệp và thủ công nghiệp, giữa thương nghiệp và hàng hải, và những thành viên của các thị tộc, bào tộc và bộ lạc chẳng bao lâu đã phải sống lẫn lộn với nhau; và lãnh thổ của bào tộc và bộ lạc đã phải thu nhận những người tuy cùng là đồng bào, nhưng lại không thuộc các tập đoàn ấy, tức là những người lạ xét về nơi ở”.\nBộ tộc hình thành cùng với chế độ chiếm hữu nô lệ; trong những xã hội bỏ qua chế độ chiếm hữu nô lệ thì bộ tộc hình thành cùng với chế độ phong kiến. Sự hình thành và phát triển của bộ tộc phức tạp hơn thị tộc và bộ lạc. Ở những nước khác nhau, những thời đại khác nhau, bộ tộc có những nét đặc thù riêng. Là một hình thức cộng đồng người trong lịch sử, bộ tộc có những đặc trưng chủ yếu sau: Mỗi bộ tộc có tên gọi riêng; có lãnh thổ riêng, mang tính ổn định; có một ngôn ngữ thống nhất. Nhưng vì mối liên hệ cộng đồng chưa phát triển nên tiếng nói chung đó còn chưa thực sự vững chắc. Bên cạnh tiếng nói chung, thổ ngữ của các bộ lạc vẫn được sử dụng rộng rãi. Trong bộ tộc đã xuất hiện những yếu tố chung về tâm lý, văn hóa. Về tổ chức xã hội, việc điều hành công việc xã hội thuộc về nhà nước. Nhà nước là công cụ do giai cấp thống trị tổ chức ra và phục vụ lợi ích cho giai cấp đó.\nVới sự ra đời của bộ tộc, lần đầu tiên trong lịch sử nhân loại có một hình thức cộng đồng người được hình thành không theo huyết thống mà dựa trên những mối liên hệ về kinh tế, lãnh thổ và văn hóa, mặc dù những mối liên hệ đó còn chưa thực sự phát triển."
  },
  {
    "title": "b) Dân tộc - hình thức cộng đồng người phổ biến hiện nay",
    "level": 3,
    "body": "* Khái niệm dân tộc\nDân tộc là hình thức cộng đồng người phát triển cao nhất từ trước đến nay. Khái niệm dân tộc được sử dụng theo hai nghĩa: Theo nghĩa rộng (nation) dùng để chỉ quốc gia - các quốc gia, dân tộc trên thế giới (như Việt Nam, Campuchia, Anh, Pháp...). Theo nghĩa hẹp (ethnie, ethnic group) dùng để chỉ cộng đồng tộc người - các dân tộc đa số và thiểu số trong một quốc gia (dân tộc Kinh, Tày, Nùng, Mông, Vân Kiều, Êđê, Khmer...), trong đó, cộng đồng tộc người là yếu tố cấu thành quốc gia, dân tộc.\nMặc dù C. Mác, Ph. Ăngghen và V.I. Lênin chưa đưa ra một định nghĩa hoàn chỉnh về dân tộc, nhưng đã nêu ra những đặc trưng cơ bản của dân tộc, phân tích một cách khoa học quy luật hình thành, phát triển của dân tộc và chỉ rõ lập trường của giai cấp vô sản đối với vấn đề dân tộc. Trong Tuyên ngôn của Đảng Cộng sản, C. Mác và Ph. Ăngghen cho rằng, giai cấp tư sản đã ngày càng xóa bỏ tình trạng phân tán về tư liệu sản xuất, tài sản, dân cư và đã tạo nên những “dân tộc thống nhất, có một chính phủ thống nhất, một luật pháp thống nhất, một lợi ích dân tộc thống nhất mang tính giai cấp và một hàng rào thuế quan thống nhất”. J. Stalin đã có những đóng góp quan trọng trong việc phát triển lý luận về vấn đề dân tộc: “Dân tộc là một khối cộng đồng người ổn định được thành lập trong lịch sử, dựa trên cơ sở cộng đồng về tiếng nói, lãnh thổ, sinh hoạt kinh tế và tâm lý, biểu hiện trong cộng đồng văn hóa”. Như vậy, có thể thấy rằng, các nhà kinh điển nói về dân tộc với nghĩa là quốc gia, dân tộc và nhấn mạnh những yếu tố thống nhất, ổn định trong các cộng đồng dân tộc.\nTừ quan điểm của các nhà kinh điển, có thể khái quát: Dân tộc là một cộng đồng người ổn định, được hình thành trong lịch sử trên cơ sở một lãnh thổ, một ngôn ngữ, một nền kinh tế thống nhất, một nền văn hóa và tâm lý, tính cách bền vững, với một nhà nước và pháp luật thống nhất.\n* Đặc trưng của dân tộc\n- Dân tộc là một cộng đồng người ổn định trên một lãnh thổ thống nhất.\nDân tộc là hình thức cộng đồng người phát triển cao nhất cho đến nay sau bộ tộc và được hình thành ổn định. Lãnh thổ là địa bàn sinh tồn và phát triển của dân tộc, nơi mà các cộng đồng người được hình thành một cách ổn định trong lịch sử. Mỗi dân tộc có một lãnh thổ riêng thống nhất, không bị chia cắt do được hình thành lâu dài và trải qua nhiều thử thách trong lịch sử. Đồng thời tính thống nhất của lãnh thổ còn được củng cố bằng sự thống nhất của các yếu tố kinh tế, chính trị khác. Lãnh thổ thuộc chủ quyền của mỗi quốc gia, dân tộc và được xác định bằng biên giới quốc gia. Không có lãnh thổ thì không có khái niệm Tổ quốc, quốc gia. Nếu như trong bộ tộc, lãnh thổ còn bị chia cắt bởi các lãnh chúa,... thì lãnh thổ của dân tộc không còn sự chia cắt ấy và ổn định hơn nhiều. Cộng đồng lãnh thổ là đặc trưng quan trọng không thể thiếu của dân tộc. Mỗi quốc gia, dân tộc đều có một lãnh thổ xác định và vùng lãnh thổ này được xem là mảnh đất thiêng liêng mà các thành viên của dân tộc phải có trách nhiệm và nghĩa vụ bảo vệ. Hiện nay, lãnh thổ của một dân tộc được hiểu không phải chỉ là đất liền mà còn bao hàm cả vùng biển, vùng trời, hải đảo và thềm lục địa..., được thể chế hóa bằng luật pháp quốc gia và quốc tế. Chủ quyền lãnh thổ quốc gia bao giờ cũng là vấn đề thiêng liêng của mỗi dân tộc.\n- Dân tộc là một cộng đồng thống nhất về ngôn ngữ.\nNgôn ngữ là đặc trưng cơ bản của dân tộc. Ngôn ngữ vừa là công cụ giao tiếp kết nối các thành viên trong cộng đồng dân tộc, vừa là một phương tiện giao lưu văn hóa giữa các tộc người. Mỗi thành viên của một dân tộc có thể dùng nhiều ngôn ngữ để giao tiếp. Mỗi cộng đồng tộc người có thể có ngôn ngữ riêng. Song, ở mỗi quốc gia, dân tộc đều có một ngôn ngữ thống nhất để sử dụng chung cho tất cả các cộng đồng tộc người trong quốc gia, dân tộc đó. Tính thống nhất trong ngôn ngữ của dân tộc thể hiện ở sự thống nhất về cấu trúc ngữ pháp và kho từ vựng cơ bản. Ngôn ngữ dân tộc là một ngôn ngữ đã phát triển. Thống nhất về ngôn ngữ là một trong những đặc trưng chủ yếu của dân tộc. Ngày nay, khi giao lưu, hội nhập quốc tế được mở rộng, ngôn ngữ của một quốc gia có thể được nhiều nước sử dụng nhưng ngôn ngữ đó vẫn được xác định (tiếng mẹ đẻ) là ngôn ngữ chính của dân tộc đã sản sinh ra nó.\n- Dân tộc là một cộng đồng thống nhất về kinh tế.\nKhoa học đã chứng minh rằng, từ cộng đồng thị tộc phát triển lên các hình thức bộ lạc và bộ tộc, yếu tố liên kết giữa các thành viên của cộng đồng trên cơ sở huyết thống dần dần bị suy giảm, vai trò của nhân tố kinh tế ngày càng được tăng cường. Với dân tộc, vai trò của nhân tố kinh tế được biểu hiện ra thật sự mạnh mẽ. Kinh tế chính là một phương thức sinh sống của dân cư gắn các tộc người thành cộng đồng dân tộc. Tuy nhiên, khi dân tộc, quốc gia hình thành thì kinh tế được hiểu là một nền kinh tế thống nhất của một quốc gia có tính độc lập, tự chủ.\nPh. Ăngghen đã chứng minh rằng, tác nhân cơ bản dẫn tới việc chuyển từ hình thức cộng đồng trước dân tộc sang dân tộc là tác nhân kinh tế. Những mối liên hệ kinh tế thường xuyên và mạnh mẽ, đặc biệt là mối liên hệ thị trường đã làm tăng tính thống nhất, ổn định, bền vững của cộng đồng người đông đảo sống trên một lãnh thổ rộng lớn. Dân tộc có tính điển hình là dân tộc tư sản, dân tộc này bao gồm các giai cấp, tầng lớp xã hội khác nhau. Các giai cấp và tầng lớp xã hội này có quan hệ kinh tế chặt chẽ trong một hệ thống kinh tế thống nhất hình thành trên địa bàn dân tộc, đó là hệ thống kinh tế tư bản chủ nghĩa.\nTrong thế giới hiện đại, có sự hội nhập kinh tế quốc tế sâu rộng, nhưng mỗi quốc gia, dân tộc vẫn có một nền kinh tế độc lập, không phụ thuộc và lệ thuộc vào quốc gia khác. Vấn đề chủ quyền kinh tế quốc gia là vấn đề các nước đều quan tâm hiện nay.\n- Dân tộc là một cộng đồng bền vững về văn hóa, tâm lý và tính cách.\nVăn hóa là yếu tố đặc biệt quan trọng của sự liên kết cộng đồng, được coi là “bộ gen”, là “căn cước” của mỗi cộng đồng dân tộc. Văn hóa dân tộc mang nhiều sắc thái của các cộng đồng tộc người, sắc tộc, các địa phương,... nhưng vẫn là nền văn hóa thống nhất có những đặc trưng chung và ổn định. Tính thống nhất trong đa dạng là đặc trưng của văn hóa dân tộc. Mỗi dân tộc có một nền văn hóa độc đáo của mình, tạo nên bản sắc văn hóa của dân tộc. Bên cạnh những yếu tố văn hóa khác nhau của mỗi giai cấp, mỗi tầng lớp xã hội trong cộng đồng dân tộc, v.v. thì các thành viên của cộng đồng đều tham gia sinh hoạt văn hóa chung của dân tộc. Đặc trưng văn hóa của dân tộc thể hiện ở phong tục, tập quán, tín ngưỡng và các sinh hoạt văn hóa khác của các thành viên trong cộng đồng dân tộc ấy. Do có quá trình hình thành và phát triển lâu dài, nên văn hóa dân tộc không dễ bị đồng hóa.\nXã hội càng phát triển, giao lưu văn hóa càng mạnh và nhu cầu văn hóa càng cao thì càng có sự hòa đồng về văn hóa, nhưng hầu hết các dân tộc vẫn giữ được sắc thái văn hóa riêng của mình. Hơn nữa, văn hóa còn là nền tảng tinh thần, là động lực của sự phát triển, là một công cụ bảo vệ độc lập và chủ quyền của mỗi quốc gia. Lịch sử các cuộc đấu tranh bảo vệ nền độc lập dân tộc luôn gắn liền với cuộc đấu tranh giữ gìn bản sắc văn hóa, chống lại nguy cơ bị đồng hóa về văn hóa. Trong bối cảnh hội nhập quốc tế hiện nay, các quốc gia, dân tộc hiện đại đều ý thức được rằng, muốn bảo vệ và phát triển văn hóa dân tộc thì phải hội nhập nhưng không được “hòa tan”.\nMỗi dân tộc còn có tâm lý, tính cách riêng và được biểu hiện thông qua sinh hoạt vật chất và tinh thần của dân tộc ấy, đặc biệt qua các phong tục, tập quán, tín ngưỡng, đời sống văn hóa. Đây là một đặc trưng quan trọng của mỗi dân tộc. Yếu tố này được tạo nên bởi những nét đặc thù của một cộng đồng; là sự hội tụ của gần như tất cả các yếu tố sinh học và xã hội của các tộc người; trở thành tâm thức của mỗi người trong cộng đồng dân tộc đến mức cho dù phải rời xa lãnh thổ của dân tộc để sống trong một cộng đồng hoàn toàn khác nhưng đặc trưng văn hóa, tính cách vẫn được lưu giữ lâu dài.\n- Dân tộc là một cộng đồng người có một nhà nước và pháp luật thống nhất.\nĐây là một đặc trưng của dân tộc - quốc gia để phân biệt với dân tộc theo nghĩa là các dân tộc - tộc người (đa số hay thiểu số). Chính C. Mác và Ph. Ăngghen ngay từ thời kỳ đầu đã chú ý đến yếu tố này và phân tích trong tác phẩm Tuyên ngôn của Đảng Cộng sản. Từ động lực phát triển kinh tế, với vai trò tích cực của giai cấp tư sản trong thời kỳ chủ nghĩa tư bản hình thành, các quốc gia, dân tộc đã hình thành ở hầu hết châu Âu. Do yêu cầu của thị trường và lưu thông hàng hóa phát triển, giai cấp tư sản đã xóa bỏ sự phân tán, sự “cát cứ” về kinh tế và chính trị, hình thành những quan hệ “liên minh” về lợi ích, kết quả là hình thành “một chính phủ thống nhất”, “một luật pháp thống nhất”, “một thuế quan thống nhất”... Do vậy, nhà nước và pháp luật thống nhất là một đặc trưng của dân tộc và ngày nay đây cũng là một quan niệm phổ biến trên thế giới. Dân tộc - quốc gia - nhà nước là thống nhất không thể tách rời. Dân tộc nào cũng có một nhà nước nhất định và nhà nước nào cũng của một dân tộc nhất định.\nNhững đặc trưng của dân tộc đã cho thấy, dân tộc hoàn toàn khác với các hình thức cộng đồng người đã hình thành từ trước khi xã hội có giai cấp như thị tộc, bộ lạc. Đồng thời, dân tộc cũng khác với bộ tộc, một hình thức cộng đồng khá phổ biến ở phương Tây trước khi dân tộc hình thành. Dân tộc có thể từ một bộ tộc phát triển lên và cũng có thể do nhiều bộ tộc hợp lại. Tuy nhiên, các mối liên hệ giữa các thành viên trong bộ tộc còn lỏng lẻo, yếu ớt, còn các mối liên hệ trong cộng đồng dân tộc ổn định và bền vững hơn. Tính cộng đồng bền vững này tạo nên sức mạnh của mỗi dân tộc và đảm bảo cho một dân tộc có thể tồn tại, phát triển trong những điều kiện lịch sử khác nhau, kể cả trong điều kiện có giặc ngoại xâm hoặc có sự giao lưu quốc tế mở rộng. Tổng hòa các đặc trưng cơ bản về lãnh thổ, ngôn ngữ, kinh tế, văn hóa, tâm lý, tính cách, nhà nước và pháp luật thống nhất làm cho cộng đồng dân tộc là hình thức phát triển nhất và bền vững hơn bất cứ hình thức cộng đồng nào trong lịch sử. Trong tương lai, dân tộc sẽ tồn tại lâu dài, kể cả sau khi các giai cấp không còn trong lịch sử.\n* Quá trình hình thành các dân tộc ở châu Âu và đặc thù sự hình thành dân tộc ở châu Á\nTheo quan điểm của chủ nghĩa Mác - Lênin, dân tộc là hình thức cộng đồng người gắn liền với xã hội có giai cấp, có nhà nước và các thể chế chính trị. Lịch sử cho thấy, dân tộc có thể được hình thành từ một bộ tộc phát triển lên, song đa số trường hợp được hình thành trên cơ sở nhiều bộ tộc và tộc người hợp nhất lại."
  },
  {
    "title": "C. Mác và Ph. Ăngghen chỉ rõ, ở châu Âu dân tộc hình thành theo hai phương thức chủ yếu gắn liền với sự hình thành và phát triển của chủ nghĩa tư bản. Phương thức thứ nhất, dân tộc hình thành từ nhiều bộ tộc khác nhau trong một quốc gia. Quá trình hình thành dân tộc ở đây vừa là một quá trình thống nhất lãnh thổ, thống nhất thị trường; đồng thời, cũng là một quá trình đồng hóa các bộ tộc khác nhau thành một dân tộc duy nhất, một quốc gia, dân tộc độc lập, như ở các nước Đức, Italia, Pháp, v.v.. Phương thức thứ hai, do điều kiện chế độ phong kiến chưa bị thủ tiêu, chủ nghĩa tư bản phát triển còn yếu, dân tộc được hình thành từ một bộ tộc. Ở đây không có quá trình đồng hóa các bộ tộc mà chỉ có quá trình thống nhất các lãnh thổ phong kiến thành lập một quốc gia gồm nhiều dân tộc, trong đó mỗi dân tộc hình thành từ một bộ tộc riêng, như trường hợp ở các nước Nga, Áo, Hunggari, v.v..",
    "level": 1,
    "body": "Quá trình hình thành, phát triển dân tộc diễn ra hết sức lâu dài, đa dạng và phức tạp. Ở các nước châu Âu, sự hình thành và phát triển của dân tộc trải qua các thời kỳ chính: gắn liền với cuộc cách mạng tư sản do giai cấp tư sản lãnh đạo; gắn liền với phong trào đấu tranh chống chủ nghĩa đế quốc giải phóng dân tộc; và thời kỳ các dân tộc xã hội chủ nghĩa ra đời. Sự hình thành các dân tộc trong lịch sử trên thế giới còn tùy điều kiện và hoàn cảnh lịch sử cụ thể của mỗi quốc gia, khu vực. Sự hình thành các quốc gia, dân tộc ở phương Đông có tính đặc thù riêng. Thực tiễn lịch sử cho thấy, ở Trung Quốc, Ấn Độ, Việt Nam... dân tộc được hình thành rất sớm, không gắn với sự ra đời của chủ nghĩa tư bản.\nTính đặc thù của sự hình thành dân tộc Việt Nam.\nDân tộc Việt Nam được hình thành rất sớm trong lịch sử gắn liền với nhu cầu dựng nước và giữ nước, với quá trình đấu tranh chống ngoại xâm và cải tạo thiên nhiên, bảo vệ nền văn hóa dân tộc, điều này tạo nên nét độc đáo trong sự cố kết của cộng đồng dân tộc. Lịch sử đã chứng minh rằng, từ hàng nghìn năm trước trên lãnh thổ Việt Nam đã có một cộng đồng mang đầy đủ các đặc trưng của một dân tộc. Dân tộc Việt Nam đã có một ngôn ngữ, một lãnh thổ, một nền kinh tế thống nhất; một nhà nước, luật pháp và một nền văn hóa thống nhất. Khoa học lịch sử đã khẳng định, quá trình hình thành dân tộc Việt Nam được bắt đầu từ khi nước Đại Việt giành được độc lập (cách đây trên 1.000 năm) cho đến thời Lý - Trần."
  },
  {
    "title": "3. Mối quan hệ giai cấp - dân tộc - nhân loại",
    "level": 2,
    "body": ""
  },
  {
    "title": "a) Quan hệ giai cấp - dân tộc",
    "level": 3,
    "body": "Dân tộc và giai cấp là những phạm trù chỉ các quan hệ xã hội khác nhau, có vai trò lịch sử khác nhau đối với sự phát triển của xã hội. Trong lịch sử nhân loại, giai cấp có trước dân tộc hàng nghìn năm. Khi giai cấp mất đi, dân tộc vẫn còn tồn tại lâu dài. Trong một dân tộc có nhiều giai cấp và ngược lại một giai cấp có thể tồn tại trong nhiều dân tộc.\n* Giai cấp quyết định dân tộc\nSự phát triển của phương thức sản xuất xã hội là nguyên nhân xét đến cùng quyết định sự hình thành, phát triển của các hình thức cộng đồng người trong lịch sử. Phương thức sản xuất tư bản chủ nghĩa là động lực mạnh mẽ nhất của quá trình thay thế hình thức cộng đồng bộ tộc bằng hình thức cộng đồng dân tộc. Trong quá trình đó, giai cấp tư sản đóng vai trò chính trong việc thúc đẩy sự hình thành dân tộc tư sản.\nQuan hệ giai cấp quyết định khuynh hướng phát triển và tính chất của dân tộc. Trong một thời đại lịch sử, mỗi dân tộc đều do một giai cấp đại diện. Giai cấp đó quy định tính chất dân tộc. Giai cấp thống trị trong xã hội cũng là giai cấp thống trị đối với dân tộc. Những giai cấp đang lên trong lịch sử, đại biểu cho sự phát triển của lực lượng sản xuất và xã hội cũng là giai cấp đại biểu cho lợi ích chân chính của dân tộc. Giai cấp đó có khả năng nắm ngọn cờ dân tộc để tập hợp đông đảo các giai cấp, các tầng lớp khác nhau trong dân tộc đấu tranh chống giai cấp thống trị phản động, hoặc chống ách áp bức của các dân tộc khác.\nKhi giai cấp thống trị đã trở thành lỗi thời, phản động, lợi ích giai cấp của nó mâu thuẫn gay gắt với lợi ích dân tộc, chúng sẵn sàng từ bỏ lợi ích dân tộc để bảo vệ lợi ích giai cấp. Lúc ấy, giai cấp thống trị bóc lột trở thành lực lượng kìm hãm sự phát triển của xã hội và của dân tộc. Yêu cầu tất yếu phải làm cách mạng xã hội lật đổ giai cấp thống trị, phản động để giải phóng giai cấp và giải phóng dân tộc.\nThực tiễn lịch sử đã chứng minh, ở các nước châu Âu từ thế kỷ XV, XVI giai cấp tư sản là lực lượng đại diện cho phương thức sản xuất mới (phương thức sản xuất tư bản chủ nghĩa), là giai cấp tiến bộ và cách mạng. Lợi ích của giai cấp tư sản lúc đó phù hợp với lợi ích của các giai cấp có lợi ích gắn liền với việc thủ tiêu chế độ phong kiến. Giai cấp tư sản trở thành giai cấp lãnh đạo phong trào cách mạng tư sản, thủ tiêu chế độ phong kiến và đưa tới sự hình thành các quốc gia, dân tộc tư sản. Khi giai cấp tư sản trở thành lực lượng thống trị xã hội đã duy trì quan hệ áp bức dân tộc và trở nên đối lập với lợi ích dân tộc. Để tiếp tục tìm kiếm lợi nhuận, giai cấp tư sản đã tiến hành xâm lược các dân tộc khác. Chủ nghĩa tư bản đã tạo ra những mâu thuẫn và bất bình đẳng dân tộc sâu sắc; đồng thời, là cội nguồn chủ yếu của áp bức dân tộc. Áp bức giai cấp là nguyên nhân căn bản của áp bức dân tộc. Vì vậy, đánh đổ giai cấp tư sản không những chỉ vì lợi ích của giai cấp vô sản và nhân dân lao động mà còn vì lợi ích của dân tộc. Chính vì vậy, chủ nghĩa Mác khẳng định, muốn xóa bỏ triệt để ách áp bức dân tộc thì phải xóa bỏ nguồn gốc của nó là chế độ người bóc lột người. Chính chủ nghĩa tư bản đã tạo ra tiền đề để thực hiện điều đó.\nVận dụng sáng tạo chủ nghĩa Mác - Lênin, Chủ tịch Hồ Chí Minh đã chỉ rõ, trong các nước thuộc địa và phụ thuộc, dân tộc chỉ có thể được giải phóng triệt để khi đặt dưới sự lãnh đạo của giai cấp công nhân và thực hiện thắng lợi các mục tiêu của cuộc cách mạng xã hội chủ nghĩa. Và chỉ khi đó vấn đề dân tộc, cùng vấn đề giai cấp mới được giải quyết một cách triệt để.\n* Vấn đề dân tộc có ảnh hưởng quan trọng đến vấn đề giai cấp\nChủ nghĩa Mác - Lênin chỉ rõ, dân tộc có vai trò quan trọng đối với vấn đề giai cấp. Sự hình thành dân tộc mở ra những điều kiện thuận lợi cho cuộc đấu tranh giai cấp. Sự hình thành các dân tộc tư sản đã mở ra một không gian rộng lớn cho sự phát triển của giai cấp và đấu tranh giai cấp. Đi kèm với sự phát triển của giai cấp tư sản là sự lớn mạnh của giai cấp vô sản. Giai cấp vô sản đã tận dụng được những điều kiện thuận lợi do dân tộc mang lại để tập hợp lực lượng đấu tranh lật đổ sự thống trị của giai cấp tư sản, giải phóng dân tộc và giải phóng giai cấp. Chủ nghĩa Mác - Lênin chỉ rõ, trong cuộc đấu tranh của mình, “Trước hết, giai cấp vô sản mỗi nước phải thanh toán xong giai cấp tư sản nước mình đã” và “giai cấp vô sản mỗi nước trước hết phải giành lấy chính quyền, phải tự vươn lên thành giai cấp dân tộc, phải tự mình trở thành dân tộc...”2.\n* Đấu tranh giải phóng dân tộc là điều kiện, tiền đề cho đấu tranh giải phóng giai cấp.\nThực tiễn lịch sử khẳng định, trong điều kiện chưa có độc lập dân tộc thì giai cấp đại biểu cho phương thức sản xuất mới muốn trở thành “giai cấp dân tộc” phải đi đầu trong phong trào cách mạng giải phóng dân tộc, phải thực hiện trước tiên nhiệm vụ khôi phục độc lập dân tộc.\nTrong thời đại đế quốc chủ nghĩa, các cuộc đấu tranh giải phóng dân tộc có vai trò hết sức to lớn đối với sự nghiệp cách mạng của giai cấp vô sản và nhân dân lao động. V.I. Lênin đưa ra khẩu hiệu kêu gọi giai cấp vô sản tất cả các nước và các dân tộc bị áp bức đoàn kết lại để chống lại chủ nghĩa tư bản. Đồng thời, đánh giá đúng đắn vai trò có ý nghĩa thời đại của cách mạng giải phóng dân tộc, chỉ ra sứ mệnh lịch sử của giai cấp công nhân trong nắm ngọn cờ dân tộc để lãnh đạo quần chúng làm cách mạng. V.I. Lênin chỉ rõ, nhiệm vụ của giai cấp công nhân ở các nước tư bản, đế quốc là phải ra sức ủng hộ phong trào cách mạng giải phóng dân tộc. Muốn đưa phong trào cách mạng tiến lên, giai cấp công nhân mỗi nước và chính đảng của nó phải tự mình chứng tỏ là người đại biểu chân chính của dân tộc, phải kết hợp chặt chẽ lợi ích giai cấp và lợi ích dân tộc; đấu tranh giai cấp và đấu tranh dân tộc.\nTừ những năm 20 của thế kỷ XX, Chủ tịch Hồ Chí Minh đã chỉ rõ một chân lý là ở các nước thuộc địa và phụ thuộc, sự nghiệp giải phóng giai cấp phải được bắt đầu từ sự nghiệp giải phóng dân tộc bởi vì, một khi dân tộc đã bị kẻ thù xâm lược thì giai cấp công nhân và nhân dân lao động cũng trở thành nô lệ cho các thế lực thống trị, bóc lột ngoại bang. Vì vậy, con đường giải phóng giai cấp ở các nước này tất yếu phải đi từ giải phóng dân tộc và phải gắn lợi ích dân tộc với lợi ích giai cấp. Đối với cách mạng Việt Nam, Chủ tịch Hồ Chí Minh khẳng định: “Muốn cứu nước, giải phóng dân tộc không có con đường nào khác con đường cách mạng vô sản”. Người chỉ rõ, cách mạng giải phóng dân tộc không phải là nhân tố bị động, phụ thuộc một chiều vào cách mạng vô sản ở các nước chính quốc; ngược lại, nếu đảng của giai cấp công nhân có đường lối đúng đắn, biết phát huy nhân tố bên trong và điều kiện quốc tế bên ngoài, nắm vững thời cơ thì cách mạng ở nước thuộc địa có thể thành công trước cách mạng ở chính quốc.\nTrong thời đại ngày nay, trước sự phát triển mạnh mẽ của lực lượng sản xuất do cuộc cách mạng khoa học và công nghệ hiện đại đem lại; xu thế toàn cầu hóa, khu vực hóa tăng nhanh làm cho quan hệ giao lưu, hiểu biết giữa các dân tộc xích lại gần nhau hơn. Đó là một trong những điều kiện thuận lợi cho cuộc đấu tranh giải phóng giai cấp và giải phóng dân tộc hiện nay. Một trong những đặc điểm chủ yếu của thời đại ngày nay là đấu tranh giai cấp và đấu tranh dân tộc gắn bó chặt chẽ với nhau."
  },
  {
    "title": "b) Quan hệ giai cấp, dân tộc với nhân loại",
    "level": 3,
    "body": "Nhân loại là khái niệm dùng để chỉ toàn thể cộng đồng người sống trên trái đất. Nhân loại được hình thành trên cơ sở của việc thiết lập những quan hệ giữa các thành viên, những tập đoàn và những cộng đồng trở thành một thể thống nhất. Cơ sở của sự thống nhất đó là bản chất người của từng cá thể và của cả cộng đồng, bản chất đó quy định lợi ích chung và quy luật phát triển chung của cả cộng đồng nhân loại.\nTrong xã hội cộng sản nguyên thủy, cộng đồng nhân loại chưa hình thành rõ nét và vấn đề nhân loại chưa được thực sự đặt ra bởi vì, trong xã hội cộng sản nguyên thủy, con người mới tách khỏi giới động vật; trình độ phát triển về mọi mặt, đặc biệt là trình độ của sản xuất vật chất còn rất lạc hậu nên các cộng đồng người sống biệt lập nhau và không tạo lập được các mối liên hệ rộng rãi. Chỉ đến giai đoạn phát triển nhất định của văn minh, con người mới bắt đầu có sự nhận thức đầy đủ hơn về chính mình, về quan hệ của mình với cộng đồng và về vận mệnh của loài người.\nThời cổ đại, một số nhà tư tưởng của giai cấp chủ nô đã coi giai cấp nô lệ chỉ là “công cụ biết nói”. Chế độ đẳng cấp cực đoan, chế độ phân biệt chủng tộc... trong lịch sử cho thấy, đã có những tập đoàn người đặc quyền, đặc lợi không muốn thừa nhận sự thống nhất trên cơ sở bản chất người của một bộ phận cộng đồng nhân loại.\nĐối lập với những quan điểm trên, nhiều nhà tư tưởng tiến bộ thuộc các thời đại khác nhau xem nhân loại như một cộng đồng có chung vận mệnh, bản chất; xem sự tồn tại của các cá nhân cũng như các cộng đồng, tập đoàn người... không thể tách rời khỏi vận mệnh nhân loại. Một số nhà tư tưởng thời kỳ phục hưng và thời đại cách mạng tư sản đã đề cao vấn đề nhân loại, đề cao quyền con người. Vì vậy, sự tự ý thức của nhân loại đã có một bước phát triển lớn. Tuy nhiên, quan niệm của họ còn trừu tượng và phiến diện, chưa thấy được tính lịch sử và tính giai cấp của vấn đề nhân loại.\nQuan niệm về tính thống nhất toàn nhân loại của chủ nghĩa duy vật lịch sử không dừng lại ở bản chất tộc loại trừu tượng của con người. Chủ nghĩa duy vật lịch sử đã chỉ ra bản chất xã hội của con người và loài người, coi đó là tiêu chí cơ bản để phân biệt loài người với loài vật và là cơ sở của sự thống nhất cộng đồng nhân loại. Con người là sinh vật có bản chất xã hội, do đó nhân loại là cộng đồng của những thực thể có bản chất xã hội. Cộng đồng đó không ngừng vận động, phát triển theo trình độ phát triển của những năng lực bản chất người.\nNền văn minh của nhân loại có được như ngày nay là thành quả hoạt động sáng tạo trong nhiều thiên niên kỷ của cả loài người. Lợi ích nhân loại là cái đảm bảo xét đến cùng cho lợi ích của cả loài người, vì vậy, bảo vệ lợi ích của nhân loại là trách nhiệm của mỗi cá nhân, tập đoàn và các cộng đồng xã hội.\nGiai cấp, dân tộc và nhân loại có mối quan hệ biện chứng với nhau. Là những cộng đồng và tập đoàn người tồn tại và phát triển không tách rời nhân loại, nên giai cấp, dân tộc và nhân loại luôn có tác động ảnh hưởng lẫn nhau. Quan hệ biện chứng giữa giai cấp, dân tộc và nhân loại được thể hiện trên các nội dung cơ bản sau:\nTrong xã hội có giai cấp, lợi ích nhân loại không tách rời với lợi ích giai cấp, lợi ích dân tộc và bị chi phối bởi lợi ích giai cấp và dân tộc. Trong xã hội có giai cấp, mỗi giai đoạn lịch sử nhất định tất yếu hình thành các quan hệ giai cấp, dân tộc. Giai cấp thống trị trong phương thức sản xuất còn phù hợp với quy luật vận động của lịch sử không những là đại biểu cho lợi ích chân chính của dân tộc, mà còn có vai trò to lớn thúc đẩy sự tiến bộ của văn minh nhân loại. Ngược lại, khi giai cấp thống trị dân tộc trở nên lỗi thời, phản động, thì lợi ích của nó về căn bản mâu thuẫn với lợi ích chung của dân tộc và lợi ích toàn nhân loại.\nTrong xã hội phong kiến, giai cấp tư sản là giai cấp đại diện cho phương thức sản xuất mới, phù hợp với quy luật phát triển của lịch sử. Lúc đó lợi ích của giai cấp tư sản phù hợp với lợi ích của dân tộc và nhân loại, có đóng góp tích cực trong việc hình thành dân tộc và thúc đẩy sự phát triển của cộng đồng nhân loại.\nSau khi trở thành giai cấp thống trị xã hội, giai cấp tư sản nhanh chóng củng cố quyền lực để duy trì áp bức giai cấp và áp bức dân tộc. Hiện nay, sự phát triển của chủ nghĩa tư bản đang đặt nhân loại đứng trước nhiều vấn đề toàn cầu cấp bách, như ô nhiễm môi trường sống, cạn kiệt tài nguyên, đói nghèo, bệnh tật, khủng bố, v.v.. Giai cấp tư sản thực sự là trở lực chính của tiến bộ xã hội hiện nay. Giai cấp công nhân là giai cấp có lợi ích phù hợp với lợi ích căn bản của dân tộc và nhân loại hiện nay, do vậy muốn giải phóng mình giai cấp công nhân phải đồng thời giải phóng dân tộc và giải phóng toàn nhân loại. Đó không chỉ là sự nghiệp giải phóng một giai cấp, mà còn là sự nghiệp giải phóng xã hội, giải phóng con người nói chung.\nTuy nhiên, vấn đề nhân loại không phải bị chi phối một cách thụ động bởi vấn đề dân tộc và giai cấp, mà có vai trò tác động trở lại rất quan trọng. Trước hết, sự tồn tại của nhân loại là tiền đề, là điều kiện tất yếu, thường xuyên của sự tồn tại dân tộc và giai cấp. Sự phát triển của thế giới, trước hết là sự phát triển của lực lượng sản xuất xã hội nói chung đã tạo ra những tiền đề quan trọng cho con người cải tạo tự nhiên và xã hội, phục vụ cho cuộc sống của mình.\nTác động của nhân loại đến dân tộc và giai cấp còn thể hiện ở chỗ, sự phát triển về mọi mặt của nhân loại tạo ra những điều kiện thuận lợi cho cuộc đấu tranh giải phóng dân tộc và giai cấp. Lịch sử đã khẳng định, sự phát triển của nhân loại qua mỗi giai đoạn đã từng bước tác động to lớn đến phong trào giải phóng giai cấp và giải phóng dân tộc. Sự phát triển đó tạo ra những điều kiện thuận lợi về vật chất và tinh thần cho cuộc đấu tranh của các giai cấp tiến bộ, cách mạng để lật đổ ách thống trị của các giai cấp thống trị, phản động.\nSự phát triển của lực lượng sản xuất, của cách mạng khoa học và công nghệ hiện đại, và toàn cầu hóa hiện nay đang làm gay gắt thêm những vấn đề toàn cầu của thời đại. Việc giải quyết tốt các vấn đề toàn cầu của thời đại sẽ tạo ra tiền đề và điều kiện góp phần giải quyết vấn đề dân tộc và giai cấp hiện nay.\nLý luận của chủ nghĩa Mác - Lênin là cơ sở lý luận, phương pháp luận khoa học để nhận thức và giải quyết đúng đắn mối quan hệ giữa giai cấp, dân tộc và nhân loại trong thời đại ngày nay. Đây còn là cơ sở lý luận để đấu tranh, phê phán các quan điểm sai lầm của các học giả tư sản và chủ nghĩa cơ hội về vấn đề này.\nTrong sự nghiệp cách mạng, Đảng Cộng sản Việt Nam đã giải quyết đúng đắn mối quan hệ giữa lợi ích giai cấp, lợi ích dân tộc và lợi ích nhân loại. Ngày nay, sự nghiệp đổi mới toàn diện đất nước Việt Nam chính là đóng góp quan trọng vào phong trào cách mạng thế giới và tiến bộ xã hội trong thời đại hiện nay. Để thực hiện được mục tiêu của cách mạng Việt Nam là độc lập dân tộc gắn liền với chủ nghĩa xã hội, cần phát huy sức mạnh đại đoàn kết toàn dân tộc kết hợp với sức mạnh của thời đại. Vận dụng sáng tạo lý luận về giai cấp và đấu tranh giai cấp, về mối quan hệ giữa giai cấp, dân tộc và nhân loại của chủ nghĩa Mác - Lênin và tư tưởng Hồ Chí Minh vào điều kiện cụ thể của Việt Nam, đưa sự nghiệp đổi mới đất nước theo định hướng xã hội chủ nghĩa đến thắng lợi, góp phần tích cực vào thực hiện tiến bộ xã hội của nhân dân thế giới."
  }
]