[
  {
    "title": "Giới thiệu / Mở đầu",
    "level": 0,
    "body": "Chương 3\nCHỦ NGHĨA DUY VẬT LỊCH SỬ"
  },
  {
    "title": "A. MỤC TIÊU",
    "level": 1,
    "body": ""
  },
  {
    "title": "1. Về kiến thức",
    "level": 2,
    "body": "Trang bị cho sinh viên những kiến thức về học thuyết hình thái kinh tế - xã hội; vận dụng ý nghĩa phương pháp luận vào thực tiễn của Việt Nam.\nGiúp sinh viên nắm được những quan điểm cơ bản của triết học Mác - Lênin về giai cấp và đấu tranh giai cấp; về nhà nước và cách mạng xã hội; về dân tộc, quan hệ giai cấp - dân tộc - nhân loại; ý nghĩa phương pháp luận trong nhận thức những vấn đề cơ bản của cách mạng Việt Nam.\nTrang bị cho sinh viên những quan điểm cơ bản của triết học Mác - Lênin về con người, về ý thức xã hội; sự vận dụng vào cách mạng Việt Nam."
  },
  {
    "title": "2. Về kỹ năng: Giúp sinh viên biết vận dụng những nguyên tắc phương pháp luận rút ra từ nội dung lý luận của chủ nghĩa duy vật lịch sử vào phân tích sự nhận thức và vận dụng sáng tạo của Đảng Cộng sản Việt Nam trong thực tiễn cách mạng Việt Nam.",
    "level": 2,
    "body": ""
  },
  {
    "title": "3. Về tư tưởng: Giúp cho sinh viên bồi dưỡng lập trường mácxít, củng cố niềm tin vào bản chất khoa học và cách mạng của chủ nghĩa duy vật lịch sử; tin tưởng vào đường lối quan điểm của Đảng; đấu tranh với các quan điểm thù địch, sai trái, bảo vệ nền tảng tư tưởng của Đảng.",
    "level": 2,
    "body": ""
  },
  {
    "title": "B. NỘI DUNG",
    "level": 1,
    "body": "Lịch sử tư tưởng triết học trước C. Mác đã có những tư tưởng triết học xã hội có giá trị, làm tiền đề, điều kiện để triết học mácxít kế thừa, phát triển quan niệm duy vật lịch sử. Tuy nhiên, do hạn chế lịch sử và các nguyên nhân khác nhau, các nhà triết học duy tâm trước C. Mác đã đi tìm nguyên nhân của sự phát triển lịch sử ở tư tưởng; coi cá nhân anh hùng quyết định sự phát triển lịch sử. Từ đó, họ quy tính tích cực của con người vào hoạt động tinh thần và tìm biện pháp cải tạo xã hội ở lĩnh vực tinh thần. Đối với các nhà triết học duy vật trước C. Mác, khuyết điểm chung của họ là phương pháp tư duy siêu hình trong xem xét bản chất con người và xã hội. Họ quy bản chất con người vào bản tính tự nhiên, tộc loại của các cá nhân riêng biệt. Phương pháp tư duy siêu hình đã dẫn đến tuyệt đối hóa vai trò của hoàn cảnh địa lý trong sự phát triển xã hội hoặc áp dụng quy luật tự nhiên, quy luật sinh học một cách máy móc vào đời sống xã hội. Đặc biệt, trong khi xem xét bản chất con người và xã hội, các nhà triết học duy vật trước C. Mác đã thiếu tính thực tiễn, không xuất phát từ thực tiễn, không hiểu vai trò hoạt động thực tiễn có tính cách mạng của con người."
  },
  {
    "title": "C. Mác và Ph. Ăngghen đã xuất phát từ tiền đề nghiên cứu về lịch sử xã hội là con người hiện thực, sống và hoạt động thực tiễn. “Những tiền đề xuất phát của chúng tôi không phải là những tiền đề tùy tiện, không phải là giáo điều; đó là những tiền đề hiện thực mà người ta có thể bỏ qua trong trí tưởng tượng thôi. Đó là những cá nhân hiện thực, hoạt động của họ và những điều kiện sinh hoạt vật chất của họ, những điều kiện mà họ thấy có sẵn cũng như những điều kiện do hoạt động của chính họ tạo ra...”. Nghiên cứu về cuộc sống của con người hiện thực, các nhà kinh điển phát hiện ra phương thức tồn tại của con người chính là hoạt động thực tiễn của họ. Động lực thúc đẩy con người hoạt động trong tiến trình lịch sử là nhu cầu và lợi ích, trước hết là nhu cầu vật chất. Ph. Ăngghen nhấn mạnh rằng, “cái sự thật hiển nhiên... là trước hết con người cần phải ăn, uống, ở và mặc, nghĩa là phải lao động, trước khi có thể đấu tranh để giành quyền thống trị, trước khi có thể hoạt động chính trị, tôn giáo, triết học, v.v..”. Nhưng “cá nhân là thực thể xã hội. Cho nên mọi biểu hiện sinh hoạt của nó... là biểu hiện và sự khẳng định của sinh hoạt xã hội”. C. Mác và Ph. Ăngghen viết: “Xã hội - cho dù nó có hình thức gì đi nữa - là cái gì? Là sản phẩm của sự tác động qua lại giữa những con người”. Con người, bằng hoạt động của mình, đã làm nên lịch sử, tạo ra xã hội.",
    "level": 1,
    "body": "Lôgích lý luận của C. Mác và Ph. Ăngghen là đưa thực tiễn vào triết học, có quan niệm đúng đắn về thực tiễn và vai trò của thực tiễn đối với đời sống xã hội. Từ đó giải đáp được những bí ẩn, bế tắc của mọi lý luận triết học cũ. Đặc biệt, hai ông lý giải một cách khoa học trên lập trường duy vật biện chứng mối quan hệ giữa vật chất và ý thức; mối quan hệ giữa ý thức xã hội và tồn tại xã hội; luận giải được vai trò của sản xuất vật chất và chỉ ra những quy luật vận động, phát triển của xã hội loài người, thực chất nó là những quy luật phản ánh hoạt động thực tiễn của con người trong lịch sử. Lần đầu tiên trong lịch sử tư tưởng triết học, chủ nghĩa duy vật lịch sử đã chỉ ra những quy luật, những động lực phát triển xã hội. Đây là một phát minh vĩ đại của C. Mác, đem lại một cuộc cách mạng trong triết học về xã hội."
  },
  {
    "title": "I- HỌC THUYẾT HÌNH THÁI KINH TẾ - XÃ HỘI",
    "level": 1,
    "body": "Học thuyết hình thái kinh tế - xã hội là một nội dung cơ bản của chủ nghĩa duy vật lịch sử, vạch ra những quy luật cơ bản của sự vận động và phát triển xã hội, là phương pháp luận khoa học để nhận thức, cải tạo xã hội. Ngày nay, thế giới đang có những biến đổi to lớn, sâu sắc nhưng lý luận hình thái kinh tế - xã hội vẫn giữ nguyên giá trị khoa học và giá trị thời đại. Đây là cơ sở thế giới quan, phương pháp luận khoa học chỉ đạo cho các chính đảng và nhà nước xã hội chủ nghĩa vận dụng sáng tạo trong xác định cương lĩnh, đường lối, chủ trương, chính sách xây dựng chủ nghĩa xã hội; là cơ sở khoa học của việc xác định con đường phát triển quá độ lên chủ nghĩa xã hội, bỏ qua chế độ tư bản chủ nghĩa ở Việt Nam hiện nay.\nHọc thuyết hình thái kinh tế - xã hội của chủ nghĩa Mác - Lênin bao gồm một hệ thống các quan điểm cơ bản: Sản xuất vật chất là cơ sở, nền tảng của sự vận động, sự phát triển của xã hội; biện chứng giữa lực lượng sản xuất và quan hệ sản xuất; biện chứng giữa cơ sở hạ tầng và kiến trúc thượng tầng của xã hội; sự phát triển các hình thái kinh tế - xã hội là một quá trình lịch sử - tự nhiên. Hệ thống quan điểm lý luận khoa học này đã phản ánh bản chất và quy luật vận động, phát triển của lịch sử xã hội loài người."
  },
  {
    "title": "1. Sản xuất vật chất là cơ sở của sự tồn tại và phát triển xã hội",
    "level": 2,
    "body": "Để tồn tại và phát triển, con người phải tiến hành sản xuất. Đó là hoạt động đặc trưng riêng có của con người và xã hội loài người. Sản xuất là hoạt động không ngừng sáng tạo ra các giá trị vật chất và tinh thần nhằm mục đích thỏa mãn nhu cầu tồn tại và phát triển của con người. Quá trình sản xuất diễn ra trong xã hội loài người chính là sự sản xuất xã hội - sản xuất và tái sản xuất ra đời sống hiện thực. Ph. Ăngghen khẳng định: “Theo quan điểm duy vật về lịch sử, nhân tố quyết định trong quá trình lịch sử xét đến cùng là sản xuất và tái sản xuất ra đời sống hiện thực. Cả tôi lẫn Mác chưa bao giờ khẳng định gì hơn thế. Còn nếu có ai đó xuyên tạc luận điểm này theo ý nghĩa nhân tố kinh tế là nhân tố quyết định duy nhất, thì người đó biến lời khẳng định này thành một câu trống rỗng, trừu tượng, vô nghĩa”.\nSự sản xuất xã hội, tức là sản xuất và tái sản xuất ra đời sống hiện thực, bao gồm ba phương diện không tách rời nhau là sản xuất vật chất, sản xuất tinh thần và sản xuất ra bản thân con người. Mỗi phương diện có vị trí, vai trò khác nhau, trong đó sản xuất vật chất giữ vai trò là cơ sở của sự tồn tại và phát triển của xã hội loài người, và xét đến cùng quyết định toàn bộ sự vận động, phát triển của đời sống xã hội. Cùng với sản xuất vật chất, con người tiến hành sản xuất tinh thần. Sản xuất tinh thần là hoạt động sáng tạo ra các giá trị tinh thần nhằm thỏa mãn nhu cầu tồn tại, phát triển của con người và xã hội. Đồng thời, cùng với hai phương diện sản xuất cơ bản nói trên, xã hội còn phải sản xuất ra bản thân con người. Sự sản xuất ra bản thân con người ở phạm vi cá nhân, gia đình là việc sinh đẻ và nuôi dạy con cái để duy trì nòi giống; ở phạm vi xã hội là sự tăng trưởng dân số, phát triển con người với tư cách là thực thể sinh học - xã hội.\nSản xuất vật chất là quá trình mà trong đó con người sử dụng công cụ lao động tác động trực tiếp hoặc gián tiếp vào tự nhiên, cải biến các dạng vật chất của giới tự nhiên để tạo ra của cải xã hội nhằm thỏa mãn nhu cầu tồn tại và phát triển của con người.\nSản xuất vật chất là cơ sở của sự tồn tại và phát triển xã hội loài người. Vai trò của sản xuất vật chất được thể hiện, trước hết, là tiền đề trực tiếp tạo ra tư liệu sinh hoạt của con người nhằm duy trì sự tồn tại và phát triển của con người nói chung cũng như từng cá thể người nói riêng. C. Mác khẳng định: “Đứa trẻ nào cũng biết rằng bất kể dân tộc nào cũng sẽ diệt vong, nếu như nó ngừng lao động, không phải một năm, mà chỉ mấy tuần thôi”.\nSản xuất vật chất là tiền đề của mọi hoạt động lịch sử của con người. Hoạt động sản xuất vật chất là cơ sở hình thành nên quan hệ kinh tế - vật chất giữa người với người, từ đó hình thành nên các quan hệ xã hội khác - quan hệ giữa người với người về chính trị, pháp luật, đạo đức, tôn giáo... Sản xuất vật chất đã tạo ra các điều kiện, phương tiện bảo đảm cho hoạt động tinh thần của con người và duy trì, phát triển phương thức sản xuất tinh thần của xã hội. C. Mác chỉ rõ: “Việc sản xuất ra những tư liệu sinh hoạt vật chất trực tiếp... tạo ra một cơ sở, từ đó mà người ta phát triển các thể chế nhà nước, các quan điểm pháp quyền, nghệ thuật và thậm chí cả những quan niệm tôn giáo của con người ta”. Nhờ sự sản xuất ra của cải vật chất để duy trì sự tồn tại và phát triển của mình, con người đồng thời sáng tạo ra toàn bộ đời sống vật chất và đời sống tinh thần của xã hội với tất cả sự phong phú, phức tạp của nó.\nSản xuất vật chất là điều kiện chủ yếu sáng tạo ra bản thân con người. Nhờ hoạt động sản xuất vật chất mà con người hình thành nên ngôn ngữ, nhận thức, tư duy, tình cảm, đạo đức... Sản xuất vật chất là điều kiện cơ bản, quyết định nhất đối với sự hình thành, phát triển phẩm chất xã hội của con người. Ph. Ăngghen khẳng định rằng, trên một ý nghĩa cao nhất, “lao động đã sáng tạo ra bản thân con người”. Như vậy, nhờ lao động sản xuất mà con người vừa tách khỏi tự nhiên, vừa hòa nhập với tự nhiên, cải tạo tự nhiên, sáng tạo ra mọi giá trị vật chất và tinh thần, đồng thời sáng tạo ra chính bản thân con người.\nNguyên lý về vai trò của sản xuất vật chất là cơ sở của sự tồn tại và phát triển xã hội loài người có ý nghĩa phương pháp luận quan trọng. Để nhận thức và cải tạo xã hội phải xuất phát từ đời sống sản xuất, từ nền sản xuất vật chất xã hội. Xét đến cùng, không thể dùng tinh thần để giải thích đời sống tinh thần; để phát triển xã hội phải bắt đầu từ phát triển đời sống kinh tế - vật chất."
  },
  {
    "title": "2. Biện chứng giữa lực lượng sản xuất và quan hệ sản xuất",
    "level": 2,
    "body": ""
  },
  {
    "title": "a) Phương thức sản xuất",
    "level": 3,
    "body": "Ở mỗi giai đoạn lịch sử con người tiến hành sản xuất theo một cách thức nhất định, tức là có một cách sinh sống, cách sản xuất riêng, đó là phương thức sản xuất. Phương thức sản xuất là cách thức con người tiến hành quá trình sản xuất vật chất ở những giai đoạn lịch sử nhất định của xã hội loài người. Phương thức sản xuất là sự thống nhất giữa lực lượng sản xuất với một trình độ nhất định và quan hệ sản xuất tương ứng. Lực lượng sản xuất và quan hệ sản xuất là các khái niệm chỉ hai mối quan hệ “song trùng” của nền sản xuất vật chất xã hội, đó là quan hệ giữa con người với tự nhiên và quan hệ giữa người với người trong quá trình sản xuất vật chất. “Người ta không thể sản xuất được nếu không kết hợp với nhau theo một cách nào đó để hoạt động chung và để trao đổi hoạt động với nhau. Muốn sản xuất được, người ta phải có những mối liên hệ và quan hệ nhất định với nhau; và quan hệ của họ với giới tự nhiên, tức là việc sản xuất”. Do vậy, phương thức sản xuất là cách thức con người thực hiện đồng thời sự tác động giữa con người với tự nhiên và sự tác động giữa người với người để sáng tạo ra của cải vật chất phục vụ nhu cầu con người và xã hội ở những giai đoạn lịch sử nhất định.\n* Lực lượng sản xuất là sự kết hợp giữa người lao động với tư liệu sản xuất, tạo ra sức sản xuất và năng lực thực tiễn làm biến đổi các đối tượng vật chất của giới tự nhiên theo nhu cầu nhất định của con người và xã hội. Về cấu trúc, lực lượng sản xuất được xem xét trên cả hai mặt, đó là mặt kinh tế - kỹ thuật (tư liệu sản xuất) và mặt kinh tế - xã hội (người lao động). Lực lượng sản xuất chính là sự kết hợp giữa “lao động sống” với “lao động vật hóa” tạo ra sức sản xuất, là toàn bộ những năng lực thực tiễn dùng trong sản xuất của xã hội ở các thời kỳ nhất định. Như vậy, lực lượng sản xuất là một hệ thống gồm các yếu tố (người lao động và tư liệu sản xuất) cùng mối quan hệ (phương thức kết hợp), tạo ra thuộc tính đặc biệt (sức sản xuất) để cải biến giới tự nhiên, sáng tạo ra của cải vật chất theo mục đích của con người. Đây là sự thể hiện năng lực thực tiễn cơ bản nhất - năng lực hoạt động sản xuất vật chất của con người.\nNgười lao động là con người có tri thức, kinh nghiệm, kỹ năng lao động và năng lực sáng tạo nhất định trong quá trình sản xuất của xã hội. Người lao động là chủ thể sáng tạo, đồng thời là chủ thể tiêu dùng mọi của cải vật chất xã hội. Đây là nguồn lực cơ bản, vô tận và đặc biệt của sản xuất. Ngày nay, trong nền sản xuất xã hội, tỷ trọng lao động cơ bắp đang có xu thế giảm, trong đó lao động có trí tuệ và lao động trí tuệ ngày càng tăng lên.\nTư liệu sản xuất là điều kiện vật chất cần thiết để tổ chức sản xuất, bao gồm tư liệu lao động và đối tượng lao động. Đối tượng lao động là những yếu tố vật chất của sản xuất mà con người dùng tư liệu lao động tác động lên, nhằm biến đổi chúng cho phù hợp với mục đích sử dụng của con người. Tư liệu lao động là những yếu tố vật chất của sản xuất mà con người dựa vào đó để tác động lên đối tượng lao động nhằm biến đổi đối tượng lao động thành sản phẩm đáp ứng yêu cầu sản xuất của con người. Tư liệu lao động gồm công cụ lao động và phương tiện lao động. Phương tiện lao động là những yếu tố vật chất của sản xuất, cùng với công cụ lao động mà con người sử dụng để tác động lên đối tượng lao động trong quá trình sản xuất vật chất. Công cụ lao động là những phương tiện vật chất mà con người trực tiếp sử dụng để tác động vào đối tượng lao động nhằm biến đổi chúng, tạo ra của cải vật chất phục vụ nhu cầu của con người và xã hội. Công cụ lao động là yếu tố vật chất “trung gian”, “truyền dẫn” giữa người lao động và đối tượng lao động trong tiến hành sản xuất. Đây chính là “khí quan” của bộ óc, là tri thức được vật thể hóa do con người sáng tạo ra và được con người sử dụng làm phương tiện vật chất của quá trình sản xuất. Công cụ lao động giữ vai trò quyết định đến năng suất lao động. Ngày nay, trong điều kiện cuộc Cách mạng công nghiệp lần thứ tư đang phát triển, công cụ lao động được tin học hóa, tự động hóa và trí tuệ hóa càng có vai trò đặc biệt quan trọng. Công cụ lao động là yếu tố động nhất, cách mạng nhất trong lực lượng sản xuất, là nguyên nhân sâu xa của mọi biến đổi kinh tế - xã hội trong lịch sử; là thước đo trình độ tác động, cải biến tự nhiên của con người và tiêu chuẩn để phân biệt các thời đại kinh tế khác nhau. Chính vì vậy, C. Mác khẳng định: “Những thời đại kinh tế khác nhau không phải ở chỗ chúng sản xuất ra cái gì mà là ở chỗ chúng sản xuất bằng cách nào, với những tư liệu lao động nào”.\nĐặc trưng chủ yếu của lực lượng sản xuất là mối quan hệ giữa người lao động và công cụ lao động. Trong lực lượng sản xuất, người lao động là nhân tố hàng đầu giữ vai trò quyết định, bởi vì người lao động là chủ thể sáng tạo và sử dụng công cụ lao động. Suy đến cùng, các tư liệu sản xuất chỉ là sản phẩm lao động của con người, đồng thời giá trị và hiệu quả thực tế của các tư liệu sản xuất phụ thuộc vào trình độ sử dụng của người lao động. Hơn nữa, trong quá trình sản xuất, nếu như công cụ lao động bị hao phí và di chuyển dần giá trị vào sản phẩm, thì do bản chất sáng tạo của mình, trong quá trình lao động người lao động không chỉ sáng tạo ra giá trị đủ bù đắp hao phí lao động, mà còn sáng tạo ra giá trị mới lớn hơn giá trị bỏ ra ban đầu. Người lao động là nguồn gốc của mọi sáng tạo trong sản xuất vật chất, nguồn gốc của sự phát triển sản xuất. Cùng với người lao động, công cụ lao động là yếu tố cơ bản, quan trọng không thể thiếu, đặc biệt, trình độ phát triển của công cụ lao động là nhân tố quyết định năng suất lao động xã hội. Lực lượng sản xuất là kết quả năng lực thực tiễn của con người, nhưng bản thân năng lực thực tiễn này bị quy định bởi những điều kiện khách quan mà trong đó con người sống và hoạt động. Vì vậy, lực lượng sản xuất luôn có tính khách quan. Tuy nhiên, quá trình phát triển lực lượng sản xuất là kết quả của sự thống nhất biện chứng giữa khách quan và chủ quan.\nSự phát triển của lực lượng sản xuất là phát triển ở cả tính chất và trình độ. Tính chất của lực lượng sản xuất nói lên tính chất cá nhân hoặc tính chất xã hội hóa trong việc sử dụng tư liệu sản xuất. Trình độ của lực lượng sản xuất là sự phát triển của người lao động và công cụ lao động. Trình độ của lực lượng sản xuất được thể hiện ở trình độ của công cụ lao động; trình độ tổ chức lao động xã hội; trình độ ứng dụng khoa học vào sản xuất; trình độ, kinh nghiệm, kỹ năng của người lao động và đặc biệt là trình độ phân công lao động xã hội. Trong thực tế, tính chất và trình độ phát triển của lực lượng sản xuất không tách rời nhau.\nNghiên cứu sự phát triển của lực lượng sản xuất trong lịch sử, C. Mác khẳng định: “Tri thức xã hội phổ biến [Wissen, knowledge] đã chuyển hóa đến mức độ nào thành lực lượng sản xuất trực tiếp”. Ngày nay, trên thế giới đang diễn ra cuộc cách mạng khoa học và công nghệ hiện đại, khoa học đã trở thành lực lượng sản xuất trực tiếp. Khoa học sản xuất ra của cải đặc biệt, hàng hóa đặc biệt. Đó là những phát minh sáng chế, những bí mật công nghệ, trở thành nguyên nhân của mọi biến đổi trong lực lượng sản xuất. Hiện nay, khoảng cách từ phát minh, sáng chế đến ứng dụng vào sản xuất đã được rút ngắn làm cho năng suất lao động, của cải xã hội tăng nhanh. Khoa học kịp thời giải quyết những mâu thuẫn, những yêu cầu do sản xuất đặt ra; có khả năng phát triển “vượt trước” và thâm nhập vào tất cả các yếu tố của sản xuất, trở thành mắt khâu bên trong của quá trình sản xuất. Tri thức khoa học được kết tinh, “vật hóa” vào người lao động, người quản lý, công cụ lao động và đối tượng lao động. Sự phát triển của khoa học đã kích thích sự phát triển năng lực làm chủ sản xuất của con người.\nTrong thời đại ngày nay, cuộc Cách mạng công nghiệp lần thứ tư đang phát triển, cả người lao động và công cụ lao động được trí tuệ hóa, nền kinh tế của nhiều quốc gia phát triển đang trở thành nền kinh tế tri thức. Đó là nền kinh tế mà trong đó sự sản sinh, phổ cập và sử dụng tri thức của con người đóng vai trò quyết định nhất đối với sự phát triển kinh tế, từ đó tạo ra của cải vật chất và nâng cao chất lượng cuộc sống con người. Đặc trưng của kinh tế tri thức là công nghệ cao, công nghệ thông tin, trí tuệ nhân tạo được ứng dụng rộng rãi trong sản xuất và trong đời sống xã hội. Lực lượng sản xuất phát triển trong mối quan hệ biện chứng với quan hệ sản xuất.\n* Quan hệ sản xuất là tổng hợp các quan hệ kinh tế - vật chất giữa người với ngư­ời trong quá trình sản xuất vật chất. Đây chính là một quan hệ vật chất quan trọng nhất - quan hệ kinh tế, trong các mối quan hệ vật chất giữa người với người. Quá trình sản xuất vật chất chính là tổng thể các yếu tố trong một quá trình thống nhất, gồm sản xuất, phân phối, trao đổi và tiêu dùng của cải vật chất. Quan hệ sản xuất bao gồm quan hệ về sở hữu đối với tư­ liệu sản xuất, quan hệ trong tổ chức quản lý và trao đổi hoạt động với nhau, quan hệ về phân phối sản phẩm lao động. Quan hệ sở hữu về tư liệu sản xuất là quan hệ giữa các tập đoàn người trong việc chiếm hữu, sử dụng các tư liệu sản xuất xã hội. Đây là quan hệ quy định địa vị kinh tế - xã hội của các tập đoàn người trong sản xuất, từ đó quy định quan hệ quản lý và phân phối. Quan hệ sở hữu về tư liệu sản xuất là quan hệ xuất phát, cơ bản, trung tâm của quan hệ sản xuất, luôn có vai trò quyết định các quan hệ khác bởi vì, lực lượng xã hội nào nắm phương tiện vật chất chủ yếu của quá trình sản xuất thì sẽ quyết định việc quản lý quá trình sản xuất và phân phối sản phẩm.\nQuan hệ về tổ chức và quản lý sản xuất là quan hệ giữa các tập đoàn người trong việc tổ chức sản xuất và phân công lao động. Quan hệ này có vai trò quyết định trực tiếp đến quy mô, tốc độ, hiệu quả của nền sản xuất; có khả năng đẩy nhanh hoặc kìm hãm sự phát triển của nền sản xuất xã hội. Ngày nay, khoa học tổ chức quản lý sản xuất hiện đại có tầm quan trọng đặc biệt trong nâng cao hiệu quả quá trình sản xuất.\nQuan hệ về phân phối sản phẩm lao động là quan hệ giữa các tập đoàn người trong việc phân phối sản phẩm lao động xã hội, nói lên cách thức và quy mô của cải vật chất mà các tập đoàn người được hưởng. Quan hệ này có vai trò đặc biệt quan trọng, kích thích trực tiếp lợi ích con người; là “chất xúc tác” kinh tế thúc đẩy tốc độ, nhịp điệu sản xuất, làm năng động hóa toàn bộ đời sống kinh tế - xã hội. Hoặc ngược lại, có thể làm trì trệ, kìm hãm quá trình sản xuất.\nCác mặt trong quan hệ sản xuất có mối quan hệ hữu cơ, tác động qua lại, chi phối, ảnh hưởng lẫn nhau; trong đó quan hệ về sở hữu tư liệu sản xuất giữ vai trò quyết định bản chất và tính chất của quan hệ sản xuất. Quan hệ sản xuất hình thành một cách khách quan, là quan hệ đầu tiên, cơ bản chủ yếu, quyết định mọi quan hệ xã hội."
  },
  {
    "title": "b) Quy luật quan hệ sản xuất phù hợp với trình độ phát triển của lực lượng sản xuất",
    "level": 3,
    "body": "Mối quan hệ biện chứng giữa lực lượng sản xuất và quan hệ sản xuất quy định sự vận động, phát triển của các phương thức sản xuất trong lịch sử. Lực lượng sản xuất và quan hệ sản xuất là hai mặt của một phương thức sản xuất có tác động biện chứng, trong đó lực lượng sản xuất quyết định quan hệ sản xuất, còn quan hệ sản xuất tác động trở lại đối với lực lượng sản xuất. C. Mác viết: “Trong sự sản xuất xã hội ra đời sống của mình, con người có những quan hệ nhất định, tất yếu, không tùy thuộc vào ý muốn của họ - tức những quan hệ sản xuất, những quan hệ này phù hợp với một trình độ phát triển nhất định của các lực lượng sản xuất vật chất của họ”. Nếu quan hệ sản xuất phù hợp với trình độ phát triển của lực lượng sản xuất thì thúc đẩy lực lượng sản xuất phát triển, ngược lại, nếu không phù hợp sẽ kìm hãm sự phát triển của lực lượng sản xuất. Đây là quy luật cơ bản nhất của sự vận động và phát triển xã hội.\n* Vai trò quyết định của lực lượng sản xuất đối với quan hệ sản xuất\nSự vận động và phát triển của phương thức sản xuất bắt đầu từ sự biến đổi của lực lượng sản xuất. Lực lượng sản xuất là nội dung của quá trình sản xuất có tính năng động, cách mạng, thường xuyên vận động và phát triển; quan hệ sản xuất là hình thức xã hội của quá trình sản xuất, có tính ổn định tương đối. Trong sự vận động của mâu thuẫn biện chứng đó lực lượng sản xuất quyết định quan hệ sản xuất. Cơ sở khách quan quy định sự vận động, phát triển không ngừng của lực lượng sản xuất là do biện chứng giữa sản xuất và nhu cầu con người; do tính năng động và cách mạng của sự phát triển công cụ lao động; do vai trò của người lao động là chủ thể sáng tạo, là lực lượng sản xuất hàng đầu; do tính kế thừa khách quan của sự phát triển lực lượng sản xuất trong tiến trình lịch sử.\nSự phù hợp của quan hệ sản xuất với trình độ phát triển của lực lượng sản xuất là đòi hỏi khách quan của nền sản xuất. Lực lượng sản xuất vận động, phát triển không ngừng sẽ mâu thuẫn với tính “đứng im” tương đối của quan hệ sản xuất. Quan hệ sản xuất từ chỗ là “hình thức phù hợp”, “tạo địa bàn” phát triển của lực lượng sản xuất trở thành “xiềng xích” kìm hãm sự phát triển của lực lượng sản xuất. Đòi hỏi tất yếu của nền sản xuất xã hội là phải xóa bỏ quan hệ sản xuất cũ, thiết lập quan hệ sản xuất mới phù hợp với trình độ phát triển của lực lượng sản xuất đã phát triển. C. Mác đã nêu tư tưởng về vai trò của sự phát triển lực lượng sản xuất đối với việc thay đổi các quan hệ xã hội: “Những quan hệ xã hội đều gắn liền mật thiết với những lực lượng sản xuất. Do có những lực lượng sản xuất mới, loài người thay đổi phương thức sản xuất của mình, và do thay đổi phương thức sản xuất, cách kiếm sống của mình, loài người thay đổi tất cả những quan hệ xã hội của mình. Cái cối xay quay bằng tay đưa lại xã hội có lãnh chúa, các cối xay chạy bằng hơi nước đưa lại xã hội có nhà tư bản công nghiệp”.\nLực lượng sản xuất quyết định sự ra đời của một kiểu quan hệ sản xuất mới trong lịch sử, quyết định nội dung và tính chất của quan hệ sản xuất. Bằng năng lực nhận thức và thực tiễn, con người phát hiện và giải quyết mâu thuẫn, thiết lập sự phù hợp mới làm cho quá trình sản xuất phát triển đạt tới một nấc thang cao hơn.\n* Sự tác động trở lại của quan hệ sản xuất đối với lực lượng sản xuất\nDo quan hệ sản xuất là hình thức xã hội của quá trình sản xuất có tính độc lập tương đối nên tác động mạnh mẽ trở lại đối với lực lượng sản xuất. Vai trò của quan hệ sản xuất đối với lực lượng sản xuất được thực hiện thông qua sự phù hợp biện chứng giữa quan hệ sản xuất với trình độ phát triển của lực lượng sản xuất.\nSự phù hợp của quan hệ sản xuất với trình độ phát triển của lực lượng sản xuất là đòi hỏi khách quan của nền sản xuất. Sự phù hợp của quan hệ sản xuất với lực lượng sản xuất là một trạng thái trong đó quan hệ sản xuất là “hình thức phát triển” của lực lượng sản xuất và “tạo địa bàn đầy đủ” cho lực lượng sản xuất phát triển. Sự phù hợp bao gồm sự kết hợp đúng đắn giữa các yếu tố cấu thành lực lượng sản xuất; giữa các yếu tố cấu thành quan hệ sản xuất; giữa lực lượng sản xuất với quan hệ sản xuất. Sự phù hợp bao gồm cả việc tạo điều kiện tối ưu cho việc sử dụng và kết hợp giữa người lao động và tư liệu sản xuất; tạo điều kiện hợp lý cho người lao động sáng tạo trong sản xuất và hưởng thụ thành quả vật chất, tinh thần của lao động.\nNếu quan hệ sản xuất “đi sau” hay “vượt trước” trình độ phát triển của lực lượng sản xuất đều là không phù hợp. Sự phù hợp không có nghĩa là đồng nhất tuyệt đối mà chỉ là tương đối, trong đó chứa đựng cả sự khác biệt. Sự phù hợp diễn ra trong sự vận động và phát triển, là một quá trình thường xuyên nảy sinh mâu thuẫn và giải quyết mâu thuẫn.\nSự phù hợp của quan hệ sản xuất với lực lượng sản xuất quy định mục đích, xu hướng phát triển của nền sản xuất xã hội; hình thành hệ thống động lực thúc đẩy sản xuất phát triển; đem lại năng suất, chất lượng, hiệu quả của nền sản xuất.\nSự tác động của quan hệ sản xuất đối với lực lượng sản xuất diễn ra theo hai chiều hướng, đó là thúc đẩy hoặc kìm hãm sự phát triển của lực lượng sản xuất. Khi quan hệ sản xuất phù hợp với lực lượng sản xuất thì nền sản xuất phát triển đúng hướng, quy mô sản xuất được mở rộng; những thành tựu khoa học và công nghệ được áp dụng nhanh chóng; người lao động nhiệt tình, hăng hái sản xuất, lợi ích của người lao động được đảm bảo và thúc đẩy lực lượng sản xuất phát triển. Nếu quan hệ sản xuất không phù hợp sẽ kìm hãm, thậm chí phá hoại lực lượng sản xuất. Tuy nhiên, sự kìm hãm đó chỉ diễn ra trong những giới hạn, với những điều kiện nhất định.\nTrạng thái vận động của mâu thuẫn biện chứng giữa lực lượng sản xuất và quan hệ sản xuất diễn ra là từ phù hợp đến không phù hợp, rồi đến sự phù hợp mới ở trình độ cao hơn. C. Mác khẳng định: “Tới một giai đoạn phát triển nào đó của chúng, các lực lượng sản xuất vật chất của xã hội mâu thuẫn với những quan hệ sản xuất hiện có... trong đó từ trước đến nay các lực lượng sản xuất vẫn phát triển. Từ chỗ là những hình thức phát triển của lực lượng sản xuất, những quan hệ ấy trở thành những xiềng xích của các lực lượng sản xuất. Khi đó bắt đầu thời đại một cuộc cách mạng xã hội”.\nQuy luật quan hệ sản xuất phù hợp với trình độ phát triển của lực lượng sản xuất là quy luật phổ biến tác động trong toàn bộ tiến trình lịch sử nhân loại. Sự tác động biện chứng giữa lực lượng sản xuất với quan hệ sản xuất làm cho lịch sử xã hội loài người là lịch sử kế tiếp nhau của các phương thức sản xuất, từ phương thức sản xuất cộng sản nguyên thủy qua phương thức sản xuất chiếm hữu nô lệ, phương thức sản xuất phong kiến, phương thức sản xuất tư bản chủ nghĩa và đang phát triển đến phương thức sản xuất cộng sản chủ nghĩa.\nTrong xã hội xã hội chủ nghĩa, do những điều kiện khách quan và chủ quan quy định, quy luật quan hệ sản xuất phù hợp với trình độ phát triển của lực lượng sản xuất có những đặc điểm tác động riêng. Sự phù hợp giữa quan hệ sản xuất với trình độ phát triển của lực lượng sản xuất đòi hỏi tất yếu phải thiết lập chế độ công hữu về tư liệu sản xuất chủ yếu. Phương thức sản xuất xã hội chủ nghĩa dần dần loại trừ đối kháng xã hội. Sự phù hợp không diễn ra “tự động”, đòi hỏi trình độ tự giác cao trong nhận thức và vận dụng quy luật. Quan hệ biện chứng giữa lực lượng sản xuất và quan hệ sản xuất trong xã hội xã hội chủ nghĩa có thể bị “biến dạng” do nhận thức và vận dụng không đúng quy luật.\n* Ý nghĩa trong đời sống xã hội\nQuy luật quan hệ sản xuất phù hợp với trình độ phát triển của lực lượng sản xuất có ý nghĩa phương pháp luận rất quan trọng. Trong thực tiễn, muốn phát triển kinh tế phải bắt đầu từ phát triển lực lượng sản xuất, trước hết là phát triển lực lượng lao động và công cụ lao động. Muốn xóa bỏ một quan hệ sản xuất cũ, thiết lập một quan hệ sản xuất mới phải căn cứ từ trình độ phát triển của lực lượng sản xuất, không phải là kết quả của mệnh lệnh hành chính, của mọi sắc lệnh từ trên ban xuống, mà từ tính tất yếu kinh tế, yêu cầu khách quan của quy luật kinh tế, chống tùy tiện, chủ quan, duy tâm, duy ý chí.\nNhận thức đúng đắn quy luật này có ý nghĩa rất quan trọng trong quán triệt, vận dụng quan điểm, đường lối, chính sách, là cơ sở khoa học để nhận thức sâu sắc sự đổi mới tư duy kinh tế của Đảng Cộng sản Việt Nam. Trong quá trình cách mạng Việt Nam, đặc biệt trong sự nghiệp đổi mới toàn diện đất nước hiện nay, Đảng Cộng sản Việt Nam luôn luôn quan tâm hàng đầu đến việc nhận thức và vận dụng đúng đắn, sáng tạo quy luật này đã đem lại hiệu quả to lớn trong thực tiễn. Nền kinh tế thị trường định hướng xã hội chủ nghĩa là mô hình kinh tế tổng quát, là sự vận dụng quy luật quan hệ sản xuất phù hợp với trình độ phát triển của lực lượng sản xuất trong phát triển kinh tế ở Việt Nam hiện nay."
  },
  {
    "title": "3. Biện chứng giữa cơ sở hạ tầng và kiến trúc thượng tầng của xã hội",
    "level": 2,
    "body": "Mỗi xã hội trong lịch sử là một tổng thể các quan hệ xã hội, bao gồm quan hệ vật chất và quan hệ tinh thần nhất định. Sự liên hệ và tác động lẫn nhau giữa quan hệ vật chất với quan hệ tinh thần của xã hội được phản ánh trong quy luật về mối quan hệ biện chứng giữa cơ sở hạ tầng và kiến trúc thượng tầng của xã hội. Đây là quy luật cơ bản tác động ở mọi hình thái kinh tế - xã hội trong lịch sử."
  },
  {
    "title": "a) Khái niệm cơ sở hạ tầng và kiến trúc thượng tầng của xã hội",
    "level": 3,
    "body": "* Cơ sở hạ tầng là toàn bộ những quan hệ sản xuất của một xã hội trong sự vận động hiện thực của chúng hợp thành cơ cấu kinh tế của xã hội đó.\nCơ sở hạ tầng được hình thành một cách khách quan trong quá trình sản xuất vật chất của xã hội. Đây là toàn bộ các quan hệ sản xuất tồn tại trên thực tế mà trong quá trình vận động của nó hợp thành một cơ cấu kinh tế hiện thực. C. Mác chỉ rõ: “Toàn bộ những quan hệ sản xuất ấy họp thành cơ cấu kinh tế của xã hội, tức là cái cơ sở hiện thực trên đó dựng lên một kiến trúc thượng tầng pháp lý và chính trị và những hình thái ý thức xã hội nhất định tương ứng với cơ sở hiện thực đó”. Các quan hệ sản xuất là các quan hệ cơ bản, đầu tiên, chủ yếu, quyết định mọi quan hệ xã hội khác.\nCấu trúc của cơ sở hạ tầng bao gồm: quan hệ sản xuất thống trị, quan hệ sản xuất tàn dư, quan hệ sản xuất mầm mống. Mỗi quan hệ sản xuất có một vị trí, vai trò khác nhau; trong đó quan hệ sản xuất thống trị đặc trưng cho cơ sở hạ tầng của xã hội đó.\n* Kiến trúc thượng tầng là toàn bộ những quan điểm, tư tưởng xã hội với những thiết chế xã hội tương ứng cùng những quan hệ nội tại của thượng tầng hình thành trên một cơ sở hạ tầng nhất định.\nCấu trúc của kiến trúc thượng tầng bao gồm toàn bộ những quan điểm tư tưởng về chính trị, pháp quyền, đạo đức, tôn giáo, nghệ thuật, triết học... cùng những thiết chế xã hội tương ứng như nhà nước, đảng phái, giáo hội, các đoàn thể và tổ chức xã hội khác. Các yếu tố về quan điểm tư tưởng và thiết chế xã hội có quan hệ với nhau, cùng với những quan hệ nội tại trong các yếu tố đó hợp thành kiến trúc thượng tầng của xã hội.\nMỗi yếu tố của kiến trúc thượng tầng có đặc điểm và quy luật phát triển riêng. Các yếu tố của kiến trúc thượng tầng tồn tại trong mối liên hệ tác động qua lại lẫn nhau và đều nảy sinh trên cơ sở hạ tầng, phản ánh những cơ sở hạ tầng nhất định. Song, không phải tất cả các yếu tố của kiến trúc thượng tầng đều liên hệ như nhau đối với cơ sở hạ tầng của nó. Một số bộ phận như kiến trúc thượng tầng chính trị và pháp lý có mối liên hệ trực tiếp với cơ sở hạ tầng, còn các yếu tố khác như triết học, nghệ thuật, tôn giáo, đạo đức, v.v. lại có liên hệ gián tiếp với cơ sở hạ tầng sinh ra nó.\nTrong xã hội có đối kháng giai cấp, kiến trúc thượng tầng cũng mang tính chất đối kháng. Tính đối kháng của kiến trúc thượng tầng phản ánh tính đối kháng của cơ sở hạ tầng và được biểu hiện ở sự xung đột, sự đấu tranh về tư tưởng của các giai cấp đối kháng. Song, đặc trưng của kiến trúc thượng tầng là sự thống trị về chính trị và tư tưởng của giai cấp thống trị. Thực tế cho thấy, trong kiến trúc thượng tầng của các xã hội có đối kháng giai cấp, ngoài bộ phận chủ yếu có vai trò là công cụ của giai cấp thống trị còn có những yếu tố, bộ phận đối lập với nó, đó là những tư tưởng, quan điểm và các tổ chức chính trị của giai cấp bị thống trị, bị bóc lột.\nBộ phận có quyền lực mạnh nhất trong kiến trúc thượng tầng của xã hội có đối kháng giai cấp là nhà nước - công cụ quyền lực chính trị đặc biệt của giai cấp thống trị. Chính nhờ có nhà nước mà tư tưởng của giai cấp thống trị mới trở thành một sức mạnh thống trị toàn bộ đời sống xã hội. Giai cấp nào thống trị về mặt kinh tế và nắm giữ chính quyền nhà nước thì hệ tư tưởng, cùng những thể chế của giai cấp ấy cũng giữ địa vị thống trị. Nó quy định và tác động trực tiếp đến xu hướng của toàn bộ đời sống tinh thần xã hội và cả tính chất, đặc trưng cơ bản của toàn bộ kiến trúc thượng tầng."
  },
  {
    "title": "b) Quy luật về mối quan hệ biện chứng giữa cơ sở hạ tầng và kiến trúc thượng tầng của xã hội",
    "level": 3,
    "body": "Mối quan hệ biện chứng giữa cơ sở hạ tầng và kiến trúc thượng tầng là một quy luật cơ bản của sự vận động, phát triển lịch sử xã hội. Cơ sở hạ tầng và kiến trúc thượng tầng là hai mặt cơ bản của xã hội gắn bó hữu cơ, có quan hệ biện chứng, trong đó cơ sở hạ tầng quyết định kiến trúc thượng tầng, còn kiến trúc thượng tầng tác động trở lại to lớn, mạnh mẽ đối với cơ sở hạ tầng. Thực chất là sự hình thành, vận động và phát triển của các quan điểm tư tưởng cùng với những thể chế chính trị - xã hội tương ứng xét đến cùng phụ thuộc vào quá trình sản xuất và tái sản xuất các quan hệ kinh tế.\n* Vai trò quyết định của cơ sở hạ tầng đối với kiến trúc thượng tầng\nChủ nghĩa duy vật lịch sử khẳng định cơ sở hạ tầng quyết định kiến trúc thượng tầng, bởi vì, quan hệ vật chất quyết định quan hệ tinh thần; tính tất yếu kinh tế xét đến cùng quyết định tính tất yếu chính trị - xã hội.\nTrong đời sống hiện thực của xã hội, kiến trúc thượng tầng luôn được biểu hiện ra một cách phong phú, phức tạp và đôi khi dường như không trực tiếp gắn với cơ sở hạ tầng. Nhưng đó chỉ là những biểu hiện bề ngoài, còn trong thực tế tất cả những hiện tượng của kiến trúc thượng tầng đều có nguyên nhân sâu xa trong những điều kiện kinh tế - vật chất của xã hội. Bất kỳ một hiện tượng nào thuộc kiến trúc thượng tầng, như chính trị, pháp luật, đảng phái, triết học, đạo đức, v.v. đều không thể giải thích được từ chính bản thân nó mà tất cả xét đến cùng phụ thuộc vào cơ sở hạ tầng, do cơ sở hạ tầng quyết định. Vì vậy, vai trò quyết định của cơ sở hạ tầng đối với kiến trúc thượng tầng thể hiện trước hết ở chỗ, cơ sở hạ tầng với tư cách là cơ cấu kinh tế hiện thực của xã hội sẽ quyết định kiểu kiến trúc thượng tầng của xã hội ấy. Cơ sở hạ tầng không chỉ sản sinh ra một kiểu kiến trúc thượng tầng tương ứng - tức là quyết định nguồn gốc, mà còn quyết định đến cơ cấu, tính chất và sự vận động, phát triển của kiến trúc thượng tầng.\nNếu cơ sở hạ tầng có đối kháng hay không đối kháng, thì kiến trúc thượng tầng của nó cũng có tính chất như vậy. Trong xã hội có đối kháng giai cấp, giai cấp nào chiếm địa vị thống trị về kinh tế thì cũng chiếm địa vị thống trị trong đời sống chính trị, tinh thần của xã hội; mâu thuẫn trong lĩnh vực kinh tế quyết định tính chất mâu thuẫn trong lĩnh vực tư tưởng của xã hội. Bởi vậy, cơ sở hạ tầng như thế nào thì cơ cấu, tính chất của kiến trúc thượng tầng là như thế ấy.\nNhững biến đổi căn bản của cơ sở hạ tầng sớm hay muộn sẽ dẫn đến sự biến đổi căn bản trong kiến trúc thượng tầng. Sự biến đổi đó diễn ra trong từng hình thái kinh tế - xã hội, cũng như khi chuyển từ một hình thái kinh tế - xã hội này sang một hình thái kinh tế - xã hội khác. C. Mác khẳng định: “Cơ sở kinh tế thay đổi thì toàn bộ cái kiến trúc thượng tầng đồ sộ cũng bị đảo lộn ít nhiều nhanh chóng”. Nguyên nhân của những biến đổi đó xét cho cùng là do sự phát triển của lực lượng sản xuất. Tuy nhiên, sự phát triển của lực lượng sản xuất chỉ trực tiếp gây ra sự biến đổi của cơ sở hạ tầng và đến lượt nó, sự biến đổi của cơ sở hạ tầng làm cho kiến trúc thượng tầng biến đổi một cách căn bản. Sự biến đổi của cơ sở hạ tầng và kiến trúc thượng tầng diễn ra rất phức tạp trong quá trình chuyển từ một hình thái kinh tế - xã hội lỗi thời sang một hình thái kinh tế - xã hội mới, tiến bộ hơn. Trong xã hội có đối kháng giai cấp, sự biến đổi đó tất yếu phải thông qua đấu tranh giai cấp và cách mạng xã hội.\nSự thay đổi của cơ sở hạ tầng đưa tới sự thay đổi của kiến trúc thượng tầng. Nhưng sự thay đổi của kiến trúc thượng tầng diễn ra rất phức tạp, có những bộ phận của kiến trúc thượng tầng thay đổi nhanh chóng cùng với sự thay đổi của cơ sở hạ tầng như chính trị, luật pháp, v.v.; có những nhân tố riêng lẻ của kiến trúc thượng tầng thay đổi chậm hơn như tôn giáo, nghệ thuật, v.v.. Cũng có những nhân tố nào đó của kiến trúc thượng tầng cũ vẫn được kế thừa để xây dựng kiến trúc thượng tầng mới.\n* Sự tác động trở lại của kiến trúc thượng tầng đối với cơ sở hạ tầng\nKiến trúc thượng tầng là sự phản ánh cơ sở hạ tầng, do cơ sở hạ tầng quyết định nhưng có sự tác động trở lại to lớn đối với kiến trúc thượng tầng. Bởi vì kiến trúc thượng tầng có tính độc lập tương đối so với cơ sở hạ tầng. Lĩnh vực ý thức, tinh thần khi ra đời, tồn tại thì có quy luật vận động nội tại của nó. Vai trò của kiến trúc thượng tầng chính là vai trò tích cực, tự giác của ý thức, tư tưởng. Vai trò của kiến trúc thượng tầng còn do sức mạnh vật chất của bộ máy tổ chức - thể chế luôn có tác động một cách mạnh mẽ trở lại cơ sở hạ tầng. Ph. Ăngghen khẳng định: “Quan điểm tư tưởng, đến lượt mình, nó tác động trở lại đến cơ sở hạ tầng kinh tế và có thể biến đổi cơ sở hạ tầng ấy trong những giới hạn nhất định”.\nKiến trúc thượng tầng củng cố, hoàn thiện và bảo vệ cơ sở hạ tầng sinh ra nó; ngăn chặn cơ sở hạ tầng mới, đấu tranh xóa bỏ tàn dư cơ sở hạ tầng cũ; định hướng, tổ chức, xây dựng chế độ kinh tế của kiến trúc thượng tầng. Thực chất vai trò kiến trúc thượng tầng là vai trò bảo vệ duy trì, củng cố lợi ích kinh tế của giai cấp thống trị xã hội. Mặt khác, kiến trúc thượng tầng trong các xã hội có giai cấp còn đảm bảo sự thống trị về chính trị và tư tưởng của giai cấp giữ địa vị thống trị về kinh tế. Nếu giai cấp thống trị không xác lập được sự thống trị về chính trị và tư tưởng, cơ sở kinh tế của nó không thể đứng vững được.\nTác động của kiến trúc thượng tầng đối với cơ sở hạ tầng diễn ra theo hai chiều hướng. Kiến trúc thượng tầng tác động cùng chiều với sự phát triển của cơ sở hạ tầng sẽ thúc đẩy cơ sở hạ tầng phát triển và nếu tác động ngược chiều với sự phát triển của cơ sở hạ tầng, của cơ cấu kinh tế nó sẽ kìm hãm sự phát triển của cơ sở hạ tầng, của kinh tế. Nghĩa là, khi kiến trúc thượng tầng phản ánh đúng tính tất yếu kinh tế, các quy luật kinh tế khách quan sẽ thúc đẩy kinh tế phát triển. Và ngược lại, khi kiến trúc thượng tầng không phản ánh đúng tính tất yếu kinh tế, các quy luật kinh tế khách quan sẽ kìm hãm sự phát triển của kinh tế và đời sống xã hội.\nTrong các bộ phận của kiến trúc thượng tầng thì kiến trúc thượng tầng về chính trị có vai trò quan trọng nhất, trong đó nhà nước có vai trò tác động to lớn đối với cơ sở hạ tầng. Nhà nước là tổ chức đặc biệt của quyền lực chính trị, không chỉ dựa trên hệ tư tưởng, mà còn dựa trên những hình thức nhất định của sự kiểm soát xã hội. Nhà nước sử dụng sức mạnh của bạo lực để tăng cường sức mạnh kinh tế của giai cấp thống trị và củng cố vững chắc địa vị của quan hệ sản xuất thống trị. Với ý nghĩa đó Ph. Ăngghen khẳng định: “Bạo lực (tức là quyền lực nhà nước) - cũng là một sức mạnh kinh tế”. Và chỉ rõ, tác động ngược lại của quyền lực nhà nước đối với sự phát triển kinh tế theo hai chiều hướng cơ bản, nếu tác động cùng hướng với sự phát triển kinh tế sẽ thúc đẩy kinh tế phát triển nhanh hơn; nếu tác động ngược lại hướng phát triển kinh tế sẽ kìm hãm sự phát triển của kinh tế; và nó có thể ngăn cản một vài hướng phát triển nào đấy của nền kinh tế, thúc đẩy sự phát triển đó theo những hướng khác - trong trường hợp này theo Ph. Ăngghen, rốt cuộc nó cũng dẫn đến một trong hai trường hợp trên.\nTuy nhiên, trong thực tiễn của đời sống xã hội, không phải chỉ có quyền lực nhà nước mới có sự tác động to lớn đến cơ sở hạ tầng, mà các bộ phận khác của kiến trúc thượng tầng như triết học, đạo đức, tôn giáo, nghệ thuật,... cũng đều tác động mạnh mẽ đến cơ sở hạ tầng bằng những hình thức khác nhau, với các cơ chế khác nhau. Ph. Ăngghen viết: “Sự phát triển của chính trị, pháp luật, triết học, tôn giáo, văn học, nghệ thuật, v.v. đều dựa trên cơ sở sự phát triển kinh tế. Nhưng tất cả chúng cũng có ảnh hưởng lẫn nhau và ảnh hưởng đến cơ sở kinh tế”. Song thường thường những sự tác động đó phải thông qua nhà nước, pháp luật, các thể chế tương ứng và chỉ qua đó chúng mới phát huy được hiệu lực đối với cơ sở hạ tầng, cũng như đối với toàn xã hội.\nSự vận động của quy luật này dưới chủ nghĩa xã hội có những đặc điểm riêng. Cơ sở hạ tầng và kiến trúc thượng tầng xã hội chủ nghĩa không hình thành tự phát trong lòng xã hội cũ. Để xác lập cơ sở hạ tầng xã hội chủ nghĩa thì đòi hỏi tất yếu là phải xóa bỏ cơ sở hạ tầng cũ thông qua cuộc cách mạng xã hội chủ nghĩa. Sự thiết lập kiến trúc thượng tầng chính trị xã hội chủ nghĩa là tiền đề cho sự hình thành, phát triển của cơ sở hạ tầng xã hội chủ nghĩa. Kiến trúc thượng tầng xã hội chủ nghĩa có mầm mống nảy sinh ngay từ cuộc đấu tranh của giai cấp vô sản và quần chúng lao động nhằm chống lại giai cấp thống trị bóc lột, lật đổ trật tự xã hội cũ. Song, sự hình thành và vai trò của nó được phát huy một cách đầy đủ, chủ yếu từ khi giai cấp vô sản giành được chính quyền. Kiến trúc thượng tầng xã hội chủ nghĩa chỉ có thể được củng cố, phát triển dựa trên cơ sở hạ tầng xã hội chủ nghĩa và trong chính sự nghiệp xây dựng chủ nghĩa xã hội. Bởi vậy, xây dựng và hoàn thiện kiến trúc thượng tầng xã hội chủ nghĩa phải xuất phát từ những đòi hỏi khách quan của sự phát triển kinh tế - xã hội. Đồng thời, phải tích cực, chủ động đấu tranh khắc phục mọi tàn dư tư tưởng lạc hậu của xã hội cũ và đánh bại mọi âm mưu chống phá của các thế lực thù địch.\nTrong thời kỳ quá độ lên chủ nghĩa xã hội, việc xây dựng cơ sở hạ tầng và kiến trúc thượng tầng xã hội chủ nghĩa phải được tiến hành từng bước với những hình thức, quy mô thích hợp. Cơ sở hạ tầng còn mang tính chất quá độ với một kết cấu kinh tế nhiều thành phần đan xen nhau của nhiều loại hình kinh tế - xã hội. Vì vậy, phát triển kinh tế nhiều thành phần theo định hướng xã hội chủ nghĩa là vấn đề có tính quy luật để phát triển cơ sở hạ tầng xã hội chủ nghĩa. Đồng thời, phải biết phát huy cao độ vai trò của kiến trúc thượng tầng trong phát triển kinh tế và xây dựng chủ nghĩa xã hội. Để xây dựng cơ sở hạ tầng và kiến trúc thượng tầng xã hội chủ nghĩa cần phải tránh khuynh hướng chủ quan duy ý chí, nôn nóng bất chấp các quy luật khách quan.\nCơ sở hạ tầng và kiến trúc thượng tầng xã hội chủ nghĩa khi đã phát triển một cách đầy đủ và hoàn thiện sẽ có bản chất ưu việt, tốt đẹp nhất trong lịch sử. Cơ sở hạ tầng xã hội chủ nghĩa không còn mâu thuẫn đối kháng, trong kết cấu kinh tế không bao hàm sự đối lập về lợi ích căn bản. Đặc trưng của kiến trúc thượng tầng xã hội chủ nghĩa là sự nhất trí về chính trị và tinh thần trong toàn xã hội. Tính ưu việt của kiến trúc thượng tầng xã hội chủ nghĩa được biểu hiện ở hệ tư tưởng của giai cấp công nhân, là hệ tư tưởng tiến bộ và cách mạng nhất trong lịch sử. Nó còn được biểu hiện ở vai trò của nhà nước và pháp luật xã hội chủ nghĩa; ở sự phát triển các hình thái ý thức xã hội một cách phong phú, đa dạng chứa đựng đầy đủ các giá trị của chủ nghĩa xã hội.\n* Ý nghĩa trong đời sống xã hội\nQuy luật về mối quan hệ biện chứng giữa cơ sở hạ tầng và kiến trúc thượng tầng là cơ sở khoa học cho việc nhận thức một cách đúng đắn mối quan hệ giữa kinh tế và chính trị. Kinh tế và chính trị tác động biện chứng, trong đó kinh tế quyết định chính trị, chính trị tác động trở lại to lớn, mạnh mẽ đối với kinh tế. Thực chất của vai trò kiến trúc thượng tầng là vai trò hoạt động tự giác, tích cực của các giai cấp, đảng phái vì lợi ích kinh tế sống còn của mình. Sự tác động của kiến trúc thượng tầng đối với cơ sở hạ tầng trước hết và chủ yếu thông qua đường lối, chính sách của đảng, nhà nước. Chính vì vậy, V.I. Lênin cho rằng: “Chính trị là sự biểu hiện tập trung của kinh tế... Chính trị không thể không chiếm địa vị hàng đầu so với kinh tế”.\nTrong nhận thức và thực tiễn, nếu tách rời hoặc tuyệt đối hóa một yếu tố nào giữa kinh tế và chính trị đều là sai lầm. Tuyệt đối hóa kinh tế, hạ thấp hoặc phủ nhận yếu tố chính trị là rơi vào quan điểm duy vật tầm thường, duy vật kinh tế sẽ dẫn đến vô chính phủ, bất chấp kỷ cương, pháp luật và không tránh khỏi thất bại, đổ vỡ. Nếu tuyệt đối hóa về chính trị, hạ thấp hoặc phủ định vai trò của kinh tế sẽ dẫn đến duy tâm, duy ý chí, nôn nóng, chủ quan, đốt cháy giai đoạn và cũng không tránh khỏi thất bại.\nTrong quá trình lãnh đạo cách mạng, Đảng Cộng sản Việt Nam đã rất quan tâm đến nhận thức và vận dụng quy luật này. Trong thời kỳ đổi mới đất nước, Đảng Cộng sản Việt Nam chủ trương đổi mới toàn diện cả kinh tế và chính trị, trong đó đổi mới kinh tế là trung tâm, đồng thời đổi mới chính trị từng bước thận trọng vững chắc bằng những hình thức, bước đi thích hợp; giải quyết tốt mối quan hệ giữa đổi mới - ổn định - phát triển, giữ vững định hướng xã hội chủ nghĩa."
  },
  {
    "title": "4. Sự phát triển các hình thái kinh tế - xã hội là một quá trình lịch sử - tự nhiên",
    "level": 2,
    "body": ""
  },
  {
    "title": "a) Phạm trù hình thái kinh tế - xã hội",
    "level": 3,
    "body": "Trên lập trường duy vật lịch sử, các nhà kinh điển mácxít khẳng định, những quan hệ vật chất của xã hội là quan hệ cơ bản quyết định các quan hệ xã hội khác và chỉ ra cấu trúc hiện thực của một xã hội cụ thể thông qua phạm trù hình thái kinh tế - xã hội.\nHình thái kinh tế - xã hội là một phạm trù cơ bản của chủ nghĩa duy vật lịch sử dùng để chỉ xã hội ở từng nấc thang lịch sử nhất định với một kiểu quan hệ sản xuất đặc trưng cho xã hội đó, phù hợp với một trình độ nhất định của lực lượng sản xuất và một kiến trúc thượng tầng tương ứng được xây dựng trên quan hệ sản xuất đặc trưng ấy.\nPhạm trù hình thái kinh tế - xã hội chỉ ra kết cấu xã hội trong mỗi giai đoạn lịch sử nhất định bao gồm ba yếu tố cơ bản, phổ biến: lực lượng sản xuất, quan hệ sản xuất (cơ sở hạ tầng); kiến trúc thượng tầng. Lực lượng sản xuất là nền tảng vật chất của xã hội, tiêu chuẩn khách quan để phân biệt các thời đại kinh tế khác nhau, yếu tố xét đến cùng quyết định sự vận động, phát triển của hình thái kinh tế - xã hội. Quan hệ sản xuất là quan hệ khách quan, cơ bản, chi phối và quyết định mọi quan hệ xã hội, đồng thời là tiêu chuẩn quan trọng nhất để phân biệt bản chất các chế độ xã hội khác nhau. Kiến trúc thượng tầng là sự thể hiện các mối quan hệ giữa người với người trong lĩnh vực tinh thần, tiêu biểu cho bộ mặt tinh thần của đời sống xã hội.\nĐây là sự trừu tượng hóa, khái quát hóa những mặt, những yếu tố chung nhất, phổ biến nhất của mọi xã hội ở bất kỳ giai đoạn lịch sử nào. Phạm trù hình thái kinh tế - xã hội không chỉ mang tính trừu tượng, mà còn mang tính cụ thể, cho phép xem xét xã hội ở từng quốc gia, dân tộc, trong từng giai đoạn lịch sử cụ thể với các tiêu chí có thể xác định được với một quan hệ sản xuất đặc trưng, một trình độ phát triển lực lượng sản xuất nhất định và một kiểu kiến trúc thượng tầng tiêu biểu cho bộ mặt tinh thần của xã hội đó. Và như vậy đem lại nhận thức sâu sắc cho con người, đem lại tính cụ thể trong tư duy về lịch sử xã hội. Sau khi trừu tượng hóa từng mặt, từng yếu tố cơ bản của lịch sử xã hội, phạm trù hình thái kinh tế - xã hội đem lại sự nhận thức tổng hợp và sâu sắc về xã hội loài người ở từng giai đoạn lịch sử nhất định."
  },
  {
    "title": "b) Tiến trình lịch sử - tự nhiên của xã hội loài người",
    "level": 3,
    "body": "Ba yếu tố cơ bản: lực lượng sản xuất, quan hệ sản xuất (cơ sở hạ tầng) và kiến trúc thượng tầng tác động biện chứng, tạo nên sự vận động, phát triển của lịch sử xã hội, thông qua sự tác động tổng hợp của hai quy luật cơ bản là quy luật quan hệ sản xuất phù hợp với trình độ của lực lượng sản xuất và quy luật về mối quan hệ biện chứng giữa cơ sở hạ tầng và kiến trúc thượng tầng của xã hội.\nSự vận động, phát triển của xã hội bắt đầu từ sự phát triển của lực lượng sản xuất, trước hết là sự biến đổi, phát triển của công cụ sản xuất và sự phát triển về tri thức, kinh nghiệm, kỹ năng của người lao động. Mỗi sự phát triển của lực lượng sản xuất đều tạo ra khả năng, điều kiện và đặt ra yêu cầu khách quan cho sự biến đổi của quan hệ sản xuất. Sự phù hợp biện chứng giữa quan hệ sản xuất với trình độ phát triển của lực lượng sản xuất là yêu cầu khách quan của nền sản xuất xã hội. Khi lực lượng sản xuất phát triển về chất, đòi hỏi phải xóa bỏ quan hệ sản xuất cũ, thiết lập quan hệ sản xuất mới về chất. Sự phát triển về chất của quan hệ sản xuất tất yếu dẫn đến sự thay đổi về chất của cơ sở hạ tầng xã hội. Khi cơ sở hạ tầng xã hội biến đổi về chất dẫn đến sự biến đổi, phát triển căn bản (nhanh hay chậm, ít hoặc nhiều) của kiến trúc thượng tầng xã hội. Hình thái kinh tế - xã hội cũ mất đi, hình thái kinh tế - xã hội mới, tiến bộ hơn ra đời. Cứ như vậy lịch sử xã hội loài người là một tiến trình nối tiếp nhau từ thấp đến cao của các hình thái kinh tế - xã hội: Cộng sản nguyên thủy - chiếm hữu nô lệ - phong kiến - tư bản chủ nghĩa - xã hội chủ nghĩa; trong đó, có sự thống nhất giữa quy luật chung cơ bản phổ biến với quy luật đặc thù và quy luật riêng của lịch sử, chính vì vậy, C. Mác cho rằng: “Tôi coi sự phát triển của những hình thái kinh tế - xã hội là một quá trình lịch sử - tự nhiên”.\nTiến trình lịch sử xã hội loài người là kết quả của sự thống nhất giữa lôgích và lịch sử. Xu hướng cơ bản, xu hướng chung của sự vận động, phát triển của lịch sử loài người là do sự chi phối của quy luật khách quan (thống nhất giữa cái chung với cái đặc thù và cái riêng) xét đến cùng là sự phát triển của lực lượng sản xuất. Lôgích của toàn bộ tiến trình lịch sử loài người là sự kế tiếp nhau của các hình thái kinh tế - xã hội từ thấp đến cao. Đó là con đường tất yếu của tiến bộ lịch sử. Mặt khác, sự phát triển của xã hội loài người còn mang tính lịch sử. Các hình thái kinh tế - xã hội như những trạng thái khác nhau về chất trong tiến trình lịch sử, với những điều kiện về không gian, thời gian cụ thể, với các tiêu chí về sự phát triển của lực lượng sản xuất, kiểu quan hệ sản xuất, kiểu kiến trúc thượng tầng của mỗi xã hội cụ thể.\nSự thống nhất giữa lôgích và lịch sử trong tiến trình lịch sử - tự nhiên của xã hội loài người bao hàm cả sự phát triển tuần tự đối với lịch sử phát triển toàn thế giới và sự phát triển “bỏ qua” một hay vài hình thái kinh tế - xã hội đối với một số quốc gia, dân tộc cụ thể.\nSự phát triển phong phú, nhiều vẻ, đa dạng, phức tạp của các hình thái kinh tế - xã hội cụ thể của các giai đoạn xã hội, các quốc gia, dân tộc cụ thể; bao gồm cả những bước quanh co, thậm chí những bước thụt lùi lớn, khả năng rút ngắn, bỏ qua những giai đoạn phát triển lịch sử nhất định. Theo V.I. Lênin: “Tính quy luật chung của sự phát triển lịch sử toàn thế giới đã không loại trừ mà trái lại, còn bao hàm một số giai đoạn phát triển mang những đặc điểm hoặc về hình thức, hoặc về trình tự của sự phát triển đó”. Bản chất của việc “bỏ qua” một hay vài hình thái kinh tế - xã hội, sự phát triển rút ngắn xã hội đó là rút ngắn các giai đoạn, bước đi của nền văn minh loài người mà cốt lõi là sự tăng trưởng nhảy vọt của lực lượng sản xuất.\nThực tiễn lịch sử đã chứng minh toàn bộ lịch sử xã hội loài người phát triển tuần tự qua tất cả các giai đoạn của các hình thái kinh tế - xã hội đã có. Nhưng do đặc điểm về lịch sử, về không gian, thời gian, về sự tác động của nhân tố khách quan và nhân tố chủ quan, có những quốc gia phát triển tuần tự, nhưng có những quốc gia phát triển bỏ qua một hay vài hình thái kinh tế - xã hội nào đó.\nDo quy luật phát triển không đều, trên thế giới thường xuất hiện những trung tâm phát triển cao hơn, đồng thời bên cạnh đó còn có những vùng, những quốc gia, dân tộc ở trình độ phát triển thấp, thậm chí rất thấp. Do sự giao lưu, hợp tác quốc tế mà giữa các trung tâm, các khu vực, các quốc gia xuất hiện khả năng một số nước đi sau có thể rút ngắn tiến trình lịch sử. Quy luật kế thừa sự phát triển lịch sử luôn luôn cho phép các quốc gia, dân tộc có thể bỏ qua các giai đoạn phát triển không cần thiết để vươn tới trình độ tiên tiến của nhân loại. Tuy nhiên việc phát triển bỏ qua một hay vài hình thái kinh tế - xã hội, bên cạnh những điều kiện khách quan của thời đại, còn phụ thuộc vào nhân tố chủ quan của mỗi quốc gia, dân tộc."
  },
  {
    "title": "c) Giá trị khoa học bền vững và ý nghĩa cách mạng",
    "level": 3,
    "body": "Lý luận hình thái kinh tế - xã hội ra đời đem lại một cuộc cách mạng trong toàn bộ quan niệm về lịch sử xã hội. Đây là biểu hiện tập trung của quan niệm duy vật biện chứng về lịch sử xã hội, bác bỏ quan niệm trừu tượng, duy vật tầm thường, duy tâm, phi lịch sử về xã hội trước đó, trở thành hòn đá tảng của khoa học xã hội, cơ sở phương pháp luận khoa học và cách mạng cho sự phân tích lịch sử xã hội. Lý luận hình thái kinh tế - xã hội đã giải quyết một cách khoa học về vấn đề phân loại các chế độ xã hội và phân kỳ lịch sử, thay thế các quan niệm duy tâm, siêu hình trước đó đã thống trị trong khoa học xã hội. Chỉ ra động lực phát triển của lịch sử xã hội không phải do một lực lượng tinh thần hoặc lực lượng siêu nhiên thần bí nào cả, mà do hoạt động thực tiễn của con người, trước hết là thực tiễn sản xuất vật chất dưới sự tác động của các quy luật khách quan.\nMuốn nhận thức và cải tạo xã hội cũ, xây dựng xã hội mới phải nhận thức và tác động cả ba yếu tố cơ bản: lực lượng sản xuất, quan hệ sản xuất (cơ sở hạ tầng) và kiến trúc thượng tầng. Xem nhẹ hoặc tuyệt đối hóa một yếu tố nào cũng sai lầm, xét đến cùng sự là bắt đầu từ việc xây dựng, phát triển lực lượng sản xuất.\nHọc thuyết hình thái kinh tế - xã hội là cơ sở khoa học cho việc xác định con đường phát triển của Việt Nam đó là quá độ lên chủ nghĩa xã hội, bỏ qua chế độ tư bản chủ nghĩa. Đây chính là sự lựa chọn duy nhất đúng đắn, có khả năng và điều kiện để thực hiện. Con đường phát triển quá độ lên chủ nghĩa xã hội, bỏ qua chế độ tư bản chủ nghĩa ở Việt Nam là phù hợp với tính quy luật của việc “bỏ qua” một hay vài hình thái kinh tế - xã hội trong sự phát triển lịch sử.\nQuá độ lên chủ nghĩa xã hội, bỏ qua chế độ tư bản chủ nghĩa ở Việt Nam là phù hợp với quy luật phát triển rút ngắn trong lịch sử loài người. Bản chất của sự phát triển rút ngắn xã hội là rút ngắn các giai đoạn, các bước đi của nền văn minh loài người, cốt lõi là sự tăng trưởng nhảy vọt của lực lượng sản xuất. Qua quá trình tổng kết thực tiễn, phát triển lý luận, Đảng Cộng sản Việt Nam đã chỉ ra thực chất của việc bỏ qua chế độ tư bản chủ nghĩa, quá độ lên chủ nghĩa xã hội ở Việt Nam hiện nay: “Con đường đi lên chủ nghĩa xã hội ở Việt Nam là sự phát triển quá độ lên chủ nghĩa xã hội, bỏ qua chế độ (hình thái kinh tế - xã hội) tư bản chủ nghĩa, bỏ qua việc xác lập vị trí thống trị của quan hệ sản xuất và kiến trúc thượng tầng tư bản chủ nghĩa nhưng tiếp thu, kế thừa những thành tựu của tiến bộ kinh tế, xã hội mà nhân loại đã đạt được dưới chủ nghĩa tư bản, đặc biệt là những thành tựu về kinh tế và khoa học công nghệ, để phát triển nhanh lực lượng sản xuất, xây dựng nền kinh tế hiện đại”.\nHọc thuyết hình thái kinh tế - xã hội là cơ sở lý luận, phương pháp luận khoa học trong quán triệt quan điểm đường lối của Đảng Cộng sản Việt Nam. Mô hình, mục tiêu chủ nghĩa xã hội ở Việt Nam được xác định với các tiêu chí về lực lượng sản xuất, quan hệ sản xuất, kiến trúc thượng tầng. Đồng thời xác định các phương hướng xây dựng chủ nghĩa xã hội trong thời kỳ quá độ lên chủ nghĩa xã hội ở Việt Nam.\nHọc thuyết hình thái kinh tế - xã hội là cơ sở lý luận, phương pháp luận khoa học và cách mạng trong đấu tranh bác bỏ những quan điểm thù địch, sai trái, phiến diện về xã hội. Phê phán thuyết kỹ trị, thuyết hội tụ đã tuyệt đối hóa yếu tố kinh tế - kỹ thuật, xóa nhòa sự khác nhau về bản chất của các chế độ xã hội nhằm chứng minh cho sự tồn tại vĩnh viễn của chế độ tư bản.\nTrong thời đại ngày nay có nhiều học giả cũng suy tư về con đường và quy luật phát triển của xã hội loài người. Một số học giả phương Tây tìm cách bác bỏ học thuyết hình thái kinh tế - xã hội của C. Mác bằng cách đưa ra cách tiếp cận mới hoặc đặt ngược lại vấn đề mà C. Mác đã chứng minh. Điển hình là Fukuyama với học thuyết “sự kết thúc của lịch sử” và Huntington với học thuyết “sự va chạm của các nền văn minh”.\nHọc giả người Mỹ Francis Fukuyama có chuyên luận “Sự kết thúc của lịch sử?” đăng trên tạp chí Lợi ích quốc gia (1989) và phát triển quan điểm này, ông đã viết và xuất bản cuốn sách Sự kết thúc của lịch sử và con người cuối cùng (1992). F. Fukuyama cho rằng Liên Xô thất bại, Đông Âu thay đổi, Chiến tranh lạnh kết thúc, những điều đó chứng tỏ sự cáo chung của chủ nghĩa cộng sản và lịch sử phát triển của loài người chỉ còn một con đường duy nhất, đó là kinh tế thị trường và chính trị dân chủ của phương Tây. F. Fukuyama nói: “Những gì chúng ta đang chứng kiến không chỉ là sự cáo chung của Chiến tranh lạnh, hay sự trôi qua của một giai đoạn đặc biệt trong lịch sử sau Chiến tranh thế giới lần thứ hai, mà còn là sự cáo chung của lịch sử theo nghĩa rằng đó là điểm kết thúc trong cuộc tiến hóa tư tưởng của loài người và sự phổ quát hóa của dân chủ tự do phương Tây với tư cách là thể thức cuối cùng của sự cai trị con người”. Quan điểm sự kết thúc của lịch sử có nguồn gốc từ cách hiểu của Fukuyama về Hegel: nếu Hegel cho rằng con người bị thúc đẩy bởi động lực dục vọng, khiến cho lịch sử tiến hóa không ngừng thì Fukuyama cho rằng lịch sử sẽ dừng ở giai đoạn tự do dân chủ, không còn bất cứ một giai đoạn nào khác cao hơn có thể thay thế. Fukuyama khẳng định chế độ tự do dân chủ kiểu phương Tây, mặc dù chưa phải là hoàn mỹ, song là điểm cuối cùng của sự phát triển hình thái ý thức con người, cũng là hình thức thống trị cuối cùng của nhân loại. Mặc dù được coi là tuyên ngôn thắng lợi của chủ nghĩa tư bản, song luận điểm này của Fukuyama đã bị phê phán trên toàn thế giới, trong đó có cả ở Mỹ, đặc biệt là sau sự kiện bộc lộ thực tế trái ngược lại với những tín điều của Fukuyama, như sự kiện khủng bố ngày 11/9 tại New York, sự kiện khủng hoảng tài chính toàn cầu năm 2007 - 2008 hay phong trào chiếm phố Wall năm 2011,... Có không ít người phê phán luận điểm của Fukuyama, chỉ ra những thực tế chứng minh sự kết thúc của lịch sử là có thật, song lịch sử đó là lịch sử của chủ nghĩa tư bản, vì dù có tạo ra sức sản xuất như thế nào, dù có tự cải tạo mình như thế nào đi nữa thì chủ nghĩa tư bản vẫn mang trong mình bản chất bóc lột, xâm chiếm và bất bình đẳng.\nTác giả Samuel P. Huntington đã cho đăng bài “Sự va chạm của các nền văn minh?” trên tạp chí Ngoại giao của Mỹ như để phản hồi và bổ sung cho quan điểm của Fukuyama. S. Huntington đã phát triển quan điểm của mình trong cuốn sách nổi tiếng Sự va chạm của các nền văn minh và sự tái lập trật tự thế giới (1996). Các quan điểm chủ yếu của Huntington về sự xung đột các nền văn minh như sau: Một là, nguyên nhân căn bản của xung đột quốc tế trong thế giới tương lai không phải là kinh tế hay ý thức hệ, mà là văn hóa. Xung đột chủ yếu của chính trị toàn cầu là xung đột giữa các nước, các tập đoàn thuộc các nền văn minh khác nhau, biên giới của các nền văn minh cũng chính là giới tuyến của chiến tranh. Hai là, xung đột văn minh là hiểm họa hàng đầu đối với hòa bình thế giới, vì vậy, phải xây dựng thế giới trên nền tảng của văn minh. Ba là, trật tự thế giới mới sẽ được hình thành dựa trên văn hóa và văn minh, và lần đầu tiên kết cấu thế giới xuất hiện đa cực, đa văn minh như vậy. Bốn là, xung đột văn minh thế giới sẽ chủ yếu là giữa 7 nền văn minh, trong đó văn minh Islam giáo và văn minh Nho giáo có sức uy hiếp lớn nhất đối với văn minh phương Tây. Vì luận cứ của Huntington không đầy đủ, không toàn diện nên bất cứ quan điểm nào của Huntington cũng đều có thể phản đối từ các phương diện lý luận, lịch sử và thực tiễn khác nhau. Huntington đã quá đề cao yếu tố văn minh trong khi nói đến xu hướng vận động của xã hội, đặc biệt trong xã hội hiện đại mà xem nhẹ các yếu tố khác cũng vô cùng quan trọng là kinh tế, chính trị và quân sự. Ngoài ra, bản thân xung đột không chỉ tồn tại giữa các nền văn minh, mà còn có xung đột giữa các quốc gia trong một nền văn minh, thậm chí trong một quốc gia mà mức độ không hề thua kém sự xung đột giữa các nền văn minh. Nhà Đông phương học nổi tiếng Edward Said còn phê phán Huntington mạnh hơn nữa, rằng mục đích của Huntington không phải là để nhận thức và hòa giải các nền văn minh khác biệt, mà để duy trì, mở rộng Chiến tranh lạnh. Nhiều học giả trên thế giới cũng phê phán Huntington và Fukuyama chỉ đứng trên lập trường của chủ nghĩa tư bản để bảo vệ quyền lợi của các nước tư bản phát triển.\nHọc thuyết hình thái kinh tế - xã hội cũng là cơ sở lý luận khoa học để phê phán quan điểm tuyệt đối hóa cách tiếp cận xã hội bằng các nền văn minh của Alvin Toffler. Toffler đã chia lịch sử thành ba “làn sóng”, tức là ba nền văn minh lần lượt kế tiếp nhau: nông nghiệp, công nghiệp và sau công nghiệp (còn gọi là văn minh tin học, văn minh trí tuệ). Cách tiếp cận nền văn minh đã cập nhật được sự phát triển của khoa học - công nghệ, của trí tuệ và có giá trị nhất định. Nhưng một số người đòi dùng cách tiếp cận này để thay thế cách tiếp cận hình thái kinh tế - xã hội là sai lầm. Tức là tuyệt đối hóa yếu tố lực lượng sản xuất, xem nhẹ yếu tố quan hệ sản xuất và kiến trúc thượng tầng, không thấy được nguồn gốc, động lực của sự phát triển lịch sử xã hội.\nNgày nay thực tiễn xã hội và sự phát triển của nhận thức khoa học đã bổ sung, phát triển mới các quan niệm lịch sử xã hội, song lý luận hình thái kinh tế - xã hội vẫn giữ nguyên giá trị, là quan niệm duy nhất khoa học và cách mạng để phân tích lịch sử và nhận thức các vấn đề xã hội, là cơ sở nền tảng lý luận cho chủ nghĩa xã hội khoa học.\nNghiên cứu lý luận hình thái kinh tế - xã hội có ý nghĩa rất quan trọng đối với nâng cao nhận thức về bản chất khoa học và cách mạng của chủ nghĩa Mác - Lênin, quán triệt sâu sắc đường lối của Đảng Cộng sản Việt Nam về xây dựng chủ nghĩa xã hội, củng cố niềm tin, lý tưởng cách mạng, kiên định con đường chủ nghĩa xã hội. Đây cũng là cơ sở khoa học và cách mạng trong cuộc đấu tranh tư tưởng chống lại các quan điểm phiến diện, sai lầm, phản động hòng phủ nhận mục tiêu, lý tưởng, phủ nhận con đường đi lên chủ nghĩa xã hội ở Việt Nam."
  }
]